// AnimBlueprintGeneratedClass 3P_HeroLoco_Base_ABP.3P_HeroLoco_Base_ABP_C
// Size: 0x863c (Inherited: 0x2c0)
struct U3P_HeroLoco_Base_ABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x370(0x28)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_23; // 0x398(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_22; // 0x408(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_21; // 0x478(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_20; // 0x4e8(0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x558(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x640(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x728(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x810(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x8f8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x9a8(0xa0)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_19; // 0xa48(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_18; // 0xab8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_17; // 0xb28(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_16; // 0xb98(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_15; // 0xc08(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_14; // 0xc78(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_13; // 0xce8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_12; // 0xd58(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_11; // 0xdc8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_10; // 0xe38(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_9; // 0xea8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_8; // 0xf18(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_7; // 0xf88(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_6; // 0xff8(0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x1068(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x1150(0xc8)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_5; // 0x1218(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x12e0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x1380(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x1468(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x1550(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x1638(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x1720(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x1808(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x18f0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x19d8(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x1ac0(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x1b70(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x1c58(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x1d08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x1df0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x1ed8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x1fc0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x20a8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_59; // 0x2158(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x2188(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x21b0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x21d8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x2250(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x22f0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_58; // 0x2368(0x30)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_4; // 0x2398(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x2460(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x24d8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x2550(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x25c8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x2640(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x26b8(0xa0)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_3; // 0x2758(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x2820(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x2898(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x2910(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x2988(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x2a00(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_57; // 0x2a78(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_17; // 0x2aa8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_56; // 0x2b58(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_16; // 0x2b88(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_55; // 0x2c38(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x2c68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x2c90(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x2cb8(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x2da0(0xc8)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_5; // 0x2e68(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_4; // 0x2ed8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_3; // 0x2f48(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_2; // 0x2fb8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping; // 0x3028(0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x3098(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x3180(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x3268(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x3350(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x3438(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_54; // 0x34e8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x3518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x3540(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x3568(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_53; // 0x35e0(0x30)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_2; // 0x3610(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x36d8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x3750(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x37c8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x3840(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x38b8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_52; // 0x3930(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0x3960(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_51; // 0x3a10(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x3a40(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0x3af0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x3b20(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x3bd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x3bf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x3c20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x3c48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x3c70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x3c98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x3cc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x3ce8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x3d10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x3d38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x3d60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x3d88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x3db0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x3dd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x3e00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x3e28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x3e50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x3e78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x3ea0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x3ec8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x3ef0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x3f18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x3f40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x3f68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x3f90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x3fb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x3fe0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x4008(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x4030(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x4058(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x4080(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x40a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x40d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x40f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x4120(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x4148(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x4170(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x4198(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x41c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x41e8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0x4260(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x4290(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0x4308(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x4338(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x43b0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x43e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x4408(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x4430(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x4458(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x4480(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x44a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x44d0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x4548(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x4578(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x45f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x4620(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x4698(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x46c8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x4740(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x4770(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x4820(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x4850(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x48c8(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x48f0(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x49b8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x49e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x4a10(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x4a38(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x4ab0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x4ae0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x4b58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x4b88(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x4c00(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x4c30(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x4ce0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x4d10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x4d38(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x4d60(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x4dd8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x4e08(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x4e80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x4eb0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x4f28(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x4f58(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x5008(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x5038(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x5060(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x5088(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x50b0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x5128(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x5158(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x51d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x5200(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x5278(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x52a8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x5358(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x5388(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x5400(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x5430(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x5458(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x54d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x5500(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x5578(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x55a8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x5658(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x5688(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x56b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x56d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x5700(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x5728(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x57a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x57d0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x5848(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x5878(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x58f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x5920(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x5998(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x59c8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x5a40(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x5a70(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x5b20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x5b50(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x5bc8(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x5c40(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x5cf0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x5d68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x5d98(0x78)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x5e10(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x5eb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x5ed8(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x5f00(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x5fe8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x60d0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x61b8(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x62a0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x6350(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x6380(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x63a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x63d0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x6448(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x64c0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x6538(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x65b0(0x78)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag; // 0x6628(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x66f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x6720(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x6798(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x67c8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x6878(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x68a8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x6958(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x6980(0xa0)
	struct FAnimNode_BlendListByGameplayTagQuery AnimGraphNode_BlendListByGameplayTagQuery; // 0x6a20(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x6ae8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x6b60(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x6bd8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x6c50(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x6c80(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6ca8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x6d48(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x6dc0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x6e38(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x6e68(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x6ee0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x6f10(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x6fc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x6ff0(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x7068(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x7090(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x7158(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x7188(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x71b0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7228(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x7258(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x72d0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x7300(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x73b0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x73e0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x7408(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x7438(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x74e8(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x75a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x75c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x75f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x7618(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x7640(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x76b8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x7730(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x77a8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x7858(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x7880(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x7948(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x79c0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x79f0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7a18(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x7a48(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x7ac0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x7b38(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7bb0(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x7c60(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7c88(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7d50(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x7dc8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7df8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7e20(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x7e50(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7f00(0xb8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x7fb8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7fd8(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_4; // 0x7ff8(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x80e8(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x81d8(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x82c8(0xf0)
	struct FAnimDirectionRange BackwardDirection; // 0x83b8(0x1c)
	struct FAnimDirectionRange LeftDirection; // 0x83d4(0x1c)
	struct FAnimDirectionRange RightDirection; // 0x83f0(0x1c)
	struct FAnimDirectionRange ForwardDirection; // 0x840c(0x1c)
	struct FAnimLocomotionData LocomotionData; // 0x8428(0x40)
	struct FGobiAnimationState AnimationState; // 0x8468(0x58)
	struct FHeroAnimState3P HeroAnimState; // 0x84c0(0x28)
	struct FLocoTurnInPlace TurnInPlaceState; // 0x84e8(0xb0)
	struct FLocomotionPrediction LocoPredict; // 0x8598(0x68)
	struct FLadderAnimState LadderState; // 0x8600(0x08)
	struct FLocoLeaning Leaning; // 0x8608(0x0c)
	float LocoBlendTime; // 0x8614(0x04)
	float BlendTime; // 0x8618(0x04)
	struct FAnimState3P AnimState3P; // 0x861c(0x08)
	struct FHeroDraggedAnimData3P HeroDraggedAnimData; // 0x8624(0x14)
	float MaxJogSpeed; // 0x8638(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function 3P_HeroLoco_Base_ABP.3P_HeroLoco_Base_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

