// AnimBlueprintGeneratedClass 3P_Hero_ABP.3P_Hero_ABP_C
// Size: 0x400c (Inherited: 0xba0)
struct U3P_Hero_ABP_C : UHeroAnimInstance3P {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xba0(0x08)
	char pad_BA8[0x8]; // 0xba8(0x08)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0xbb0(0x590)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1140(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x1160(0xb8)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x1218(0x98)
	struct FAnimNode_CurveSource AnimGraphNode_CurveSource; // 0x12b0(0x40)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x12f0(0x108)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x13f8(0xf8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x14f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x15f8(0x108)
	struct FAnimNode_SlopeWarping AnimGraphNode_SlopeWarping; // 0x1700(0x1a0)
	float __CustomProperty_AimOffsetWeight_81EF3843487DC4C90A795AABE38C2FA4; // 0x18a0(0x04)
	struct FHeroAnimState3P __CustomProperty_HeroAnimState_81EF3843487DC4C90A795AABE38C2FA4; // 0x18a4(0x28)
	struct FAnimState3P __CustomProperty_AnimState3P_81EF3843487DC4C90A795AABE38C2FA4; // 0x18cc(0x08)
	struct FGobiAnimationState __CustomProperty_AnimationState_81EF3843487DC4C90A795AABE38C2FA4; // 0x18d4(0x58)
	struct FGameplayTag __CustomProperty_HeroStance_81EF3843487DC4C90A795AABE38C2FA4; // 0x192c(0x08)
	char pad_1934[0x4]; // 0x1934(0x04)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_2; // 0x1938(0xa8)
	struct FHeroDraggedAnimData3P __CustomProperty_HeroDraggedAnimData_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x19e0(0x14)
	struct FAnimState3P __CustomProperty_AnimState3P_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x19f4(0x08)
	float __CustomProperty_BlendTime_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x19fc(0x04)
	float __CustomProperty_LocoBlendTime_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1a00(0x04)
	struct FLocoLeaning __CustomProperty_Leaning_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1a04(0x0c)
	struct FLadderAnimState __CustomProperty_LadderState_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1a10(0x08)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1a18(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1a80(0xb0)
	struct FHeroAnimState3P __CustomProperty_HeroAnimState_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1b30(0x28)
	struct FGobiAnimationState __CustomProperty_AnimationState_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1b58(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1bb0(0x40)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1bf0(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1c0c(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1c28(0x1c)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_6F9D7EFD4B3DCFD3AF55CD9C7A86368D; // 0x1c44(0x1c)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x1c60(0xa8)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x1d08(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1d50(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1e10(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x1ed0(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1f18(0xa0)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag; // 0x1fb8(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x2080(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x2138(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x2160(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x21a8(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x2268(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x22b0(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x2368(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x23b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x23d8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2400(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x24c0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x2560(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x2618(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x2640(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x2668(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x2690(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x26b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x26e0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x2708(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x27c0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x27e8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x2830(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x2858(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x2910(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x2938(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x2960(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x2a18(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x2a40(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2a68(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x2b18(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x2c00(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2ce8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2dd0(0xe8)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_4; // 0x2eb8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_3; // 0x2f28(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_2; // 0x2f98(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping; // 0x3008(0x70)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3078(0x190)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x3208(0xb8)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x32c0(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x34a0(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3680(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x36a0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x3758(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x3810(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3838(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x38f8(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3998(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x39e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x3a08(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x3a30(0xb8)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x3ae8(0x120)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x3c08(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x3cc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x3ce8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x3d10(0x48)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x3d58(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3df8(0xb8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3eb0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x3ee0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x3f08(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3f30(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3fd0(0x28)
	struct FGameplayTag HeroStance; // 0x3ff8(0x08)
	float LocoBlendTime; // 0x4000(0x04)
	float WarpAngle; // 0x4004(0x04)
	float WarpHipOffset; // 0x4008(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function 3P_Hero_ABP.3P_Hero_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

