// BlueprintGeneratedClass AnimEvalSet_Heavy_Damage_DeathReaction.AnimEvalSet_Heavy_Damage_DeathReaction_C
// Size: 0x5c8 (Inherited: 0xc0)
struct UAnimEvalSet_Heavy_Damage_DeathReaction_C : UAnimationEvalSet {
	struct FGameplayEval_DamageAmount DamageAmountComparison; // 0xc0(0x98)
	struct FGameplayEval_DamageRange DamageAmountRange; // 0x158(0xc8)
	struct FGameplayEval_DamageType DamageType; // 0x220(0xc0)
	struct FGameplayEval_DamageBone DamageBone; // 0x2e0(0x60)
	struct FGameplayEval_Distance DistanceToDamageSource; // 0x340(0xd0)
	struct FGameplayEval_Health AvatarHealth; // 0x410(0x58)
	struct FGameplayEval_GameplayTags AvatarTags; // 0x468(0x98)
	struct FGameplayEval_SpeedRange AvatarSpeed; // 0x500(0xc8)
};

