// BlueprintGeneratedClass AnimEvalSet_Medium_Damage_DeathReaction.AnimEvalSet_Medium_Damage_DeathReaction_C
// Size: 0x618 (Inherited: 0xc0)
struct UAnimEvalSet_Medium_Damage_DeathReaction_C : UAnimationEvalSet {
	struct FGameplayEval_DamageAmount DamageAmountComparison; // 0xc0(0x98)
	struct FGameplayEval_DamageRange DamageAmountRange; // 0x158(0xc8)
	struct FGameplayEval_DamageType DamageType; // 0x220(0xc0)
	struct FGameplayEval_HitReactionBone DamageBone; // 0x2e0(0xb0)
	struct FGameplayEval_Distance DistanceToDamageSource; // 0x390(0xd0)
	struct FGameplayEval_Health AvatarHealth; // 0x460(0x58)
	struct FGameplayEval_GameplayTags AvatarTags; // 0x4b8(0x98)
	struct FGameplayEval_SpeedRange AvatarSpeed; // 0x550(0xc8)
};

