// BlueprintGeneratedClass AnimEvalSet_Shared_DeathReaction.AnimEvalSet_Shared_DeathReaction_C
// Size: 0x4a0 (Inherited: 0xc0)
struct UAnimEvalSet_Shared_DeathReaction_C : UAnimationEvalSet {
	struct FGameplayEval_Angle AvatarHitDirection; // 0xc0(0x60)
	struct FGameplayEval_DamageType DamageType; // 0x120(0xc0)
	struct FGameplayEval_DamageBone DamageBone; // 0x1e0(0x60)
	struct FGameplayEval_Distance DistanceToDamageSource; // 0x240(0xd0)
	struct FGameplayEval_Health AvatarHealth; // 0x310(0x58)
	struct FGameplayEval_RandomChance RandomChance; // 0x368(0x50)
	struct FGameplayEval_HasContext HasTarget; // 0x3b8(0x50)
	struct FGameplayEval_GameplayTags AvatarTags; // 0x408(0x98)
};

