// BlueprintGeneratedClass AnimEvalSet_Shared_DeathReaction_BoneArray.AnimEvalSet_Shared_DeathReaction_BoneArray_C
// Size: 0x4f0 (Inherited: 0xc0)
struct UAnimEvalSet_Shared_DeathReaction_BoneArray_C : UAnimationEvalSet {
	struct FGameplayEval_Angle AvatarHitDirection; // 0xc0(0x60)
	struct FGameplayEval_DamageType DamageType; // 0x120(0xc0)
	struct FGameplayEval_HitReactionBone DamageBone; // 0x1e0(0xb0)
	struct FGameplayEval_Distance DistanceToDamageSource; // 0x290(0xd0)
	struct FGameplayEval_Health AvatarHealth; // 0x360(0x58)
	struct FGameplayEval_RandomChance RandomChance; // 0x3b8(0x50)
	struct FGameplayEval_HasContext HasTarget; // 0x408(0x50)
	struct FGameplayEval_GameplayTags AvatarTags; // 0x458(0x98)
};

