// BlueprintGeneratedClass AnimEvalSet_Chaser_DodgeFilterSet.AnimEvalSet_Chaser_DodgeFilterSet_C
// Size: 0x488 (Inherited: 0xc0)
struct UAnimEvalSet_Chaser_DodgeFilterSet_C : UAnimationEvalSet {
	struct FGameplayEval_Distance Distance3D ToEnemy; // 0xc0(0xd0)
	struct FGameplayEval_Angle AngleToEnemy; // 0x190(0x60)
	struct FGameplayEval_LineOfSight LineOfSight; // 0x1f0(0x50)
	struct FGameplayEval_Angle AngleToAvatar; // 0x240(0x60)
	struct FGameplayEval_GameplayTags EnemyTags; // 0x2a0(0x98)
	struct FGameplayEval_GameplayTags AvatarTags; // 0x338(0x98)
	struct FGameplayEval_Speed AvatarSpeed; // 0x3d0(0x60)
	struct FGameplayEval_MovementMode MovementMode; // 0x430(0x58)
};

