// BlueprintGeneratedClass AnimEvalSet_Common_Melee_Overlap.AnimEvalSet_Common_Melee_Overlap_C
// Size: 0x478 (Inherited: 0xc0)
struct UAnimEvalSet_Common_Melee_Overlap_C : UAnimationEvalSet {
	struct FGameplayEval_OverlapActor OverlapTest; // 0xc0(0xd8)
	struct FAnimEval_MontageLastPlayed HasPlayedRecently; // 0x198(0x50)
	struct FGameplayEval_Dismembered CheckDismembered; // 0x1e8(0x58)
	struct FGameplayEval_Random RandomScore; // 0x240(0x48)
	struct FGameplayEval_RandomChanceByTag RandomChanceByTag; // 0x288(0xa8)
	struct FGameplayEval_HasVisibility HasVisibility; // 0x330(0x58)
	struct FGameplayEval_NavBlocked NavBlocked; // 0x388(0x58)
	struct FGameplayEval_GameplayTags GameplayTags; // 0x3e0(0x98)
};

