// BlueprintGeneratedClass AnimEvalSet_Shared_Melee.AnimEvalSet_Shared_Melee_C
// Size: 0x4f8 (Inherited: 0xc0)
struct UAnimEvalSet_Shared_Melee_C : UAnimationEvalSet {
	struct FGameplayEval_Distance DistanceToEnemy; // 0xc0(0xd0)
	struct FGameplayEval_Distance DistanceZToEnemy; // 0x190(0xd0)
	struct FGameplayEval_Angle AngleToEnemy; // 0x260(0x60)
	struct FAnimEval_MontageLastPlayed HasPlayedRecently; // 0x2c0(0x50)
	struct FGameplayEval_RandomChance RandomChance; // 0x310(0x50)
	struct FGameplayEval_Dismembered CheckDismembered; // 0x360(0x58)
	struct FGameplayEval_Speed EnemySpeed; // 0x3b8(0x60)
	struct FGameplayEval_Random RandomScore; // 0x418(0x48)
	struct FGameplayEval_GameplayTags AvatarTags; // 0x460(0x98)
};

