// BlueprintGeneratedClass BirdSite_BP.BirdSite_BP_C
// Size: 0x4f0 (Inherited: 0x480)
struct ABirdSite_BP_C : ABirdSite {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x480(0x08)
	struct UDecalComponent* Decal_Bird_Entrails_01; // 0x488(0x08)
	struct USceneComponent* DecalRoot; // 0x490(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM2; // 0x498(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM1; // 0x4a0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM; // 0x4a8(0x08)
	struct USceneComponent* GibsRoot; // 0x4b0(0x08)
	struct UGameCoachLessonsComponent* GameCoachLessons; // 0x4b8(0x08)
	struct UScareBirdsScenario_BP_C* ScareBirdsScenario_BP; // 0x4c0(0x08)
	struct UAlertComponent* Alert; // 0x4c8(0x08)
	struct USphereComponent* SphereTrigger; // 0x4d0(0x08)
	struct UBillboardComponent* Bird Site BB Icon; // 0x4d8(0x08)
	bool ShowGibs; // 0x4e0(0x01)
	char pad_4E1[0x3]; // 0x4e1(0x03)
	struct FVector ScaleGibs; // 0x4e4(0x0c)

	void UserConstructionScript(); // Function BirdSite_BP.BirdSite_BP_C.UserConstructionScript // (None) // @ game+0xfffffffec0000000
};

