// AnimBlueprintGeneratedClass Bloater_ABP.Bloater_ABP_C
// Size: 0x24f8 (Inherited: 0x7f0)
struct UBloater_ABP_C : UZombieAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x7f0(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x7f8(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x8b0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x970(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xa28(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0xae0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xb28(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xb70(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xc30(0xb8)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xce8(0x30)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xd18(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xd48(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd68(0x20)
	float __CustomProperty_LocoCounterYaw_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xd88(0x04)
	float __CustomProperty_AttackAimAlpha_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xd8c(0x04)
	float __CustomProperty_ClimbWallOffset_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xd90(0x04)
	float __CustomProperty_LocoSpeedsBlendTime_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xd94(0x04)
	float __CustomProperty_LocoBlendTime_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xd98(0x04)
	char pad_D9C[0x4]; // 0xd9c(0x04)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xda0(0x68)
	struct FAnimState3P __CustomProperty_AnimState3P_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xe08(0x08)
	struct FGobiAnimationState __CustomProperty_AnimationState_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xe10(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xe68(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xea8(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xec4(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xee0(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xefc(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xf18(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_FBF8CF7F49C4828B1DFFFB965511A8C2; // 0xf80(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1030(0xa8)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x10d8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1120(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x11d8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1200(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x12a0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1358(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1380(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x13a8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1470(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x14e8(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x15b0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1668(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1690(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x16b8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x16e0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1728(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1778(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x17a0(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x17c8(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x18b0(0xc8)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping; // 0x1978(0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x19e8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1ad0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1b00(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1b28(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1b58(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1c08(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1cc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1ce8(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1d10(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1dd8(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x1ec0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1f60(0xb8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2018(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x20b8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2158(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2180(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x21a8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2338(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x24c8(0x28)
	float AdditiveBlendWeight; // 0x24f0(0x04)
	float LocoBlendTime; // 0x24f4(0x04)

	void LocoLayer(struct FPoseLink LocoLayer); // Function Bloater_ABP.Bloater_ABP_C.LocoLayer // (None) // @ game+0xfffffffec0000000
};

