// BlueprintGeneratedClass Bloater_CharacterBP.Bloater_CharacterBP_C
// Size: 0x1368 (Inherited: 0x12ec)
struct ABloater_CharacterBP_C : AZombie_PlayerCharacterBP_C {
	char pad_12EC[0x4]; // 0x12ec(0x04)
	struct UBoxComponent* AimAssist_Torso; // 0x12f0(0x08)
	struct UPlayDeathReactionComponent* PlayDeathReaction; // 0x12f8(0x08)
	struct UGameCoachLessonsComponent* GameCoachLessons; // 0x1300(0x08)
	struct UHealthBarComponent* HealthBar; // 0x1308(0x08)
	struct UPlayHitReactionComponent* PlayHitReaction; // 0x1310(0x08)
	struct USphereComponent* LineOfSight; // 0x1318(0x08)
	struct URadiusHordeScenarioComponent* RadiusHordeScenario; // 0x1320(0x08)
	struct UStumbleOthersComponent* StumbleOthers; // 0x1328(0x08)
	struct UChargeComponent* Charge; // 0x1330(0x08)
	struct UMeleeComponent* Melee; // 0x1338(0x08)
	struct UCapsuleComponent* ChargeCollision; // 0x1340(0x08)
	struct UAnimAttackWindowComponent* AnimAttackWindow; // 0x1348(0x08)
	struct UWeakSpotsComponent* WeakSpots; // 0x1350(0x08)
	struct UMutilationComponent* Mutilation; // 0x1358(0x08)
	struct USphereComponent* MeleeCollision; // 0x1360(0x08)

	void UserConstructionScript(); // Function Bloater_CharacterBP.Bloater_CharacterBP_C.UserConstructionScript // (None) // @ game+0xfffffffec0000000
};

