// AnimBlueprintGeneratedClass Breaker_ABP.Breaker_ABP_C
// Size: 0x202c (Inherited: 0x7f0)
struct UBreaker_ABP_C : UZombieAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x7f0(0x08)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x7f8(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x840(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x900(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x948(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xa08(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xa30(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xa58(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xb10(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xbc8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xbf0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xc38(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xcf0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xda8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xdd0(0xb8)
	struct FAnimNode_FocusTrackingSlot AnimGraphNode_FocusTrackingSlot; // 0xe88(0x108)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xf90(0x30)
	struct FAnimNode_SlopeWarping AnimGraphNode_SlopeWarping; // 0xfc0(0x1a0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1160(0xf8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1258(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1278(0x20)
	float __CustomProperty_LocoCounterYaw_3015BF2641628FA10D0AA58BB054A9C5; // 0x1298(0x04)
	float __CustomProperty_AttackAimAlpha_3015BF2641628FA10D0AA58BB054A9C5; // 0x129c(0x04)
	float __CustomProperty_LocoSpeedsBlendTime_3015BF2641628FA10D0AA58BB054A9C5; // 0x12a0(0x04)
	float __CustomProperty_LocoBlendTime_3015BF2641628FA10D0AA58BB054A9C5; // 0x12a4(0x04)
	struct FGobiAnimationState __CustomProperty_AnimationState_3015BF2641628FA10D0AA58BB054A9C5; // 0x12a8(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_3015BF2641628FA10D0AA58BB054A9C5; // 0x1300(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_3015BF2641628FA10D0AA58BB054A9C5; // 0x1340(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_3015BF2641628FA10D0AA58BB054A9C5; // 0x135c(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_3015BF2641628FA10D0AA58BB054A9C5; // 0x1378(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_3015BF2641628FA10D0AA58BB054A9C5; // 0x1394(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_3015BF2641628FA10D0AA58BB054A9C5; // 0x13b0(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_3015BF2641628FA10D0AA58BB054A9C5; // 0x1418(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x14c8(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1570(0xa0)
	float __CustomProperty_LocoCounterYaw_8A29D815414B7F63CBAF179383D6C09C; // 0x1610(0x04)
	float __CustomProperty_AttackAimAlpha_8A29D815414B7F63CBAF179383D6C09C; // 0x1614(0x04)
	float __CustomProperty_LocoSpeedsBlendTime_8A29D815414B7F63CBAF179383D6C09C; // 0x1618(0x04)
	float __CustomProperty_LocoBlendTime_8A29D815414B7F63CBAF179383D6C09C; // 0x161c(0x04)
	struct FGobiAnimationState __CustomProperty_AnimationState_8A29D815414B7F63CBAF179383D6C09C; // 0x1620(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_8A29D815414B7F63CBAF179383D6C09C; // 0x1678(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_8A29D815414B7F63CBAF179383D6C09C; // 0x16b8(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_8A29D815414B7F63CBAF179383D6C09C; // 0x16d4(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_8A29D815414B7F63CBAF179383D6C09C; // 0x16f0(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_8A29D815414B7F63CBAF179383D6C09C; // 0x170c(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_8A29D815414B7F63CBAF179383D6C09C; // 0x1728(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_8A29D815414B7F63CBAF179383D6C09C; // 0x1790(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x1840(0xa8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18e8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x19a8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x19d0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1a18(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1ad0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1af8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1b20(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1bc0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1c78(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1ca0(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1cc8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1d68(0xb8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x1e20(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1fb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1fd8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2000(0x28)
	float AdditiveBlendWeight; // 0x2028(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Breaker_ABP.Breaker_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

