// AnimBlueprintGeneratedClass Brute_LocoBase_NEW_ABP.Brute_LocoBase_NEW_ABP_C
// Size: 0x92b4 (Inherited: 0x2c0)
struct UBrute_LocoBase_NEW_ABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x410(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x438(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_33; // 0x4e8(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_16; // 0x678(0x88)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_9; // 0x700(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_32; // 0x7a0(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_15; // 0x930(0x88)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_8; // 0x9b8(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_31; // 0xa58(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_14; // 0xbe8(0x88)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_7; // 0xc70(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_30; // 0xd10(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_13; // 0xea0(0x88)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0xf28(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0xfc8(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_29; // 0xff8(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_12; // 0x1188(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_28; // 0x1210(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_11; // 0x13a0(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_27; // 0x1428(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_10; // 0x15b8(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_26; // 0x1640(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_9; // 0x17d0(0x88)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x1858(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x18f8(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x1998(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x1a38(0xb0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x1ae8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1b88(0x30)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_36; // 0x1bb8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_35; // 0x1c28(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_34; // 0x1c98(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_33; // 0x1d08(0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x1d78(0xb0)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_32; // 0x1e28(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_31; // 0x1e98(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_30; // 0x1f08(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_29; // 0x1f78(0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x1fe8(0xb0)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_28; // 0x2098(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_27; // 0x2108(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_26; // 0x2178(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_25; // 0x21e8(0x70)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_4; // 0x2258(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x2320(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x2408(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x24f0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x25d8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x26c0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x27a8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x2890(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x2978(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x2a60(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x2b48(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x2c30(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x2d18(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x2e00(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x2eb0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x2ee0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2f08(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x2f30(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x2fa8(0x30)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_3; // 0x2fd8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x30a0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x3118(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x3190(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x3208(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x3280(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x32f8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x3370(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x33e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x3418(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x34c8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x34f8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x35a8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x35d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3600(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x3678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x36a0(0x28)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_24; // 0x36c8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_23; // 0x3738(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_22; // 0x37a8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_21; // 0x3818(0x70)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x3888(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_25; // 0x3938(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_8; // 0x3ac8(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_24; // 0x3b50(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_7; // 0x3ce0(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_23; // 0x3d68(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_6; // 0x3ef8(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_22; // 0x3f80(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_5; // 0x4110(0x88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x4198(0x30)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_20; // 0x41c8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_19; // 0x4238(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_18; // 0x42a8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_17; // 0x4318(0x70)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_21; // 0x4388(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_4; // 0x4518(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_20; // 0x45a0(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_3; // 0x4730(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_19; // 0x47b8(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_2; // 0x4948(0x88)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_18; // 0x49d0(0x190)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching; // 0x4b60(0x88)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x4be8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x4c98(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_17; // 0x4cc8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_16; // 0x4e58(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_15; // 0x4fe8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_14; // 0x5178(0x190)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_16; // 0x5308(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_15; // 0x5378(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_14; // 0x53e8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_13; // 0x5458(0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x54c8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x55b0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x5698(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x5780(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x5868(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_13; // 0x5918(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_12; // 0x5aa8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_11; // 0x5c38(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_10; // 0x5dc8(0x190)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_12; // 0x5f58(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_11; // 0x5fc8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_10; // 0x6038(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_9; // 0x60a8(0x70)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x6118(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x6200(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x62e8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x63d0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x64b8(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x6568(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x66f8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x6888(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x6a18(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x6ba8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x6d38(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x6ec8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x7058(0x190)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_8; // 0x71e8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_7; // 0x7258(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_6; // 0x72c8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_5; // 0x7338(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_4; // 0x73a8(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_3; // 0x7418(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_2; // 0x7488(0x70)
	struct FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping; // 0x74f8(0x70)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_2; // 0x7568(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x7630(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x7718(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x7800(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x78e8(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x79d0(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x7a80(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x7b68(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x7c50(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7d38(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7e20(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x7ed0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x7f00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x7f28(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x7f50(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x7fc8(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x7ff8(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x8188(0xa0)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag; // 0x8228(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x82f0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x8368(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x83e0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x8458(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x84d0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x8548(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x85c0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x8638(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x8668(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x8718(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x8748(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x87f8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x8828(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x88d8(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x8990(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x89b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x89e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x8a08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x8a30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x8a58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x8a80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8aa8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x8ad0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x8b48(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x8b78(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x8bf0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x8c20(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x8c98(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x8cc8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x8cf0(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x8d68(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x8e30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8e60(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x8ed8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8f08(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8f30(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8f60(0xb0)
	struct FLocoTurnInPlace TurnInPlaceState; // 0x9010(0xb0)
	struct FLocomotionPrediction LocoPredictState; // 0x90c0(0x68)
	struct FAnimDirectionRange ForwardDirection; // 0x9128(0x1c)
	struct FAnimDirectionRange RightDirection; // 0x9144(0x1c)
	struct FAnimDirectionRange LeftDirection; // 0x9160(0x1c)
	struct FAnimDirectionRange BackwardDirection; // 0x917c(0x1c)
	struct FAnimLocomotionData LocomotionData; // 0x9198(0x40)
	struct FGobiAnimationState AnimationState; // 0x91d8(0x58)
	struct FAnimState3P AnimState3P; // 0x9230(0x08)
	struct FLocomotionPrediction LocoPredict; // 0x9238(0x68)
	struct FLocoLeaning Leaning; // 0x92a0(0x0c)
	float LocoBlendTime; // 0x92ac(0x04)
	float LocoSpeedsBlendTime; // 0x92b0(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Brute_LocoBase_NEW_ABP.Brute_LocoBase_NEW_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

