// BlueprintGeneratedClass Brute_Spawn_Hole_BP.Brute_Spawn_Hole_BP_C
// Size: 0x509 (Inherited: 0x250)
struct ABrute_Spawn_Hole_BP_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct UStaticMeshComponent* Brute_Spawn_Hole_Collision_SM; // 0x258(0x08)
	struct USceneComponent* GeometryParent; // 0x260(0x08)
	struct USkeletalMeshComponent* SkeletalMesh; // 0x268(0x08)
	struct USceneComponent* SharedRoot; // 0x270(0x08)
	struct UStaticMeshComponent* Brute_Spawn_Hole_GroundNest_StaticMeshComponent0; // 0x278(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM6_StaticMeshComponent0; // 0x280(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM18_StaticMeshComponent0; // 0x288(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM14_StaticMeshComponent0; // 0x290(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM13_StaticMeshComponent0; // 0x298(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM3_StaticMeshComponent0; // 0x2a0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM16_StaticMeshComponent0; // 0x2a8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM9_StaticMeshComponent0; // 0x2b0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_04_Curve_08_SM_StaticMeshComponent0; // 0x2b8(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM7_StaticMeshComponent0; // 0x2c0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM17_StaticMeshComponent0; // 0x2c8(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM10_StaticMeshComponent0; // 0x2d0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM10_StaticMeshComponent0; // 0x2d8(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM13_StaticMeshComponent0; // 0x2e0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM2_StaticMeshComponent0; // 0x2e8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM10_StaticMeshComponent0; // 0x2f0(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM6_StaticMeshComponent0; // 0x2f8(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM10_StaticMeshComponent0; // 0x300(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM13_StaticMeshComponent0; // 0x308(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM11_StaticMeshComponent0; // 0x310(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM27_StaticMeshComponent0; // 0x318(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_04_Curve_08_SM2_StaticMeshComponent0; // 0x320(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_03_SM2_StaticMeshComponent0; // 0x328(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM3_StaticMeshComponent0; // 0x330(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM3_StaticMeshComponent0; // 0x338(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM9_StaticMeshComponent0; // 0x340(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM9_StaticMeshComponent0; // 0x348(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM25_StaticMeshComponent0; // 0x350(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_04_Curve_07_SM_StaticMeshComponent0; // 0x358(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM14_StaticMeshComponent0; // 0x360(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM6_StaticMeshComponent0; // 0x368(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM8_StaticMeshComponent0; // 0x370(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_03_SM6_StaticMeshComponent0; // 0x378(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM12_StaticMeshComponent0; // 0x380(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM8_StaticMeshComponent0; // 0x388(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM8_StaticMeshComponent0; // 0x390(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM11_StaticMeshComponent0; // 0x398(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_04_Curve_08_SM5_StaticMeshComponent0; // 0x3a0(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM12_StaticMeshComponent0; // 0x3a8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM8_StaticMeshComponent0; // 0x3b0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_03_SM3_StaticMeshComponent0; // 0x3b8(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM15_StaticMeshComponent0; // 0x3c0(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM8_StaticMeshComponent0; // 0x3c8(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM13_StaticMeshComponent0; // 0x3d0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM15_StaticMeshComponent0; // 0x3d8(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM4_StaticMeshComponent0; // 0x3e0(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM14_StaticMeshComponent0; // 0x3e8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM7_StaticMeshComponent0; // 0x3f0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_03_SM7_StaticMeshComponent0; // 0x3f8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM4_StaticMeshComponent0; // 0x400(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM20_StaticMeshComponent0; // 0x408(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM23_StaticMeshComponent0; // 0x410(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM15_StaticMeshComponent0; // 0x418(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM5_StaticMeshComponent0; // 0x420(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM7_StaticMeshComponent0; // 0x428(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM7_StaticMeshComponent0; // 0x430(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_03_SM5_StaticMeshComponent0; // 0x438(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM13_StaticMeshComponent0; // 0x440(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM_StaticMeshComponent0; // 0x448(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM11_StaticMeshComponent0; // 0x450(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM_StaticMeshComponent0; // 0x458(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM2_StaticMeshComponent0; // 0x460(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_03_SM4_StaticMeshComponent0; // 0x468(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM6_StaticMeshComponent0; // 0x470(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM2_StaticMeshComponent0; // 0x478(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM2_StaticMeshComponent0; // 0x480(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM2_StaticMeshComponent0; // 0x488(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM5_StaticMeshComponent0; // 0x490(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM5_StaticMeshComponent0; // 0x498(0x08)
	struct UStaticMeshComponent* SC_Wall_Street_DirtPile_A_SM9_StaticMeshComponent0; // 0x4a0(0x08)
	struct UStaticMeshComponent* Dirt_Mound_Tendril_Dive_01_SM12_StaticMeshComponent0; // 0x4a8(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM19_StaticMeshComponent0; // 0x4b0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM4_StaticMeshComponent0; // 0x4b8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_04_Curve_08_SM4_StaticMeshComponent0; // 0x4c0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_05_Curve_02_SM7_StaticMeshComponent0; // 0x4c8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM6_StaticMeshComponent0; // 0x4d0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_04_Curve_08_SM6_StaticMeshComponent0; // 0x4d8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_02_SM4_StaticMeshComponent0; // 0x4e0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM12_StaticMeshComponent0; // 0x4e8(0x08)
	struct UStaticMeshComponent* Rock_Pile_A_SM17_StaticMeshComponent0; // 0x4f0(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_04_Curve_08_SM3_StaticMeshComponent0; // 0x4f8(0x08)
	struct UStaticMeshComponent* Nest_Piles_SML_01_SM11_StaticMeshComponent0; // 0x500(0x08)
	bool AttachGeoToBone; // 0x508(0x01)

	void OnRep_AttachGeoToBone(); // Function Brute_Spawn_Hole_BP.Brute_Spawn_Hole_BP_C.OnRep_AttachGeoToBone // (None) // @ game+0xfffffffec0000000
};

