// AnimBlueprintGeneratedClass Brute_ABP.Brute_ABP_C
// Size: 0x2ee4 (Inherited: 0x800)
struct UBrute_ABP_C : UBruteAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x800(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x808(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x8c0(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x978(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0xa38(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xa80(0xb8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xb38(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xb58(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xb78(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xc80(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xd88(0x108)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0xe90(0xf8)
	char pad_F88[0x8]; // 0xf88(0x08)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0xf90(0x590)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1520(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x15d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1600(0x28)
	struct FAnimNode_BlendListByGameplayTagQuery AnimGraphNode_BlendListByGameplayTagQuery; // 0x1628(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x16f0(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x1720(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1768(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1820(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x18e0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1928(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x19e0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1a08(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1aa8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1b60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1b88(0x28)
	struct FAnimNode_SlopeWarping AnimGraphNode_SlopeWarping; // 0x1bb0(0x1a0)
	float __CustomProperty_LocoSpeedsBlendTime_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1d50(0x04)
	float __CustomProperty_LocoBlendTime_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1d54(0x04)
	struct FLocoLeaning __CustomProperty_Leaning_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1d58(0x0c)
	char pad_1D64[0x4]; // 0x1d64(0x04)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1d68(0x68)
	struct FAnimState3P __CustomProperty_AnimState3P_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1dd0(0x08)
	struct FGobiAnimationState __CustomProperty_AnimationState_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1dd8(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1e30(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1e70(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1e8c(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1ea8(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1ec4(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1ee0(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_8BFBF7394485FABCFE97FF9A1B3A4212; // 0x1f48(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1ff8(0xa8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x20a0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x20e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2110(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2138(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2160(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2188(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x21b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x21d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x2200(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x2228(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x22e8(0x78)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x2360(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x23a8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x23d8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2400(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x24c0(0x78)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x2538(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2580(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x25b0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x25d8(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2698(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x26e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2758(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x2788(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x27b0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x27e0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2890(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x2948(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2970(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2998(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2a60(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2b48(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2be8(0xb8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2ca0(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2e30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2e58(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2e80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2ea8(0x28)
	float AdditiveBlendWeight; // 0x2ed0(0x04)
	float LocoBlendTime; // 0x2ed4(0x04)
	float UpperBodyBlendWeight; // 0x2ed8(0x04)
	float CollideForwardAngle; // 0x2edc(0x04)
	float CollideStart; // 0x2ee0(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Brute_ABP.Brute_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

