// WidgetBlueprintGeneratedClass CardInsert_WBP.CardInsert_WBP_C
// Size: 0x639 (Inherited: 0x4f0)
struct UCardInsert_WBP_C : UCardInsertUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4f0(0x08)
	struct UWidgetAnimation* rollover; // 0x4f8(0x08)
	struct UImage* Affinity_Corner; // 0x500(0x08)
	struct UCardAffinityBanner_WBP_C* AffinityBanner; // 0x508(0x08)
	struct UImage* CardImage; // 0x510(0x08)
	struct UOverlay* Content; // 0x518(0x08)
	struct UImage* DescriptionBackground; // 0x520(0x08)
	struct UImage* DescriptionBackground_2; // 0x528(0x08)
	struct UCanvasPanel* DescriptionContainer; // 0x530(0x08)
	struct UImage* Frame; // 0x538(0x08)
	struct UImage* FrameSmallLight; // 0x540(0x08)
	struct UImage* LockIcon; // 0x548(0x08)
	struct UCanvasPanel* parentContainer; // 0x550(0x08)
	struct URichTextBlock* SharedHeaderText; // 0x558(0x08)
	struct UOverlay* SharedTextContainer; // 0x560(0x08)
	struct UImage* TalentIcon; // 0x568(0x08)
	struct UMaterialInstanceDynamic* MIDCardBack; // 0x570(0x08)
	struct UMaterialInstanceDynamic* MIDCardHighlight; // 0x578(0x08)
	struct UMaterialInstanceDynamic* MIDCardImage; // 0x580(0x08)
	struct FText cardTitle; // 0x588(0x18)
	struct FText Description; // 0x5a0(0x18)
	bool isShared; // 0x5b8(0x01)
	bool showTalentIcon; // 0x5b9(0x01)
	char pad_5BA[0x2]; // 0x5ba(0x02)
	struct FLinearColor primaryAffinityColor; // 0x5bc(0x10)
	struct FLinearColor HighlightColor; // 0x5cc(0x10)
	char pad_5DC[0x4]; // 0x5dc(0x04)
	struct UTexture2D* gradientMap; // 0x5e0(0x08)
	struct UMaterialInstanceDynamic* MIDTalentIcon; // 0x5e8(0x08)
	struct UMaterialInterface* cardImgMaterialInterface; // 0x5f0(0x08)
	struct UTweenContainer* TweenFocusContainer; // 0x5f8(0x08)
	struct FName CardForegroundMaterialName; // 0x600(0x08)
	struct FName CardBGMaterialName; // 0x608(0x08)
	struct FName CardHighlightMaterialName; // 0x610(0x08)
	enum class EGameplayCardCategory Category; // 0x618(0x01)
	enum class EGameplayCardAffinity Affinity; // 0x619(0x01)
	char pad_61A[0x2]; // 0x61a(0x02)
	float DefaultCardTint; // 0x61c(0x04)
	struct UTweenContainer* TweenFocusLostContainer; // 0x620(0x08)
	struct UTweenContainer* TweenEquippedContainer; // 0x628(0x08)
	struct UTweenContainer* TweenUnequippedContainer; // 0x630(0x08)
	bool Equipped; // 0x638(0x01)

	void SetLocked(bool bIsLocked); // Function CardInsert_WBP.CardInsert_WBP_C.SetLocked // (None) // @ game+0xfffffffec0000000
};

