// AnimBlueprintGeneratedClass CardShrine_ABP.CardShrine_ABP_C
// Size: 0x12b5 (Inherited: 0x2c0)
struct UCardShrine_ABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x320(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x348(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x3f0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x468(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x498(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x548(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x5c0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x638(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x6b0(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x778(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x840(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x908(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x9d0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xa48(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xac0(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xb88(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xc50(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xcc8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xd40(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xdb8(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xe80(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xf48(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1000(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1028(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x10c8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1180(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x11a8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x11d0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1288(0x28)
	int32_t CardTakenCount; // 0x12b0(0x04)
	bool bOpen; // 0x12b4(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function CardShrine_ABP.CardShrine_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

