// BlueprintGeneratedClass CharacterSelect_BP.CharacterSelect_BP_C
// Size: 0x290 (Inherited: 0x250)
struct ACharacterSelect_BP_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct UStaticMeshComponent* HighlightCube; // 0x258(0x08)
	struct UUsableHighlightComponent* UsableHighlight; // 0x260(0x08)
	struct UItemAkBankComponent* ItemAkBank; // 0x268(0x08)
	struct UTextRenderComponent* TextRender; // 0x270(0x08)
	struct UOpenScreenUsableComponent* OpenScreenUsable; // 0x278(0x08)
	struct UBoxComponent* Box; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)

	void Audio_Interact_Cot(struct AActor* UsingActor); // Function CharacterSelect_BP.CharacterSelect_BP_C.Audio_Interact_Cot // (None) // @ game+0xfffffffec0000000
};

