// BlueprintGeneratedClass Chucker_Pin_Attached_BP.Chucker_Pin_Attached_BP_C
// Size: 0x390 (Inherited: 0x338)
struct AChucker_Pin_Attached_BP_C : AProjectilePin {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x338(0x08)
	struct UParticleSystemComponent* VFX_Chucker_Projectile_Impact_HumanRoot_PS; // 0x340(0x08)
	struct UCapsuleComponent* DamageVolume; // 0x348(0x08)
	struct UCapsuleComponent* Root; // 0x350(0x08)
	struct USphereComponent* Sphere; // 0x358(0x08)
	struct UAlertComponent* Alert; // 0x360(0x08)
	struct UThreatComponent* Threat; // 0x368(0x08)
	struct UGameplayEffectsComponent* GameplayEffects; // 0x370(0x08)
	struct UGameplayTagsComponent* GameplayTags; // 0x378(0x08)
	struct UHealthComponent* Health; // 0x380(0x08)
	struct UParticleSystemComponent* ParticleEffect; // 0x388(0x08)

	void ReceiveBeginPlay(); // Function Chucker_Pin_Attached_BP.Chucker_Pin_Attached_BP_C.ReceiveBeginPlay // (None) // @ game+0xfffffffec0000000
};

