// AnimBlueprintGeneratedClass Common_Zombie_ABP.Common_Zombie_ABP_C
// Size: 0x1d50 (Inherited: 0x7f0)
struct UCommon_Zombie_ABP_C : UZombieAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x7f0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x7f8(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x828(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x8e0(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x9a0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x9e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xa10(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xa38(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xa80(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xb38(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xb80(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xba8(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xc60(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xd20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xd48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xd70(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xd98(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xe38(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xef0(0x28)
	struct FAnimNode_CurveSource AnimGraphNode_CurveSource; // 0xf18(0x40)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0xf58(0x98)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xff0(0xa0)
	float __CustomProperty_LocoCounterYaw_838DA19C4320A3A8999F0D8735A716A4; // 0x1090(0x04)
	float __CustomProperty_AttackAimAlpha_838DA19C4320A3A8999F0D8735A716A4; // 0x1094(0x04)
	float __CustomProperty_LocoSpeedsBlendTime_838DA19C4320A3A8999F0D8735A716A4; // 0x1098(0x04)
	float __CustomProperty_LocoBlendTime_838DA19C4320A3A8999F0D8735A716A4; // 0x109c(0x04)
	struct FLocoLeaning __CustomProperty_Leaning_838DA19C4320A3A8999F0D8735A716A4; // 0x10a0(0x0c)
	char pad_10AC[0x4]; // 0x10ac(0x04)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_838DA19C4320A3A8999F0D8735A716A4; // 0x10b0(0x68)
	struct FAnimState3P __CustomProperty_AnimState3P_838DA19C4320A3A8999F0D8735A716A4; // 0x1118(0x08)
	struct FGobiAnimationState __CustomProperty_AnimationState_838DA19C4320A3A8999F0D8735A716A4; // 0x1120(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_838DA19C4320A3A8999F0D8735A716A4; // 0x1178(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_838DA19C4320A3A8999F0D8735A716A4; // 0x11b8(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_838DA19C4320A3A8999F0D8735A716A4; // 0x11d4(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_838DA19C4320A3A8999F0D8735A716A4; // 0x11f0(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_838DA19C4320A3A8999F0D8735A716A4; // 0x120c(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_838DA19C4320A3A8999F0D8735A716A4; // 0x1228(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_838DA19C4320A3A8999F0D8735A716A4; // 0x1290(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_2; // 0x1340(0xa8)
	float __CustomProperty_LocoCounterYaw_595F317948A60B33D1850393E04CDD36; // 0x13e8(0x04)
	float __CustomProperty_AttackAimAlpha_595F317948A60B33D1850393E04CDD36; // 0x13ec(0x04)
	float __CustomProperty_LocoSpeedsBlendTime_595F317948A60B33D1850393E04CDD36; // 0x13f0(0x04)
	float __CustomProperty_LocoBlendTime_595F317948A60B33D1850393E04CDD36; // 0x13f4(0x04)
	struct FLocoLeaning __CustomProperty_Leaning_595F317948A60B33D1850393E04CDD36; // 0x13f8(0x0c)
	char pad_1404[0x4]; // 0x1404(0x04)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_595F317948A60B33D1850393E04CDD36; // 0x1408(0x68)
	struct FAnimState3P __CustomProperty_AnimState3P_595F317948A60B33D1850393E04CDD36; // 0x1470(0x08)
	struct FGobiAnimationState __CustomProperty_AnimationState_595F317948A60B33D1850393E04CDD36; // 0x1478(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_595F317948A60B33D1850393E04CDD36; // 0x14d0(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_595F317948A60B33D1850393E04CDD36; // 0x1510(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_595F317948A60B33D1850393E04CDD36; // 0x152c(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_595F317948A60B33D1850393E04CDD36; // 0x1548(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_595F317948A60B33D1850393E04CDD36; // 0x1564(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_595F317948A60B33D1850393E04CDD36; // 0x1580(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_595F317948A60B33D1850393E04CDD36; // 0x15e8(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1698(0xa8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1740(0xb8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x17f8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x18c0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x18e8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1930(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x19e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1a10(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x1a38(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1ad8(0xb8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x1b90(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1d20(0x28)
	float AdditiveBlendWeight; // 0x1d48(0x04)
	float UpperBodyBlendWeight; // 0x1d4c(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Common_Zombie_ABP.Common_Zombie_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

