// UserDefinedStruct Common_Tuning_Struct.Common_Tuning_Struct
// Size: 0x188 (Inherited: 0x00)
struct FCommon_Tuning_Struct {
	struct FHealthTuning Health_40_326D8D904132E1C79DE260BC9F31E291; // 0x00(0x148)
	struct FWeakSpotsTuning WeakSpots_37_8BA8D85A4EF0704D61CB2F96D4B2FE20; // 0x148(0x28)
	float DeathReactionDamage_Light_44_9EF196CF42B207B0117D88A0CCD1D243; // 0x170(0x04)
	float DeathReactionDamage_Heavy_47_451986E7450062AA0D4132AE7E6EECC7; // 0x174(0x04)
	float Melee_MaxDistOffset_20_4088219F44AE5359C89A3CA00B5E0760; // 0x178(0x04)
	float MeleeRadiusCheck_27_0E50589841F959FF1816F596EAEA95AB; // 0x17c(0x04)
	float MeleeRadiusCheck_Ground_26_C00C3C5E4B31915BB28915AD3E1C3172; // 0x180(0x04)
	float MeleeRadiusCheck_High_29_B9533B1547EFEA6EC5D481A5D0354647; // 0x184(0x04)
};

