// BlueprintGeneratedClass Door_StaticMesh_Base_BP.Door_StaticMesh_Base_BP_C
// Size: 0x5d0 (Inherited: 0x560)
struct ADoor_StaticMesh_Base_BP_C : ADoor_AbstractBase_BP_C {
	struct UStaticMeshComponent* HighlightMesh; // 0x560(0x08)
	struct UHealthBarComponent* HealthBar; // 0x568(0x08)
	struct UGameplayTagsComponent* GameplayTags; // 0x570(0x08)
	struct UPoseableMeshComponent* BreakablePoseableMesh; // 0x578(0x08)
	struct UDoorAlarmGameCoachLessonComponent* DoorAlarmGameCoachLesson; // 0x580(0x08)
	struct USceneComponent* GameCoachWaypointPosition; // 0x588(0x08)
	struct UStaticMeshComponent* AlarmBack; // 0x590(0x08)
	struct UStaticMeshComponent* AlarmFront; // 0x598(0x08)
	struct UBreakableComponent* Breakable; // 0x5a0(0x08)
	struct UAudioDestructibleComponent_BP_C* AudioDestructibleComponent_BP; // 0x5a8(0x08)
	struct UGameplayEffectsComponent* GameplayEffects; // 0x5b0(0x08)
	struct UBoxComponent* Damage_Volume; // 0x5b8(0x08)
	struct UHealthComponent* Health; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x5c8(0x08)
};

