// BlueprintGeneratedClass EvalSet_Shared_Mutilation_HitReaction.EvalSet_Shared_Mutilation_HitReaction_C
// Size: 0x4f0 (Inherited: 0xc0)
struct UEvalSet_Shared_Mutilation_HitReaction_C : UAnimationEvalSet {
	struct FGameplayEval_Dismembered Dismembered; // 0xc0(0x58)
	struct FGameplayEval_HitReactionBone HitBone; // 0x118(0xb0)
	struct FGameplayEval_DamageType DamageType; // 0x1c8(0xc0)
	struct FGameplayEval_DamageAmount DamageAmount; // 0x288(0x98)
	struct FGameplayEval_HitReactionHealth HitReactionHealth; // 0x320(0x58)
	struct FGameplayEval_CanRupture CanRupture; // 0x378(0x50)
	struct FGameplayEval_HitReactionWeakSpot HitReactionWeakspot; // 0x3c8(0x60)
	struct FGameplayEval_DamageRange DamageRange; // 0x428(0xc8)
};

