// AnimBlueprintGeneratedClass FP_HeroAdd_Base_ABP.FP_HeroAdd_Base_ABP_C
// Size: 0x3bb4 (Inherited: 0x2c0)
struct UFP_HeroAdd_Base_ABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x2f8(0x78)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x4b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x4d8(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_19; // 0x500(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x5c8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x640(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x670(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x698(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x6c8(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_18; // 0x6f0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x7b8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x830(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17; // 0x860(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x928(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x950(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x9c8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x9f8(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16; // 0xa20(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xae8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0xb60(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0xb90(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0xc40(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0xdd0(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0xf60(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x10f0(0x190)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x1280(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x12a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x12d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x12f8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1320(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1350(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1378(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15; // 0x13f0(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x14b8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x14e8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x1510(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14; // 0x1588(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x1650(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x1680(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1730(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1760(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13; // 0x17d8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x18a0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x18c8(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12; // 0x1940(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1a08(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x1a38(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x1ae8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x1b10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1b38(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1b60(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1b90(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1bb8(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11; // 0x1c30(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1cf8(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x1d70(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1e38(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x1e68(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1f18(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1fd0(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2088(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x20b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x20d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x2100(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x2128(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2150(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x2178(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x21a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x21d0(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0x2248(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x2310(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x2338(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2368(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x23e0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x24a8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x24d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2500(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x2578(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x2640(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x2668(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x2698(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2748(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2770(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2798(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x27c8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2890(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2908(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2980(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x29b0(0xb0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x2a60(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x2b28(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x2be0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x2c08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2c30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2c58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2c80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2ca8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x2cd0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2cf8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2d28(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x2d50(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2e18(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2e90(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2ec0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x2ee8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2fb0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3028(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x3058(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x3080(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x30b0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3160(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x31d8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x32a0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3368(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x33e0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x3498(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3550(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3608(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3630(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x3658(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3720(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3798(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x3810(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3838(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3900(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3930(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3958(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3988(0xb0)
	struct FWeaponAnimState WeaponAnimState; // 0x3a38(0x44)
	struct FGobiAnimationState GobiAnimationState; // 0x3a7c(0x58)
	struct FFirstPersonAdditiveState AdditiveState; // 0x3ad4(0x70)
	char pad_3B44[0x4]; // 0x3b44(0x04)
	struct FWeaponAnimsFP FirstPersonAnimations; // 0x3b48(0x40)
	struct FHeroAnimStateFP HeroAnimState; // 0x3b88(0x2c)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink AnimGraph); // Function FP_HeroAdd_Base_ABP.FP_HeroAdd_Base_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

