// AnimBlueprintGeneratedClass FP_HeroLoco_Base_ABP.FP_HeroLoco_Base_ABP_C
// Size: 0xeec (Inherited: 0x2c0)
struct UFP_HeroLoco_Base_ABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x398(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x3c0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x438(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x468(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x4e0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x510(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x538(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x560(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x588(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x5b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x5d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x600(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x678(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x6a0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x718(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x748(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x7f0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x868(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x898(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x910(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x940(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x968(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x9e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa10(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa88(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xab8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb98(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc10(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xc40(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xcf0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xd20(0xb0)
	struct FWeaponAnimState WeaponAnimState; // 0xdd0(0x44)
	struct FHeroAnimStateFP HeroAnimState; // 0xe14(0x2c)
	struct FWeaponAnimsFP FirstPersonAnimations; // 0xe40(0x40)
	float MinWalkStartSpeed; // 0xe80(0x04)
	struct FGobiAnimationState GobiAnimState; // 0xe84(0x58)
	struct FLadderAnimStateFP LadderState; // 0xedc(0x10)

	void AnimGraph(struct FPoseLink AnimGraph); // Function FP_HeroLoco_Base_ABP.FP_HeroLoco_Base_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

