// AnimBlueprintGeneratedClass FP_Hero_ABP.FP_Hero_ABP_C
// Size: 0x1880 (Inherited: 0x620)
struct UFP_Hero_ABP_C : UHeroAnimInstanceFP {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x620(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x628(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x658(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x710(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x758(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x780(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x838(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x860(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x918(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x9d8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xa20(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xa48(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xb08(0x28)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0xb30(0xf0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xc20(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xc40(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xc68(0x48)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xcb0(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xd78(0x108)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0xe80(0xf0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xf70(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1078(0x108)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1180(0xf0)
	struct FLadderAnimStateFP __CustomProperty_LadderState_0F3C9E314B0681E014F6469FACBD79E6; // 0x1270(0x10)
	struct FGobiAnimationState __CustomProperty_GobiAnimState_0F3C9E314B0681E014F6469FACBD79E6; // 0x1280(0x58)
	struct FWeaponAnimsFP __CustomProperty_FirstPersonAnimations_0F3C9E314B0681E014F6469FACBD79E6; // 0x12d8(0x40)
	struct FHeroAnimStateFP __CustomProperty_HeroAnimState_0F3C9E314B0681E014F6469FACBD79E6; // 0x1318(0x2c)
	struct FWeaponAnimState __CustomProperty_WeaponAnimState_0F3C9E314B0681E014F6469FACBD79E6; // 0x1344(0x44)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_2; // 0x1388(0xa8)
	struct FHeroAnimStateFP __CustomProperty_HeroAnimState_1B081B93442EDF417CAAFAA777A2C1DE; // 0x1430(0x2c)
	char pad_145C[0x4]; // 0x145c(0x04)
	struct FWeaponAnimsFP __CustomProperty_FirstPersonAnimations_1B081B93442EDF417CAAFAA777A2C1DE; // 0x1460(0x40)
	struct FFirstPersonAdditiveState __CustomProperty_AdditiveState_1B081B93442EDF417CAAFAA777A2C1DE; // 0x14a0(0x70)
	struct FGobiAnimationState __CustomProperty_GobiAnimationState_1B081B93442EDF417CAAFAA777A2C1DE; // 0x1510(0x58)
	struct FWeaponAnimState __CustomProperty_WeaponAnimState_1B081B93442EDF417CAAFAA777A2C1DE; // 0x1568(0x44)
	char pad_15AC[0x4]; // 0x15ac(0x04)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x15b0(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1658(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1680(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1748(0x28)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1770(0xa8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1818(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1838(0x48)

	void AnimGraph(struct FPoseLink AnimGraph); // Function FP_Hero_ABP.FP_Hero_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

