// WidgetBlueprintGeneratedClass FTUETutorialScreen_WBP.FTUETutorialScreen_WBP_C
// Size: 0x640 (Inherited: 0x5d8)
struct UFTUETutorialScreen_WBP_C : UFTUETutorialScreen {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5d8(0x08)
	struct UImage* BG; // 0x5e0(0x08)
	struct UPlatformCallouts_WBP_C* Callouts; // 0x5e8(0x08)
	struct UFooter_WBP_C* Footer_WBP; // 0x5f0(0x08)
	struct UTextButton_WBP_C* FriendsCancelButton; // 0x5f8(0x08)
	struct UOverlay* FriendsPanel; // 0x600(0x08)
	struct UTextButton_WBP_C* FriendsStartButton; // 0x608(0x08)
	struct UPartyGroupsTab_WBP_C* PartyGroupsTab; // 0x610(0x08)
	struct UTextButton_WBP_C* PlayFriendsButton; // 0x618(0x08)
	struct UTextButton_WBP_C* PlaySoloButton; // 0x620(0x08)
	struct UTextButton_WBP_C* SkipButton; // 0x628(0x08)
	struct UTextButton_WBP_C* SoloCancelButton; // 0x630(0x08)
	struct UWidgetSwitcher* Switcher; // 0x638(0x08)

	void InitCallouts(); // Function FTUETutorialScreen_WBP.FTUETutorialScreen_WBP_C.InitCallouts // (None) // @ game+0xfffffffec0000000
};

