// BlueprintGeneratedClass GameplayEvalSet_Shared_Melee_Filter.GameplayEvalSet_Shared_Melee_Filter_C
// Size: 0x568 (Inherited: 0xc0)
struct UGameplayEvalSet_Shared_Melee_Filter_C : UAnimationEvalSet {
	struct FGameplayEval_Distance DistanceToEnemy; // 0xc0(0xd0)
	struct FGameplayEval_Distance DistanceZToEnemy; // 0x190(0xd0)
	struct FGameplayEval_Angle AngleToEnemy; // 0x260(0x60)
	struct FGameplayEval_NavBlocked NavBlocked; // 0x2c0(0x58)
	struct FGameplayEval_GameplayTags AvatarTags; // 0x318(0x98)
	struct FGameplayEval_GameplayTags EnemyTags; // 0x3b0(0x98)
	struct FGameplayEval_Speed EnemySpeed; // 0x448(0x60)
	struct FGameplayEval_BlockedByPawn BlockedByPawn; // 0x4a8(0x68)
	struct FGameplayEval_HasVisibility VisibilityToEnemy; // 0x510(0x58)
};

