// WidgetBlueprintGeneratedClass GameHUDScreen_WBP.GameHUDScreen_WBP_C
// Size: 0x880 (Inherited: 0x6d8)
struct UGameHUDScreen_WBP_C : UHUDScreen {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6d8(0x08)
	struct UBossHealthBar_WBP_C* BossHealthBar_WBP; // 0x6e0(0x08)
	struct UCenterNotification_WBP_C* CenterNotification; // 0x6e8(0x08)
	struct UChallengeHUD_WBP_C* ChallengeHUD; // 0x6f0(0x08)
	struct UCommWheel_WBP_C* CommWheel; // 0x6f8(0x08)
	struct UCrosshairContainer_WBP_C* CrosshairContainer; // 0x700(0x08)
	struct UHUDEquipmentPanel_WBP_C* EquipmentPanel; // 0x708(0x08)
	struct UFortificationNotification_WBP_C* FortificationNotification; // 0x710(0x08)
	struct UGhostModeIndicator2_WBP_C* GhostModeIndicator2; // 0x718(0x08)
	struct UGobiSafeZone* GobiSafeZone_78; // 0x720(0x08)
	struct UHeroSuicide_WBP_C* HeroSuicide_WBP; // 0x728(0x08)
	struct UHUDHintText_WBP_C* HintText; // 0x730(0x08)
	struct UHUDMissions_WBP_C* HUDMissions_WBP; // 0x738(0x08)
	struct UHUDMissionTips_WBP_C* HUDMissionTips_WBP; // 0x740(0x08)
	struct UInvalidationBox* InvalidationWrapper; // 0x748(0x08)
	struct UKillFeed_WBP_C* KillFeed; // 0x750(0x08)
	struct UNameplateManager_WBP_C* NameplateManager; // 0x758(0x08)
	struct UPartyStatus_WBP_C* PartyStatus; // 0x760(0x08)
	struct UPlayerAssisting_WBP_C* PlayerAssisting; // 0x768(0x08)
	struct UPlayerModule_WBP_C* PlayerModule; // 0x770(0x08)
	struct UPlayerMoney_WBP_C* PlayerMoney; // 0x778(0x08)
	struct UOverlay* PreRoundTimerPanel; // 0x780(0x08)
	struct UPvPEventsFeed_WBP_C* PvPEventsFeed_WBP; // 0x788(0x08)
	struct UPvPHoldoutState_WBP_C* PvPHoldoutState_WBP; // 0x790(0x08)
	struct URadioSpeaker_WBP_C* RadioSpeaker; // 0x798(0x08)
	struct UCanvasPanel* RootPanel; // 0x7a0(0x08)
	struct USafeRoomSummary_WBP_C* SafeRoomSummary; // 0x7a8(0x08)
	struct USpectate_MatchStartBlocker_BG_C* Spectate_MatchStartBlocker; // 0x7b0(0x08)
	struct USpectateSwitcher_WBP_C* SpectateSwitcher; // 0x7b8(0x08)
	struct USplitscreenPrompt_WBP_C* SplitscreenPrompt; // 0x7c0(0x08)
	struct UHUDStaminaBar_WBP_C* StaminaBar; // 0x7c8(0x08)
	struct UTakeOverBotPrompt_WBP_C* TakeOverBotPrompt; // 0x7d0(0x08)
	struct UTempPerks_WBP_C* TempPerks; // 0x7d8(0x08)
	struct UUndeadAbilities_WBP_C* UndeadAbilities; // 0x7e0(0x08)
	struct ULocalUseProgress_WBP_C* UseProgress; // 0x7e8(0x08)
	struct UUsePrompts_WBP_C* UsePrompts; // 0x7f0(0x08)
	struct UZombieCancelChannelHint_WBP_C* ZombieCancelChannelHint_WBP; // 0x7f8(0x08)
	struct UZombieOutOfRange_WBP_C* ZombieOutOfRange; // 0x800(0x08)
	struct UZombieRespawnPrompt_WBP_C* ZombieRespawnPrompt; // 0x808(0x08)
	struct UHealthComponent* Health; // 0x810(0x08)
	struct TMap<struct FGameplayTag, struct UTexture2D*> TagsToIcons; // 0x818(0x50)
	struct TArray<struct UWidget*> DamageNumbers; // 0x868(0x10)
	struct AZombieCharacter* TargetZombie; // 0x878(0x08)

	void HandleCountingMoneyAudio(enum class ESlateVisibility NewVisibility); // Function GameHUDScreen_WBP.GameHUDScreen_WBP_C.HandleCountingMoneyAudio // (None) // @ game+0xfffffffec0000000
};

