// BlueprintGeneratedClass GenConditionBase.GenConditionBase_C
// Size: 0x500 (Inherited: 0x78)
struct UGenConditionBase_C : UAISpawnConditionEvaluatorSet {
	struct FAISpawnEval_PacingPhase Phase; // 0x78(0x48)
	struct FAISpawnEval_Chance ChanceToPlay; // 0xc0(0x58)
	struct FAISpawnEval_CheckGeneratingDeckTags Check Deck; // 0x118(0x90)
	struct FAISpawnEval_CheckCardTags Check Card; // 0x1a8(0x90)
	struct FAISpawnEval_CheckCharacterTags Check Character; // 0x238(0x90)
	struct FAISpawnEval_CheckCharacterTags Check Character_3; // 0x2c8(0x90)
	struct FAISpawnEval_Difficulty Check_Difficulty; // 0x358(0x48)
	struct FAISpawnEval_GrowingChanceByDifficulty ChanceGrowingByDifficulty; // 0x3a0(0x58)
	struct FAISpawnEval_GrowingChance Check_GrowingChance; // 0x3f8(0x58)
	struct FAISpawnEval_Cooldown Cooldown; // 0x450(0x58)
	struct FAISpawnEval_Cooldown Cooldown_3; // 0x4a8(0x58)
};

