// WidgetBlueprintGeneratedClass GhostModeIndicator2_WBP.GhostModeIndicator2_WBP_C
// Size: 0x534 (Inherited: 0x458)
struct UGhostModeIndicator2_WBP_C : UGhostModeIndicatorUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x458(0x08)
	struct UBackgroundBlur_WBP_C* BackgroundBlur_WBP; // 0x460(0x08)
	struct UImage* BG_footer_Placeholder; // 0x468(0x08)
	struct UImage* BG_Respawn; // 0x470(0x08)
	struct UImage* CanSpawnBG; // 0x478(0x08)
	struct UImage* CanSpawnBGPulse; // 0x480(0x08)
	struct UOverlay* CanSpawnContainer; // 0x488(0x08)
	struct UGhostModeIndicator_SpawnPicker_WBP_C* GhostModeIndicator_SpawnPicker_WBP; // 0x490(0x08)
	struct UBaseTextBlock_C* MutationPointsText; // 0x498(0x08)
	struct UPlatformCalloutButton_WBP_C* OpenZombiePanelCallout; // 0x4a0(0x08)
	struct UImage* PointsIcon; // 0x4a8(0x08)
	struct UImage* Portrait; // 0x4b0(0x08)
	struct UPlatformCalloutButton_WBP_C* ShowAbilitiesCallout; // 0x4b8(0x08)
	struct UBaseTextBlock_C* SpawnErrorText; // 0x4c0(0x08)
	struct UTextBlock* SpawnTimerText; // 0x4c8(0x08)
	struct UBaseTextBlock_C* UpgradesAvailableText; // 0x4d0(0x08)
	struct UBaseTextBlock_C* VariantNameText; // 0x4d8(0x08)
	struct UZombieAbilityList_WBP_C* ZombieAbilityList; // 0x4e0(0x08)
	struct UOverlay* ZombiePanelContainer; // 0x4e8(0x08)
	struct UGameplayCardManager* GameplayCardManager; // 0x4f0(0x08)
	struct AGobiPlayerState* GobiPlayerState; // 0x4f8(0x08)
	bool ZMS1Compatibility; // 0x500(0x01)
	char pad_501[0x7]; // 0x501(0x07)
	struct APawn* PawnClass; // 0x508(0x08)
	struct UZombieGhostComponent* ZombieGhostComponent; // 0x510(0x08)
	struct UTweenContainer* TweenZombiePanel; // 0x518(0x08)
	struct UTweenContainer* TweenSpawnCallout; // 0x520(0x08)
	bool bSpawnTweenTriggered; // 0x528(0x01)
	bool bZombiePanelTweenTriggered; // 0x529(0x01)
	char pad_52A[0x2]; // 0x52a(0x02)
	float PulseDelay; // 0x52c(0x04)
	int32_t PulseLoopCount; // 0x530(0x04)

	void OnPulseScaleTween(struct UTweenVector2D* Tween); // Function GhostModeIndicator2_WBP.GhostModeIndicator2_WBP_C.OnPulseScaleTween // (None) // @ game+0xfffffffec0000000
};

