// BlueprintGeneratedClass GobiAIController_BP.GobiAIController_BP_C
// Size: 0x3e8 (Inherited: 0x390)
struct AGobiAIController_BP_C : AGobiAIController {
	struct USteeringControl* NavToAlertLoc_SC; // 0x390(0x08)
	struct USteeringControl* NavToAttackLoc_SC; // 0x398(0x08)
	struct USteeringControl* NavToWanderLoc_SC; // 0x3a0(0x08)
	struct USteeringControl* NavToHighPrioritySmartActor_SC; // 0x3a8(0x08)
	struct USteeringControl* NavToLowPrioritySmartActor_SC; // 0x3b0(0x08)
	struct USteeringBehavior* NavToAttackLoc_SB; // 0x3b8(0x08)
	struct USteeringBehavior* NavToAlertLoc_SB; // 0x3c0(0x08)
	struct USteeringBehavior* NavToWanderLoc_SB; // 0x3c8(0x08)
	struct USteeringBehavior* NavToRetreatLoc_SB; // 0x3d0(0x08)
	struct USteeringBehavior* NavToHighPrioritySmartActor_SB; // 0x3d8(0x08)
	struct USteeringBehavior* NavToLowPrioritySmartActor_SB; // 0x3e0(0x08)
};

