// Class Gobi.MovementTickableComponent
// Size: 0x120 (Inherited: 0xd8)
struct UMovementTickableComponent : UActorComponent {
	char pad_D8[0x48]; // 0xd8(0x48)
};

// Class Gobi.AbilityComponent
// Size: 0x1c8 (Inherited: 0x120)
struct UAbilityComponent : UMovementTickableComponent {
	struct FTriggerEffectsDefinition TriggerEffects; // 0x120(0x0c)
	char pad_12C[0x8c]; // 0x12c(0x8c)
	enum class EAbilityType AbilityType; // 0x1b8(0x01)
	char pad_1B9[0x7]; // 0x1b9(0x07)
	struct UAkAudioEvent* DryFireAudio; // 0x1c0(0x08)

	void OnOwningCharacterUnpossessed(struct AGobiCharacter* GobiCharacter); // Function Gobi.AbilityComponent.OnOwningCharacterUnpossessed // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GobiObject
// Size: 0x30 (Inherited: 0x30)
struct UGobiObject : UObject {
};

// Class Gobi.GameplayMod
// Size: 0x88 (Inherited: 0x30)
struct UGameplayMod : UGobiObject {
	bool bApplyOnlyToOwner; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FGameplayTagQuery ApplyTagQuery; // 0x38(0x48)
	bool bInstanced; // 0x80(0x01)
	bool bApplyOnClients; // 0x81(0x01)
	char pad_82[0x2]; // 0x82(0x02)
	int32_t SupportedPhases; // 0x84(0x04)

	void K2_RemoveShared(struct FGameplayModContext ModContext, enum class EModPhase ModPhase, struct TArray<struct AGobiCharacter*> AffectedCharacters); // Function Gobi.GameplayMod.K2_RemoveShared // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AbilityTimeMod
// Size: 0xc0 (Inherited: 0x88)
struct UAbilityTimeMod : UGameplayMod {
	enum class EAbilityTimeModType Type; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	struct FGamePropertyFloatMod Time; // 0x8c(0x10)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct FGameplayTagContainer AbilityTags; // 0xa0(0x20)
};

// Class Gobi.GobiUserWidget
// Size: 0x450 (Inherited: 0x2d8)
struct UGobiUserWidget : UUserWidget {
	struct FMulticastInlineDelegate OnHovered; // 0x2d8(0x10)
	struct FMulticastInlineDelegate OnUnhovered; // 0x2e8(0x10)
	struct FMulticastInlineDelegate OnPressed; // 0x2f8(0x10)
	struct FMulticastInlineDelegate OnReleased; // 0x308(0x10)
	struct FMulticastInlineDelegate OnClicked; // 0x318(0x10)
	struct FMulticastInlineDelegate OnRightClicked; // 0x328(0x10)
	struct FMulticastInlineDelegate OnDoubleClicked; // 0x338(0x10)
	bool bListenForCultureChange; // 0x348(0x01)
	bool bIgnoreTrapFocus; // 0x349(0x01)
	char pad_34A[0x6]; // 0x34a(0x06)
	struct TMap<enum class EIconPlatform, struct UAkAudioEvent*> TTSFocusAudioEvents; // 0x350(0x50)
	struct UAkAudioEvent* TTSFocusStopAudioEvent; // 0x3a0(0x08)
	char pad_3A8[0x8]; // 0x3a8(0x08)
	struct FString TTSFocusMessage; // 0x3b0(0x10)
	bool bIsTTSQueued; // 0x3c0(0x01)
	char pad_3C1[0x7]; // 0x3c1(0x07)
	struct FSlateSound PressedSound; // 0x3c8(0x18)
	struct FSlateSound ClickedSound; // 0x3e0(0x18)
	struct FSlateSound HoveredSound; // 0x3f8(0x18)
	bool bIsHoverEnabled; // 0x410(0x01)
	bool bIsClickEnabled; // 0x411(0x01)
	bool bIsMouseClickEnabled; // 0x412(0x01)
	bool bIsRightClickEnabled; // 0x413(0x01)
	bool bIsGamepadClickEnabled; // 0x414(0x01)
	bool bIsKeyboardClickEnabled; // 0x415(0x01)
	char pad_416[0x2]; // 0x416(0x02)
	struct FName KeyboardClickActionOverride; // 0x418(0x08)
	struct FName GamepadClickActionOverride; // 0x420(0x08)
	struct FKey DragDropKey; // 0x428(0x18)
	bool bIsHovered; // 0x440(0x01)
	bool bIsPressed; // 0x441(0x01)
	bool bIsRightPressed; // 0x442(0x01)
	char pad_443[0xd]; // 0x443(0x0d)

	void SimulateClick(); // Function Gobi.GobiUserWidget.SimulateClick // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.OptionsPanelUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UOptionsPanelUserWidget : UGobiUserWidget {
	char pad_450[0x10]; // 0x450(0x10)

	void SetCalloutsWidget(struct UWidget* Widget); // Function Gobi.OptionsPanelUserWidget.SetCalloutsWidget // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FTUEOptionsPanelUserWidget
// Size: 0x498 (Inherited: 0x460)
struct UFTUEOptionsPanelUserWidget : UOptionsPanelUserWidget {
	char pad_460[0x10]; // 0x460(0x10)
	bool bShowContinueButton; // 0x470(0x01)
	char pad_471[0xf]; // 0x471(0x0f)
	struct FText Title; // 0x480(0x18)

	bool OnSettingsReloaded(); // Function Gobi.FTUEOptionsPanelUserWidget.OnSettingsReloaded // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AccessibilityOptionsUserWidget
// Size: 0x4d0 (Inherited: 0x498)
struct UAccessibilityOptionsUserWidget : UFTUEOptionsPanelUserWidget {
	char pad_498[0x38]; // 0x498(0x38)

	void OnWaypointOpacityChanged(struct UGobiUserWidget* Widget); // Function Gobi.AccessibilityOptionsUserWidget.OnWaypointOpacityChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.Achievement
// Size: 0xb8 (Inherited: 0x30)
struct UAchievement : UObject {
	char pad_30[0x1]; // 0x30(0x01)
	enum class EAchievementCategory Category; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
	struct FAchievementConfig AchievementConfig; // 0x38(0x28)
	struct TArray<struct FDataTableRowHandle> CardRewards; // 0x60(0x10)
	int32_t SupplyPointsReward; // 0x70(0x04)
	bool bNotForShipping; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FText FriendlyName; // 0x78(0x18)
	struct FText FriendlyDescription; // 0x90(0x18)
	struct UTexture2D* Icon; // 0xa8(0x08)
	char pad_B0[0x8]; // 0xb0(0x08)

	bool TriggerAchievement(); // Function Gobi.Achievement.TriggerAchievement // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AchievementAnalyticsComponent
// Size: 0xf8 (Inherited: 0xd8)
struct UAchievementAnalyticsComponent : UActorComponent {
	char pad_D8[0x20]; // 0xd8(0x20)

	void RecordAchievement(struct UAchievement* Achievement); // Function Gobi.AchievementAnalyticsComponent.RecordAchievement // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.UIScreen
// Size: 0x530 (Inherited: 0x450)
struct UUIScreen : UGobiUserWidget {
	struct FMulticastInlineDelegate OnClosed; // 0x450(0x10)
	struct UAkAudioEvent* OpenSoundOverride; // 0x460(0x08)
	struct UAkAudioEvent* CloseSoundOverride; // 0x468(0x08)
	struct FSlateSound MuteClickOverride; // 0x470(0x18)
	struct FSlateSound UnmuteClickOverride; // 0x488(0x18)
	bool bIsFullscreen; // 0x4a0(0x01)
	bool bDisableWorldRendering; // 0x4a1(0x01)
	bool bHideWaypoints; // 0x4a2(0x01)
	bool bRequiresPlayerPawn; // 0x4a3(0x01)
	bool bPlayOpenSound; // 0x4a4(0x01)
	bool bPlayCloseSound; // 0x4a5(0x01)
	bool bIsPersistent; // 0x4a6(0x01)
	bool bExecuteSplitscreenActions; // 0x4a7(0x01)
	bool bCenterCursorOnOpen; // 0x4a8(0x01)
	bool bTrapFocus; // 0x4a9(0x01)
	char pad_4AA[0x2]; // 0x4aa(0x02)
	int32_t ZOrder; // 0x4ac(0x04)
	struct FString ScreenName; // 0x4b0(0x10)
	bool bSuppressBackgroundAudio; // 0x4c0(0x01)
	enum class EUIScreenPresence Presence; // 0x4c1(0x01)
	char pad_4C2[0x6e]; // 0x4c2(0x6e)

	void UnbindMuteCallout(); // Function Gobi.UIScreen.UnbindMuteCallout // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AchievementsScreen
// Size: 0x580 (Inherited: 0x530)
struct UAchievementsScreen : UUIScreen {
	struct TMap<enum class EAchievementCategory, struct FText> CategoriesToText; // 0x530(0x50)

	struct TArray<struct FAchievementUIData> GetAchievementsForCategory(enum class EAchievementCategory MatchCategory); // Function Gobi.AchievementsScreen.GetAchievementsForCategory // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AchievementTrackerComponent
// Size: 0x198 (Inherited: 0xd8)
struct UAchievementTrackerComponent : UActorComponent {
	struct FMulticastInlineDelegate OnAchievementCompleted; // 0xd8(0x10)
	char pad_E8[0x50]; // 0xe8(0x50)
	struct TArray<struct UAchievement*> AllAchievements; // 0x138(0x10)
	struct TArray<struct UAchievement*> ActiveAchievements; // 0x148(0x10)
	struct TArray<struct UAchievement*> AchievementClasses; // 0x158(0x10)
	char pad_168[0x18]; // 0x168(0x18)
	struct UAchievement* PartyUpAchievementClass; // 0x180(0x08)
	struct UAchievement* TestRewardAchievementClass; // 0x188(0x08)
	char pad_190[0x8]; // 0x190(0x08)

	bool UnlockManualAchievement(struct UAchievement* AchievementClass); // Function Gobi.AchievementTrackerComponent.UnlockManualAchievement // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ActiveAreaSetBucketWeightMod
// Size: 0x98 (Inherited: 0x88)
struct UActiveAreaSetBucketWeightMod : UGameplayMod {
	struct TArray<float> BucketWeights; // 0x88(0x10)
};

// Class Gobi.ActiveAreaSetComponent
// Size: 0x160 (Inherited: 0xd8)
struct UActiveAreaSetComponent : UActorComponent {
	struct FActiveAreaSetDebugData DebugOverall; // 0xd8(0x10)
	struct FActiveAreaSetDebugData DebugActiveAreaSet; // 0xe8(0x10)
	struct TArray<int32_t> DebugDistanceBucketWeightLevels; // 0xf8(0x10)
	struct FVector2D GoldenPathPopulationRange; // 0x108(0x08)
	float GoldenPathMinScale; // 0x110(0x04)
	enum class EInclusionMode InclusionMode; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	float WanderPopulationBucketDistance; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct TArray<float> WanderPopulationBucketDensities; // 0x120(0x10)
	struct TArray<struct FWanderBucketDensityLevelsByDifficultyEntry> WanderPopulationBucketDensityLevelsByDifficulty; // 0x130(0x10)
	float WanderPopulationInitialBucketDistance; // 0x140(0x04)
	float WanderPopulationInitialBucketDensity; // 0x144(0x04)
	struct TArray<struct FWanderBucketInitialDensityLevelByDifficultyEntry> WanderPopulationInitialBucketDensityLevelsByDifficulty; // 0x148(0x10)
	struct UWanderPopulationDensityConfig* WanderDensityConfig; // 0x158(0x08)
};

// Class Gobi.ActiveAreaSetSubsystem
// Size: 0x138 (Inherited: 0x38)
struct UActiveAreaSetSubsystem : UWorldSubsystem {
	char pad_38[0x100]; // 0x38(0x100)

	void OnMatchStateChanged(); // Function Gobi.ActiveAreaSetSubsystem.OnMatchStateChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ActiveAreaSetVisibilityComponent
// Size: 0x110 (Inherited: 0xd8)
struct UActiveAreaSetVisibilityComponent : UActorComponent {
	struct FMulticastInlineDelegate OnVisibilityChanged; // 0xd8(0x10)
	enum class EAASVisibility CurrentVisibility; // 0xe8(0x01)
	char pad_E9[0x3]; // 0xe9(0x03)
	uint32_t CellId; // 0xec(0x04)
	char pad_F0[0x20]; // 0xf0(0x20)

	void OnVisibilityChangedSignature__DelegateSignature(enum class EAASVisibility NewVisibility); // DelegateFunction Gobi.ActiveAreaSetVisibilityComponent.OnVisibilityChangedSignature__DelegateSignature // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.InGameScreen
// Size: 0x560 (Inherited: 0x530)
struct UInGameScreen : UUIScreen {
	bool bCloseWhenHeroDisabled; // 0x530(0x01)
	bool bCloseWhenHeroNotAlive; // 0x531(0x01)
	char pad_532[0x2e]; // 0x532(0x2e)

	void OnGameplayTagChanged(struct FGameplayTag Tag, bool TagExists); // Function Gobi.InGameScreen.OnGameplayTagChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.HubChildScreen
// Size: 0x560 (Inherited: 0x560)
struct UHubChildScreen : UInGameScreen {

	void SetCalloutsWidget(struct UGobiUserWidget* CalloutsWidget); // Function Gobi.HubChildScreen.SetCalloutsWidget // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ActiveCardScreen
// Size: 0x560 (Inherited: 0x560)
struct UActiveCardScreen : UHubChildScreen {

	void SetDrawCount(int32_t InCount); // Function Gobi.ActiveCardScreen.SetDrawCount // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ActivitySubsystem
// Size: 0x210 (Inherited: 0x38)
struct UActivitySubsystem : ULocalPlayerSubsystem {
	bool bEnabledForPlatform; // 0x38(0x01)
	char pad_39[0x1d7]; // 0x39(0x1d7)

	void OnSignInCompleted(); // Function Gobi.ActivitySubsystem.OnSignInCompleted // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ActorPlacementSpec
// Size: 0xa8 (Inherited: 0x30)
struct UActorPlacementSpec : UObject {
	struct AActor* ActorClass; // 0x30(0x08)
	int32_t SegmentStartIndex; // 0x38(0x04)
	int32_t SegmentEndIndex; // 0x3c(0x04)
	float DistanceInterval; // 0x40(0x04)
	float OffsetFromStart; // 0x44(0x04)
	bool InheritSplineRotation; // 0x48(0x01)
	bool bInheritSplineYawRotation; // 0x49(0x01)
	enum class ESplineActorOffsetMode OffsetMode; // 0x4a(0x01)
	char pad_4B[0x1]; // 0x4b(0x01)
	struct FVector Translation; // 0x4c(0x0c)
	struct FRotator Rotation; // 0x58(0x0c)
	struct FVector MinTranslation; // 0x64(0x0c)
	struct FVector MaxTranslation; // 0x70(0x0c)
	struct FRotator MinRotation; // 0x7c(0x0c)
	struct FRotator MaxRotation; // 0x88(0x0c)
	char pad_94[0x4]; // 0x94(0x04)
	struct TArray<struct AActor*> PlacedActors; // 0x98(0x10)
};

// Class Gobi.ActorToComponentConverter
// Size: 0x48 (Inherited: 0x38)
struct UActorToComponentConverter : UDataAsset {
	bool bUpdate; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct AActor* ActorClass; // 0x40(0x08)
};

// Class Gobi.ActSelectUserWidget
// Size: 0x490 (Inherited: 0x450)
struct UActSelectUserWidget : UGobiUserWidget {
	struct FMulticastInlineDelegate OnMapSelected; // 0x450(0x10)
	struct FMulticastInlineDelegate OnMapChainToggled; // 0x460(0x10)
	struct FMulticastInlineDelegate OnMapFocused; // 0x470(0x10)
	char pad_480[0x10]; // 0x480(0x10)

	void SetMode(enum class EMatchmakingScreenMode InMode); // Function Gobi.ActSelectUserWidget.SetMode // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ItemBaseComponent
// Size: 0x150 (Inherited: 0x120)
struct UItemBaseComponent : UMovementTickableComponent {
	char pad_120[0x10]; // 0x120(0x10)
	struct UHeroMovementComponent* OwnerMovementComponent; // 0x130(0x08)
	struct FText UsePrompt; // 0x138(0x18)

	void OnPerkChange(); // Function Gobi.ItemBaseComponent.OnPerkChange // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ADSComponent
// Size: 0x410 (Inherited: 0x150)
struct UADSComponent : UItemBaseComponent {
	bool bIsHoldingADS; // 0x150(0x01)
	char pad_151[0xbf]; // 0x151(0xbf)
	struct FAssetLookupFloat ADSActivatePercent; // 0x210(0x18)
	struct FAssetLookupFloat ADSMeshSwapPercent; // 0x228(0x18)
	struct FAssetLookupFloat ADSActiveFOV; // 0x240(0x18)
	struct FAssetLookupCurveFloat FOVBlendCurve; // 0x258(0x18)
	enum class EAimSensitivitySpace ZoomLevel; // 0x270(0x01)
	char pad_271[0x7]; // 0x271(0x07)
	struct FAssetLookupAnimSequence ADSEnterAnimation; // 0x278(0x18)
	struct FAssetLookupAnimSequence ADSExitAnimation; // 0x290(0x18)
	struct FAssetLookupAnimSequence ADSIdleAnimation; // 0x2a8(0x18)
	struct FAssetLookupFloat FiringNoiseAdditiveAlphaMax; // 0x2c0(0x18)
	struct FAssetLookupFloat JumpWeightMax; // 0x2d8(0x18)
	struct FAssetLookupFloat WalkWeightMax; // 0x2f0(0x18)
	struct FAssetLookupFloat LookSwayWeightMax; // 0x308(0x18)
	struct FName CharacterADSSoundTag; // 0x320(0x08)
	struct TArray<struct FName> GunBonesToHideAtADS; // 0x328(0x10)
	struct TArray<struct FName> PlayerBonesToHideAtADS; // 0x338(0x10)
	struct FAssetLookupNameArray BonesToHideWhenADS; // 0x348(0x20)
	struct FAssetLookupNameArray BonesToUnhideWhenADS; // 0x368(0x20)
	struct FAssetLookupGameplayTagContainer BlockingTags; // 0x388(0x30)
	struct FAssetLookupGameplayTagContainer TagsToApply; // 0x3b8(0x30)
	struct FGameplayTagContainer InstantlyCancellingTags; // 0x3e8(0x20)
	struct FADSTuning ADSTuning; // 0x408(0x08)

	bool WantsADSAnimations(); // Function Gobi.ADSComponent.WantsADSAnimations // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AffinityPopupStatEntryUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UAffinityPopupStatEntryUserWidget : UGobiUserWidget {
	struct UStatEntryUserWidget* StatEntryClass; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)

	void SetStatInfo(enum class EGameplayCardAffinity Type, int32_t Count, struct UTexture2D* Icon, struct FSlateColor IconColor); // Function Gobi.AffinityPopupStatEntryUserWidget.SetStatInfo // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.PopupUserWidget
// Size: 0x470 (Inherited: 0x450)
struct UPopupUserWidget : UGobiUserWidget {
	struct FMulticastInlineDelegate OnPopupClosed; // 0x450(0x10)
	struct UObject* Payload; // 0x460(0x08)
	bool bDestroyOnClose; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)

	void OnShow(); // Function Gobi.PopupUserWidget.OnShow // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AffinityStatsPopup
// Size: 0x480 (Inherited: 0x470)
struct UAffinityStatsPopup : UPopupUserWidget {
	char pad_470[0x10]; // 0x470(0x10)

	void SetStat(int32_t Index, int32_t Count, struct UTexture2D* Icon, struct FSlateColor IconColor); // Function Gobi.AffinityStatsPopup.SetStat // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AffinityStatsUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UAffinityStatsUserWidget : UGobiUserWidget {
	char pad_450[0x10]; // 0x450(0x10)

	void SetStat(int32_t Index, int32_t Count, struct UTexture2D* Icon, struct FSlateColor IconColor); // Function Gobi.AffinityStatsUserWidget.SetStat // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AFKSubsystem
// Size: 0x60 (Inherited: 0x38)
struct UAFKSubsystem : ULocalPlayerSubsystem {
	char pad_38[0x28]; // 0x38(0x28)

	void OnPopupClosed(struct UPopupUserWidget* Popup, struct FName Command); // Function Gobi.AFKSubsystem.OnPopupClosed // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AggroGrowthComponent
// Size: 0x150 (Inherited: 0xd8)
struct UAggroGrowthComponent : UActorComponent {
	float CurAggroLevel; // 0xd8(0x04)
	float AggroDefault; // 0xdc(0x04)
	float AggroMinimum; // 0xe0(0x04)
	float AggroMaximum; // 0xe4(0x04)
	float AggroUpTime; // 0xe8(0x04)
	float AggroDownTime; // 0xec(0x04)
	float TransitionTime; // 0xf0(0x04)
	struct FGameplayTag DetectAggroTag; // 0xf4(0x08)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FGameplayTagContainer RemoveOnAggroTags; // 0x100(0x20)
	struct TArray<struct UGameplayEffect*> ApplyAggroEffectsToOwner; // 0x120(0x10)
	struct FMulticastInlineDelegate OnAggroEnded; // 0x130(0x10)
	char pad_140[0x10]; // 0x140(0x10)

	void OnRep_CurAggroLevel(float AggroLevel); // Function Gobi.AggroGrowthComponent.OnRep_CurAggroLevel // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AIBlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UAIBlueprintFunctionLibrary : UBlueprintFunctionLibrary {

	void ToggleAIRotateToFocus(struct AActor* AIActor, bool bShouldRotateToFocus); // Function Gobi.AIBlueprintFunctionLibrary.ToggleAIRotateToFocus // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GobiCharacterMovementComponent
// Size: 0x900 (Inherited: 0x670)
struct UGobiCharacterMovementComponent : UCharacterMovementComponent {
	char pad_670[0x6]; // 0x670(0x06)
	enum class ECollisionEnabled CollisionType; // 0x676(0x01)
	int8_t CollisionProfileIndex; // 0x677(0x01)
	char pad_678[0x8]; // 0x678(0x08)
	struct FGameplayTagContainer AttachedTags; // 0x680(0x20)
	char pad_6A0[0x24]; // 0x6a0(0x24)
	bool bUseGroundCheckSphereSweep; // 0x6c4(0x01)
	bool bUseFootPlantingSphereSweep; // 0x6c5(0x01)
	char pad_6C6[0xa]; // 0x6c6(0x0a)
	float OverrideGroundTraceLength; // 0x6d0(0x04)
	char pad_6D4[0x10]; // 0x6d4(0x10)
	float FallTimeTillFallOutOfWorld; // 0x6e4(0x04)
	char pad_6E8[0x28]; // 0x6e8(0x28)
	struct AGobiCharacter* GobiCharacter; // 0x710(0x08)
	struct FMovementTickableInput SimulatedInput; // 0x718(0x24)
	char pad_73C[0x4]; // 0x73c(0x04)
	struct UReplicatedMontageComponent* ReplicatedMontageComponent; // 0x740(0x08)
	char pad_748[0x8]; // 0x748(0x08)
	struct UGameplayTagsComponent* GameplayTagsComponent; // 0x750(0x08)
	char pad_758[0x3c]; // 0x758(0x3c)
	enum class EAutoCrouch AutoCrouch; // 0x794(0x01)
	char pad_795[0x3]; // 0x795(0x03)
	float MaxBackupToUnCrouch; // 0x798(0x04)
	char pad_79C[0x2c]; // 0x79c(0x2c)
	struct UChargeComponent* ChargeComponent; // 0x7c8(0x08)
	float DefaultPathMovementScalar; // 0x7d0(0x04)
	char pad_7D4[0x4]; // 0x7d4(0x04)
	struct TMap<struct FGameplayTag, float> PathMovementScalars; // 0x7d8(0x50)
	char pad_828[0x50]; // 0x828(0x50)
	struct UNavigationQueryFilter* NavWalkingFilter; // 0x878(0x08)
	struct FGameplayTagQuery NavMeshIgnoreTagsQuery; // 0x880(0x48)
	struct FCollisionProfileName NavWalkingCollisionProfile; // 0x8c8(0x08)
	struct FName DefaultWalkingCollisionProfile; // 0x8d0(0x08)
	char pad_8D8[0x28]; // 0x8d8(0x28)

	void OnRep_CollisionType(); // Function Gobi.GobiCharacterMovementComponent.OnRep_CollisionType // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AICharacterMovementComponent
// Size: 0x900 (Inherited: 0x900)
struct UAICharacterMovementComponent : UGobiCharacterMovementComponent {
};

// Class Gobi.AIDataProvider_BehaviorParams
// Size: 0xb8 (Inherited: 0x30)
struct UAIDataProvider_BehaviorParams : UAIDataProvider {
	struct FName ParamName; // 0x30(0x08)
	float FloatValue; // 0x38(0x04)
	int32_t IntValue; // 0x3c(0x04)
	bool BoolValue; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FGameplayTagContainer TagsValue; // 0x48(0x20)
	struct FGameplayTagQuery TagQueryValue; // 0x68(0x48)
	struct UObject* UObjectValue; // 0xb0(0x08)
};

// Class Gobi.AIDataProvider_TuningData
// Size: 0xb8 (Inherited: 0x30)
struct UAIDataProvider_TuningData : UAIDataProvider {
	struct FName ParamName; // 0x30(0x08)
	float FloatValue; // 0x38(0x04)
	int32_t IntValue; // 0x3c(0x04)
	bool BoolValue; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FGameplayTagContainer TagsValue; // 0x48(0x20)
	struct FGameplayTagQuery TagQueryValue; // 0x68(0x48)
	struct UObject* UObjectValue; // 0xb0(0x08)
};

// Class Gobi.AIDistanceRanges
// Size: 0x50 (Inherited: 0x38)
struct UAIDistanceRanges : UDataAsset {
	struct UEnum* DistanceLabelEnum; // 0x38(0x08)
	struct TArray<struct FDistanceRange> Ranges; // 0x40(0x10)

	float GetDistanceMin(struct FString DistanceLabel); // Function Gobi.AIDistanceRanges.GetDistanceMin // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AimAssistTargetComponent
// Size: 0x190 (Inherited: 0xd8)
struct UAimAssistTargetComponent : UActorComponent {
	char pad_D8[0x70]; // 0xd8(0x70)
	bool bStartRegistered; // 0x148(0x01)
	char pad_149[0x3]; // 0x149(0x03)
	float MagnetismScale; // 0x14c(0x04)
	float FrictionScale; // 0x150(0x04)
	bool bIncludeTargetLocationAsADSSnapLocation; // 0x154(0x01)
	char pad_155[0x3]; // 0x155(0x03)
	struct FGameplayTag ADSSnapTargetedComponentGameplayTag; // 0x158(0x08)
	struct TArray<struct FName> ADSSnapTargetedComponentSocketNames; // 0x160(0x10)
	float HorizontalRadiusBoundsScale; // 0x170(0x04)
	float VerticalRadiusBoundsScale; // 0x174(0x04)
	float InnerAssistBoundsScale; // 0x178(0x04)
	float TargetScoringBonus; // 0x17c(0x04)
	struct FVector TargetLocationOffset; // 0x180(0x0c)
	char pad_18C[0x4]; // 0x18c(0x04)

	void UnregisterTarget(); // Function Gobi.AimAssistTargetComponent.UnregisterTarget // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AIPopulationStats
// Size: 0x90 (Inherited: 0x30)
struct UAIPopulationStats : UObject {
	char pad_30[0x60]; // 0x30(0x60)
};

// Class Gobi.AIScriptingComponent
// Size: 0x470 (Inherited: 0xd8)
struct UAIScriptingComponent : UActorComponent {
	struct FMulticastInlineDelegate OnSenseUnWatched; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnSensedWhizBy; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnAlertedChanged; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnEnemyChanged; // 0x108(0x10)
	struct FMulticastInlineDelegate OnHideFromHordesChanged; // 0x118(0x10)
	struct UBlackboardData* BlackboardAsset; // 0x128(0x08)
	struct FBlackboardKeySelector AlertToLocationBBKey; // 0x130(0x28)
	struct FBlackboardKeySelector PseudoAlertToLocationBBKey; // 0x158(0x28)
	struct FBlackboardKeySelector RetreatLocationBBKey; // 0x180(0x28)
	struct FBlackboardKeySelector AmbushLocationBBKey; // 0x1a8(0x28)
	struct FBlackboardKeySelector WanderLocationBBKey; // 0x1d0(0x28)
	struct FBlackboardKeySelector IsHordingBBKey; // 0x1f8(0x28)
	struct FBlackboardKeySelector EnemyBBKey; // 0x220(0x28)
	struct FBlackboardKeySelector HighPrioritySmartActorBBKey; // 0x248(0x28)
	struct FBlackboardKeySelector LowPrioritySmartActorBBKey; // 0x270(0x28)
	struct FBlackboardKeySelector ReachInSmartActorBBKey; // 0x298(0x28)
	struct FBlackboardKeySelector WallClingActorBBKey; // 0x2c0(0x28)
	struct FBlackboardKeySelector CanTriggerAttackBBKey; // 0x2e8(0x28)
	struct FBlackboardKeySelector CanTriggerAttackIgnoreEnabledBBKey; // 0x310(0x28)
	struct FBlackboardKeySelector IsDeadBBKey; // 0x338(0x28)
	struct FBlackboardKeySelector HealthBBKey; // 0x360(0x28)
	struct FBlackboardKeySelector ScriptSplineBBKey; // 0x388(0x28)
	struct FBlackboardKeySelector HideFromHordesBBKey; // 0x3b0(0x28)
	struct FBlackboardKeySelector ShouldHideBBKey; // 0x3d8(0x28)
	struct FBlackboardKeySelector AttackLocationBBKey; // 0x400(0x28)
	struct FVector DefaultExtents; // 0x428(0x0c)
	char pad_434[0x3c]; // 0x434(0x3c)

	void StopAllAI(struct UObject* WorldContextObject, struct FString Reason); // Function Gobi.AIScriptingComponent.StopAllAI // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AISense_Omnipotence
// Size: 0xe0 (Inherited: 0x88)
struct UAISense_Omnipotence : UAISense {
	char pad_88[0x58]; // 0x88(0x58)
};

// Class Gobi.AISense_TRSHearing
// Size: 0x140 (Inherited: 0x88)
struct UAISense_TRSHearing : UAISense {
	struct TArray<struct FAITRSNoiseEvent> NoiseEvents; // 0x88(0x10)
	float SpeedOfSoundSq; // 0x98(0x04)
	char pad_9C[0xa4]; // 0x9c(0xa4)

	void ReportTRSWhizByEvent(struct UObject* WorldContextObject, struct FVector NoiseLocationStart, struct FVector NoiseLocationEnd, float Loudness, struct AActor* Instigator, float MaxRange, struct FName Tag); // Function Gobi.AISense_TRSHearing.ReportTRSWhizByEvent // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AISense_TRSSight
// Size: 0x160 (Inherited: 0x88)
struct UAISense_TRSSight : UAISense {
	char pad_88[0xb0]; // 0x88(0xb0)
	int32_t MaxTracesPerTick; // 0x138(0x04)
	int32_t MinQueriesPerTimeSliceCheck; // 0x13c(0x04)
	double MaxTimeSlicePerTick; // 0x140(0x08)
	float HighImportanceQueryDistanceThreshold; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	float MaxQueryImportance; // 0x150(0x04)
	float SightLimitQueryImportance; // 0x154(0x04)
	char pad_158[0x8]; // 0x158(0x08)
};

// Class Gobi.AISense_UnWatched
// Size: 0x140 (Inherited: 0x88)
struct UAISense_UnWatched : UAISense {
	char pad_88[0xb8]; // 0x88(0xb8)
};

// Class Gobi.AISense_Watched
// Size: 0x140 (Inherited: 0x88)
struct UAISense_Watched : UAISense {
	char pad_88[0xb8]; // 0x88(0xb8)
};

// Class Gobi.AISenseConfig_Omnipotence
// Size: 0x60 (Inherited: 0x50)
struct UAISenseConfig_Omnipotence : UAISenseConfig {
	struct UAISense_Omnipotence* Implementation; // 0x50(0x08)
	float OmniRadius; // 0x58(0x04)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c(0x04)
};

// Class Gobi.AISenseConfig_TRSHearing
// Size: 0x78 (Inherited: 0x50)
struct UAISenseConfig_TRSHearing : UAISenseConfig {
	struct UAISense_TRSHearing* Implementation; // 0x50(0x08)
	enum class ESenseHearingMode HearingMode; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float HearingRange; // 0x5c(0x04)
	float LoSHearingRange; // 0x60(0x04)
	float HearingDistPathingMult; // 0x64(0x04)
	char bUseLoSHearing : 1; // 0x68(0x01)
	char pad_68_1 : 7; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	bool bAlertToInstigator; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Gobi.AISenseConfig_TRSSight
// Size: 0x78 (Inherited: 0x50)
struct UAISenseConfig_TRSSight : UAISenseConfig {
	struct UAISense_TRSSight* Implementation; // 0x50(0x08)
	float SightRadius; // 0x58(0x04)
	float AlertSightRadius; // 0x5c(0x04)
	float LoseSightRadius; // 0x60(0x04)
	float MinRadius; // 0x64(0x04)
	float PeripheralVisionAngleDegrees; // 0x68(0x04)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x6c(0x04)
	float AutoSuccessRangeFromLastSeenLocation; // 0x70(0x04)
	bool bUseAimAssist; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class Gobi.AISenseConfig_UnWatched
// Size: 0x70 (Inherited: 0x50)
struct UAISenseConfig_UnWatched : UAISenseConfig {
	struct UAISense_UnWatched* Implementation; // 0x50(0x08)
	float WatchedMaxRadius; // 0x58(0x04)
	float AutoWatchedRadius; // 0x5c(0x04)
	float GlobalWatchTimeLimitMS; // 0x60(0x04)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x64(0x04)
	char bResetTimerOnLookedAt : 1; // 0x68(0x01)
	char bResetTimerOnTrigger : 1; // 0x68(0x01)
	char pad_68_2 : 6; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Gobi.AISenseConfig_Watched
// Size: 0x98 (Inherited: 0x50)
struct UAISenseConfig_Watched : UAISenseConfig {
	struct UAISense_Watched* Implementation; // 0x50(0x08)
	float WarnTargetNearbyRadius; // 0x58(0x04)
	float WarnTargetLoseNearbyRadius; // 0x5c(0x04)
	float WatchedRadius; // 0x60(0x04)
	float WatchedAngleDegrees; // 0x64(0x04)
	float ListenerSizeRadiusMultModifier; // 0x68(0x04)
	float ListenerSizeRadiusMinimum; // 0x6c(0x04)
	float GlobalWatchTimeLimitMS; // 0x70(0x04)
	float IndividualAggroWatchTimeLimitMS; // 0x74(0x04)
	float IndividualAlertWatchTimeLimitMS; // 0x78(0x04)
	float CenterNoiseOffsetDist; // 0x7c(0x04)
	struct UGameplayEffect* ApplyListenerEffectOnWatched; // 0x80(0x08)
	struct UGameplayEffect* ApplyListenerEffectOnCenterWatched; // 0x88(0x08)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x90(0x04)
	char bResetIndividualTimersOnLookaway : 1; // 0x94(0x01)
	char bResetGlobalTimerOnLookaway : 1; // 0x94(0x01)
	char bCenterWatchRequiresFlashlight : 1; // 0x94(0x01)
	char pad_94_3 : 5; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
};

// Class Gobi.AISenseEvent_TRSHearing
// Size: 0x70 (Inherited: 0x30)
struct UAISenseEvent_TRSHearing : UAISenseEvent {
	struct FAITRSNoiseEvent Event; // 0x30(0x40)
};

// Class Gobi.AISenseMod
// Size: 0x98 (Inherited: 0x88)
struct UAISenseMod : UGameplayMod {
	struct TArray<struct FAISenseModInfo> SenseMods; // 0x88(0x10)
};

// Class Gobi.AISeparationGroups
// Size: 0x48 (Inherited: 0x38)
struct UAISeparationGroups : UDataAsset {
	struct TArray<struct FAISeparationGroup> Groups; // 0x38(0x10)
};

// Class Gobi.AISmartActorBase
// Size: 0x3a0 (Inherited: 0x250)
struct AAISmartActorBase : AActor {
	char pad_250[0x8]; // 0x250(0x08)
	struct FGameplayTagContainer GameplayTags; // 0x258(0x20)
	struct TArray<struct UGameplayAction*> UserActionSet; // 0x278(0x10)
	bool bShuffleUserActions; // 0x288(0x01)
	char pad_289[0x3]; // 0x289(0x03)
	int32_t MaxUsers; // 0x28c(0x04)
	bool bNeedsToRenderOnClient; // 0x290(0x01)
	char pad_291[0x7]; // 0x291(0x07)
	struct FGameplayTagContainer RequiredCharacterTags; // 0x298(0x20)
	struct FGameplayTagContainer BlockingCharacterTags; // 0x2b8(0x20)
	struct FGameplayTagContainer BlockingTags; // 0x2d8(0x20)
	float MinRotatingCooldownTime; // 0x2f8(0x04)
	float MaxRotatingCooldownTime; // 0x2fc(0x04)
	float MinRotatingCooldownOffset; // 0x300(0x04)
	float MaxRotatingCooldownOffset; // 0x304(0x04)
	struct UGameplayTagsComponent* GameplayTagsComponent; // 0x308(0x08)
	struct UGameplayEffectsComponent* GameplayEffectsComponent; // 0x310(0x08)
	float SpawnerBlockingRadius; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct FMulticastInlineDelegate OnStartUse; // 0x320(0x10)
	struct FMulticastInlineDelegate OnStopUse; // 0x330(0x10)
	char pad_340[0x60]; // 0x340(0x60)

	bool Use(struct AGobiCharacter* UserActor); // Function Gobi.AISmartActorBase.Use // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AISmartActor
// Size: 0x3b0 (Inherited: 0x3a0)
struct AAISmartActor : AAISmartActorBase {
	bool bUpdateCollectionGrid; // 0x3a0(0x01)
	char pad_3A1[0xf]; // 0x3a1(0x0f)
};

// Class Gobi.AISmartActor_BruteReachIn
// Size: 0x128 (Inherited: 0xd8)
struct UAISmartActor_BruteReachIn : UActorComponent {
	struct UBoxComponent* EnabledBox; // 0xd8(0x08)
	struct UStaticMeshComponent* VisualizationMesh; // 0xe0(0x08)
	struct AAISmartActor* AISmartActor; // 0xe8(0x08)
	struct UHealthComponent* DoorHealthComponent; // 0xf0(0x08)
	bool bShouldEnableOnOverlap; // 0xf8(0x01)
	char pad_F9[0x3]; // 0xf9(0x03)
	float MaxSearchDistance; // 0xfc(0x04)
	float CooldownSecs; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct UGobiDamageType* DamageTypeClass; // 0x108(0x08)
	char pad_110[0x18]; // 0x110(0x18)

	void OnEnabledBoxEndOverlap(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Gobi.AISmartActor_BruteReachIn.OnEnabledBoxEndOverlap // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AISpawnActor
// Size: 0x498 (Inherited: 0x3a0)
struct AAISpawnActor : AAISmartActorBase {
	char pad_3A0[0x10]; // 0x3a0(0x10)
	enum class EVisibilityMode VisibilityMode; // 0x3b0(0x01)
	enum class EAudibilityMode AudibilityMode; // 0x3b1(0x01)
	bool bUseStandSpawnPositioning; // 0x3b2(0x01)
	bool bUseNavLocationCompForSpawnLocation; // 0x3b3(0x01)
	int32_t MaxSpawnCount; // 0x3b4(0x04)
	struct FGameplayTagContainer HordeBlockingTags; // 0x3b8(0x20)
	struct FGameplayTagContainer WanderBlockingTags; // 0x3d8(0x20)
	char pad_3F8[0x1c]; // 0x3f8(0x1c)
	bool bDisableOnSeen; // 0x414(0x01)
	bool bDisableOnHeard; // 0x415(0x01)
	char pad_416[0x2]; // 0x416(0x02)
	struct UGameplayEffect* OnSeenGE; // 0x418(0x08)
	struct UGameplayEffect* OnHeardGE; // 0x420(0x08)
	char pad_428[0x70]; // 0x428(0x70)

	struct AGobiCharacter* SpawnAI(struct AGobiCharacter* AIClass, bool bIsHording); // Function Gobi.AISpawnActor.SpawnAI // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AISpawnActorVariantsConfig
// Size: 0x48 (Inherited: 0x38)
struct UAISpawnActorVariantsConfig : UDataAsset {
	struct TArray<struct FAISpawnActorVariantDefinition> Variants; // 0x38(0x10)
};

// Class Gobi.AISpawnActorVolume
// Size: 0x348 (Inherited: 0x288)
struct AAISpawnActorVolume : AVolume {
	struct FGameplayTagContainer InitialHordeBlockingTags; // 0x288(0x20)
	struct FGameplayTagContainer CurrentHordeBlockingTags; // 0x2a8(0x20)
	struct FGameplayTagContainer InitialWanderBlockingTags; // 0x2c8(0x20)
	struct FGameplayTagContainer CurrentWanderBlockingTags; // 0x2e8(0x20)
	struct FGameplayTagContainer InitialPersistentTags; // 0x308(0x20)
	struct FGameplayTagContainer CurrentPersistentTags; // 0x328(0x20)

	void RemoveWanderBlockingTag(struct FGameplayTag Tag); // Function Gobi.AISpawnActorVolume.RemoveWanderBlockingTag // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AISpawnCard
// Size: 0x128 (Inherited: 0x30)
struct UAISpawnCard : UObject {
	bool bShouldLogOnSuccess; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UAISpawnConditionEvaluatorSet* GenerationConditionEvalSet; // 0x38(0x08)
	struct UAISpawnConditionEvaluatorSet* ConditionEvalSet; // 0x40(0x08)
	struct UAISpawnConditionEvaluatorSet* SpawnerPlacementConditionEvalSet; // 0x48(0x08)
	struct TArray<struct FAIPopulation> Populations; // 0x50(0x10)
	int32_t TotalAICount; // 0x60(0x04)
	bool bHasWakingPopulation; // 0x64(0x01)
	bool bShouldSpawnEarly; // 0x65(0x01)
	char pad_66[0x2]; // 0x66(0x02)
	struct FGameplayTagContainer TagsToApplyToAllPopulations; // 0x68(0x20)
	struct FGameplayTagContainer CardTags; // 0x88(0x20)
	bool bShouldExhaust; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
	struct USpawningEQSData* SpawningData; // 0xb0(0x08)
	bool bAllowSpawnEQSToBeOverridden; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
	struct AAISpawnActor* AISpawnerClass; // 0xc0(0x08)
	struct FGameplayTagContainer AISpawnerTags; // 0xc8(0x20)
	int32_t InitialWanderDistanceBucketsToSkip; // 0xe8(0x04)
	bool bPlaceOnWalls; // 0xec(0x01)
	char pad_ED[0x3]; // 0xed(0x03)
	struct FVector2D WallSpawnHeight; // 0xf0(0x08)
	float SpawnRadiusOverride; // 0xf8(0x04)
	float SelfSpawnRadiusOverride; // 0xfc(0x04)
	float SpawnHalfHeightOverride; // 0x100(0x04)
	bool bLimitOneSpawnerPerActorSpawnData; // 0x104(0x01)
	bool bOnRecycleEnableSpawners; // 0x105(0x01)
	bool bOnDeathDisableAllSpawners; // 0x106(0x01)
	char pad_107[0x1]; // 0x107(0x01)
	struct FVector2D EnableSpawnerStartDistancePercentage; // 0x108(0x08)
	bool bIgnoreMaxAILimit; // 0x110(0x01)
	bool bUseDesiredGoldenPathDistanceDeltaFromHeroes; // 0x111(0x01)
	char pad_112[0x2]; // 0x112(0x02)
	struct FVector2D DesiredGoldenPathDistanceFromHeroes; // 0x114(0x08)
	struct FName DesiredGoldenPathDistanceDeltaName; // 0x11c(0x08)
	char pad_124[0x4]; // 0x124(0x04)
};

// Class Gobi.AISpawnConditionEvaluatorSet
// Size: 0x78 (Inherited: 0x30)
struct UAISpawnConditionEvaluatorSet : UObject {
	char pad_30[0x48]; // 0x30(0x48)
};

// Class Gobi.AISpawnDeck
// Size: 0x2f8 (Inherited: 0x30)
struct UAISpawnDeck : UObject {
	char pad_30[0x50]; // 0x30(0x50)
	struct TArray<struct UAISpawnCard*> SpawnCards; // 0x80(0x10)
	struct TArray<struct UAISpawnCard*> ExhaustedCards; // 0x90(0x10)
	struct TArray<struct FDiscardedCard> DiscardedCards; // 0xa0(0x10)
	struct TArray<struct FCardInPlay> CardsInPlay; // 0xb0(0x10)
	char pad_C0[0x238]; // 0xc0(0x238)

	void OnAIDeath(struct UHealthComponent* HealthComponent); // Function Gobi.AISpawnDeck.OnAIDeath // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AISpawnDeckGenerator
// Size: 0xe0 (Inherited: 0x38)
struct UAISpawnDeckGenerator : UDataAsset {
	struct UAISpawnConditionEvaluatorSet* GenerationConditionEvalSet; // 0x38(0x08)
	enum class EChildDeckBehavior ChildDeckBehavior; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FIntPoint NumChildDecks; // 0x44(0x08)
	bool bAllowChildDeckReuse; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	struct TArray<struct UAISpawnDeckGenerator*> ChildSpawnDeckGenerators; // 0x50(0x10)
	struct TArray<struct FAISpawnCardRule> SpawnCardRules; // 0x60(0x10)
	struct FGameplayTagContainer DeckTags; // 0x70(0x20)
	int32_t MaxCardsInPlay; // 0x90(0x04)
	float DelayBetweenCardDraws; // 0x94(0x04)
	float DelayAfterDiscard; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct TArray<struct FPerThreatLevelSpawnDelay> DelayBeforeInitialSpawn; // 0xa0(0x10)
	struct TArray<struct FPerThreatLevelSpawnDelay> DelayBeforeWaveSpawn; // 0xb0(0x10)
	float DelayBetweenCueAndSpawn; // 0xc0(0x04)
	struct FIntPoint NumHordeWaves; // 0xc4(0x08)
	float CompleteAfterSpawningStoppedTime; // 0xcc(0x04)
	bool bCompleteWhenAllCardsAreInPlayOrExhausted; // 0xd0(0x01)
	bool bCompleteWhenAllCardsAreExhausted; // 0xd1(0x01)
	bool bApplyModCards; // 0xd2(0x01)
	char pad_D3[0x1]; // 0xd3(0x01)
	float DeckWeight; // 0xd4(0x04)
	bool bRetryEQSWithoutOverrideIfNoSpawnersFound; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
};

// Class Gobi.AISpawnDeckGeneratorMod
// Size: 0x160 (Inherited: 0x88)
struct UAISpawnDeckGeneratorMod : UGameplayMod {
	struct TArray<struct FAISpawnCardRule> SpawnCardRulesToAdd; // 0x88(0x10)
	struct FGameplayTagQuery SpawnCardRemovalTagQuery; // 0x98(0x48)
	struct TArray<struct UAISpawnDeckGenerator*> SpawnDeckGeneratorsToAdd; // 0xe0(0x10)
	struct FGameplayTagContainer SpawnDeckTagsToAdd; // 0xf0(0x20)
	bool bUseTargetDeckTagQuery; // 0x110(0x01)
	char pad_111[0x7]; // 0x111(0x07)
	struct FGameplayTagQuery TargetDeckTagQuery; // 0x118(0x48)
};

// Class Gobi.AISpawnPointBudgets
// Size: 0x48 (Inherited: 0x38)
struct UAISpawnPointBudgets : UDataAsset {
	struct TArray<struct FSpawnPointBudget> Budgets; // 0x38(0x10)
};

// Class Gobi.AITypePointCosts
// Size: 0x48 (Inherited: 0x38)
struct UAITypePointCosts : UDataAsset {
	struct TArray<struct FAITypeCost> Costs; // 0x38(0x10)
};

// Class Gobi.AlertComponent
// Size: 0x230 (Inherited: 0x220)
struct UAlertComponent : USceneComponent {
	float AlertRadius; // 0x220(0x04)
	bool bAlertRadiusGrows; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	float AlertRadiusGrowthAmount; // 0x228(0x04)
	float MaxAlertRadius; // 0x22c(0x04)

	float GetAlertRadius(); // Function Gobi.AlertComponent.GetAlertRadius // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ApplyEffectItemComponent
// Size: 0x4e0 (Inherited: 0x150)
struct UApplyEffectItemComponent : UItemBaseComponent {
	struct FMulticastInlineDelegate OnItemApplied; // 0x150(0x10)
	struct FMulticastInlineDelegate OnItemCancelled; // 0x160(0x10)
	enum class EEffectApplicationItemState CurrentState; // 0x170(0x01)
	char pad_171[0xf]; // 0x171(0x0f)
	struct AActor* TargetActor; // 0x180(0x08)
	char pad_188[0x8]; // 0x188(0x08)
	struct UPrimitiveComponent* HitComponent; // 0x190(0x08)
	struct AGobiCharacter* VisualTargetCharacter; // 0x198(0x08)
	bool bWillExpendAmmoOnUse; // 0x1a0(0x01)
	char pad_1A1[0xd7]; // 0x1a1(0xd7)
	float RequiredUseLength; // 0x278(0x04)
	float FinishUseStateLength; // 0x27c(0x04)
	bool bRequireButtonHeld; // 0x280(0x01)
	bool bActivateWithoutValidTarget; // 0x281(0x01)
	bool bExpendAmmoWithoutValidTarget; // 0x282(0x01)
	bool bSelectPreviousWeaponAfterUse; // 0x283(0x01)
	bool bCancelUseOnKnockback; // 0x284(0x01)
	bool bRequireSelection; // 0x285(0x01)
	char pad_286[0x2]; // 0x286(0x02)
	float ChanceToExpendAmmoOnUse; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct UAkAudioEvent* AKENotExpended; // 0x290(0x08)
	float MovementScale; // 0x298(0x04)
	struct FName MovementScaleLabel; // 0x29c(0x08)
	bool bApplyMovementScaleToTargetPlayer; // 0x2a4(0x01)
	bool bScaleAnimationLengthToUseLength; // 0x2a5(0x01)
	char pad_2A6[0x2]; // 0x2a6(0x02)
	struct UAnimMontage* UseMontageFP; // 0x2a8(0x08)
	struct UAnimMontage* UseMontage3P; // 0x2b0(0x08)
	struct UAnimMontage* EndUseMontageFP; // 0x2b8(0x08)
	struct UAnimMontage* EndUseMontage3P; // 0x2c0(0x08)
	struct UAnimMontage* AltUseMontageFP; // 0x2c8(0x08)
	struct UAnimMontage* AltUseMontage3P; // 0x2d0(0x08)
	struct UAnimMontage* EndAltUseMontageFP; // 0x2d8(0x08)
	struct UAnimMontage* EndAltUseMontage3P; // 0x2e0(0x08)
	bool bRemoveAppliedTagsBeforeApplyingSuccessfulEffects; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)
	struct FGameplayTagContainer AppliedTags; // 0x2f0(0x20)
	struct FGameplayTagContainer BlockingTags; // 0x310(0x20)
	struct FGameplayTagQuery ContinuousTagQuery; // 0x330(0x48)
	struct FGameplayTagContainer TargetAppliedTags; // 0x378(0x20)
	struct FGameplayTagQuery InitialTargetTagQuery; // 0x398(0x48)
	struct FGameplayTagQuery ContinuousTargetTagQuery; // 0x3e0(0x48)
	struct FGameplayTag BeginUseCue; // 0x428(0x08)
	struct FGameplayTag SuccessfulUseCue; // 0x430(0x08)
	struct FGameplayTag UnsuccessfulUseCue; // 0x438(0x08)
	struct FText ProgressBarText; // 0x440(0x18)
	struct FText TargetProgressBarText; // 0x458(0x18)
	struct FText TargetSelfProgressBarText; // 0x470(0x18)
	bool bShowProgressbar; // 0x488(0x01)
	bool bAllowAltUseTargetting; // 0x489(0x01)
	char pad_48A[0x2]; // 0x48a(0x02)
	float MaxAltUseTargetDistance; // 0x48c(0x04)
	float MaxAltUseTargetDistanceWhenUsing; // 0x490(0x04)
	float MinAngleToTarget; // 0x494(0x04)
	struct TArray<struct UGameplayEffect*> OnSuccessGameplayEffects; // 0x498(0x10)
	struct TArray<struct UGameplayEffect*> OnTargetUseGameplayEffects; // 0x4a8(0x10)
	struct TArray<struct UGameplayEffect*> OnOwnerUseGameplayEffects; // 0x4b8(0x10)
	struct TArray<struct UGameplayEffect*> OnHeldGameplayEffects; // 0x4c8(0x10)
	struct FName TriggeredEventName; // 0x4d8(0x08)

	void OnRep_TargetActor(struct AActor* InPreviousTargetActor); // Function Gobi.ApplyEffectItemComponent.OnRep_TargetActor // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AmmoPouchComponent
// Size: 0x518 (Inherited: 0x4e0)
struct UAmmoPouchComponent : UApplyEffectItemComponent {
	char pad_4E0[0xc]; // 0x4e0(0x0c)
	int32_t UseCount; // 0x4ec(0x04)
	float AmmoPecentageToGrant[0x7]; // 0x4f0(0x1c)
	char pad_50C[0x4]; // 0x50c(0x04)
	struct UAkAudioEvent* AKEOnUse; // 0x510(0x08)

	void OnRep_UseCount(int32_t NewUseCount); // Function Gobi.AmmoPouchComponent.OnRep_UseCount // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayEvaluatorSet
// Size: 0x78 (Inherited: 0x30)
struct UGameplayEvaluatorSet : UObject {
	char pad_30[0x48]; // 0x30(0x48)
};

// Class Gobi.AnimationEvalSet
// Size: 0xc0 (Inherited: 0x78)
struct UAnimationEvalSet : UGameplayEvaluatorSet {
	char pad_78[0x48]; // 0x78(0x48)
};

// Class Gobi.AnimAttackWindowComponent
// Size: 0x1b0 (Inherited: 0xd8)
struct UAnimAttackWindowComponent : UActorComponent {
	struct FGameplayTag AttackCollisionVolumeTag; // 0xd8(0x08)
	bool bRequiresLineOfSight; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	struct FName LineOfSightTargetComponentTag; // 0xe4(0x08)
	bool bUseTargetEyePosForLoS; // 0xec(0x01)
	char pad_ED[0xc3]; // 0xed(0xc3)

	void OnAttackVolumeCollision(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Gobi.AnimAttackWindowComponent.OnAttackVolumeCollision // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayContext
// Size: 0x50 (Inherited: 0x30)
struct UGameplayContext : UObject {
	char pad_30[0x20]; // 0x30(0x20)
};

// Class Gobi.AnimContext
// Size: 0x50 (Inherited: 0x50)
struct UAnimContext : UGameplayContext {
};

// Class Gobi.AnimContext_Rotation
// Size: 0x60 (Inherited: 0x50)
struct UAnimContext_Rotation : UAnimContext {
	char pad_50[0x10]; // 0x50(0x10)

	struct FRotator GetRotation(); // Function Gobi.AnimContext_Rotation.GetRotation // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_Transform
// Size: 0x70 (Inherited: 0x60)
struct UAnimContext_Transform : UAnimContext_Rotation {
	struct FVector Location; // 0x60(0x0c)
	char pad_6C[0x4]; // 0x6c(0x04)

	struct FVector GetLocation(); // Function Gobi.AnimContext_Transform.GetLocation // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_Actor
// Size: 0x90 (Inherited: 0x70)
struct UAnimContext_Actor : UAnimContext_Transform {
	char pad_70[0x20]; // 0x70(0x20)

	float GetRadius(); // Function Gobi.AnimContext_Actor.GetRadius // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_ActorLocator
// Size: 0x80 (Inherited: 0x70)
struct UAnimContext_ActorLocator : UAnimContext_Transform {
	struct UAnimContext_Actor* ActorContext; // 0x70(0x08)
	struct FGameplayTag LocatorTag; // 0x78(0x08)
};

// Class Gobi.AnimContext_ActorSceneComp
// Size: 0x98 (Inherited: 0x90)
struct UAnimContext_ActorSceneComp : UAnimContext_Actor {
	struct FName ComponentTag; // 0x90(0x08)
};

// Class Gobi.AnimContext_ActorSocket
// Size: 0x98 (Inherited: 0x90)
struct UAnimContext_ActorSocket : UAnimContext_Actor {
	struct FName Socket; // 0x90(0x08)
};

// Class Gobi.AnimContext_AlertToLocation
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_AlertToLocation : UAnimContext_Transform {

	void UpdateFromAlertSource(struct AActor* Avatar, struct AActor* AlertSource); // Function Gobi.AnimContext_AlertToLocation.UpdateFromAlertSource // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_AmbushLocation
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_AmbushLocation : UAnimContext_Transform {
};

// Class Gobi.AnimContext_Angle
// Size: 0x80 (Inherited: 0x60)
struct UAnimContext_Angle : UAnimContext_Rotation {
	struct UAnimContext_Transform* AngleFrom; // 0x60(0x08)
	bool InvertAngleFrom; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UAnimContext_Transform* AngleTo; // 0x70(0x08)
	bool InvertAngleTo; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Gobi.AnimContext_Character
// Size: 0x150 (Inherited: 0x90)
struct UAnimContext_Character : UAnimContext_Actor {
	char pad_90[0x8]; // 0x90(0x08)
	struct FAIDataProviderFloatValue LocationOffsetX; // 0x98(0x38)
	struct FAIDataProviderFloatValue LocationOffsetY; // 0xd0(0x38)
	struct FAIDataProviderFloatValue LocationOffsetZ; // 0x108(0x38)
	char pad_140[0x10]; // 0x140(0x10)
};

// Class Gobi.AnimContext_Avatar
// Size: 0x150 (Inherited: 0x150)
struct UAnimContext_Avatar : UAnimContext_Character {
};

// Class Gobi.AnimContext_ChargeComponent
// Size: 0x58 (Inherited: 0x50)
struct UAnimContext_ChargeComponent : UAnimContext {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Gobi.AnimContext_Avatar_Charge
// Size: 0x58 (Inherited: 0x58)
struct UAnimContext_Avatar_Charge : UAnimContext_ChargeComponent {
};

// Class Gobi.AnimContext_LeapComponent
// Size: 0x58 (Inherited: 0x50)
struct UAnimContext_LeapComponent : UAnimContext {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Gobi.AnimContext_Avatar_Leap
// Size: 0x58 (Inherited: 0x58)
struct UAnimContext_Avatar_Leap : UAnimContext_LeapComponent {
};

// Class Gobi.AnimContext_Mutilation
// Size: 0x58 (Inherited: 0x50)
struct UAnimContext_Mutilation : UAnimContext {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Gobi.AnimContext_Avatar_Mutilation
// Size: 0x58 (Inherited: 0x58)
struct UAnimContext_Avatar_Mutilation : UAnimContext_Mutilation {
};

// Class Gobi.AnimContext_PounceComponent
// Size: 0x58 (Inherited: 0x50)
struct UAnimContext_PounceComponent : UAnimContext {
	char pad_50[0x8]; // 0x50(0x08)
};

// Class Gobi.AnimContext_Avatar_Pounce
// Size: 0x58 (Inherited: 0x58)
struct UAnimContext_Avatar_Pounce : UAnimContext_PounceComponent {
};

// Class Gobi.AnimContext_AvatarSceneComp
// Size: 0x98 (Inherited: 0x98)
struct UAnimContext_AvatarSceneComp : UAnimContext_ActorSceneComp {
};

// Class Gobi.AnimContext_AvatarSocket
// Size: 0x98 (Inherited: 0x98)
struct UAnimContext_AvatarSocket : UAnimContext_ActorSocket {
};

// Class Gobi.AnimContext_BotInteractTarget
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_BotInteractTarget : UAnimContext_Actor {
};

// Class Gobi.AnimContext_BotItemUseTarget
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_BotItemUseTarget : UAnimContext_Actor {
};

// Class Gobi.AnimContext_BotTarget
// Size: 0x160 (Inherited: 0x150)
struct UAnimContext_BotTarget : UAnimContext_Character {
	struct UAnimContext_Actor* TargetContext; // 0x150(0x08)
	char pad_158[0x8]; // 0x158(0x08)
};

// Class Gobi.AnimContext_ClingComponent
// Size: 0x58 (Inherited: 0x50)
struct UAnimContext_ClingComponent : UAnimContext {
	char pad_50[0x8]; // 0x50(0x08)

	void HandleTraitsApplied(struct AActor* Avatar); // Function Gobi.AnimContext_ClingComponent.HandleTraitsApplied // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_ClingGroundLocation
// Size: 0x78 (Inherited: 0x70)
struct UAnimContext_ClingGroundLocation : UAnimContext_Transform {
	char pad_70[0x8]; // 0x70(0x08)

	void HandleTraitsApplied(struct AActor* Avatar); // Function Gobi.AnimContext_ClingGroundLocation.HandleTraitsApplied // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_ClingLocation
// Size: 0x78 (Inherited: 0x70)
struct UAnimContext_ClingLocation : UAnimContext_Transform {
	char pad_70[0x8]; // 0x70(0x08)

	void HandleTraitsApplied(struct AActor* Avatar); // Function Gobi.AnimContext_ClingLocation.HandleTraitsApplied // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_ClingTarget
// Size: 0x78 (Inherited: 0x70)
struct UAnimContext_ClingTarget : UAnimContext_Transform {
	char pad_70[0x8]; // 0x70(0x08)

	void HandleTraitsApplied(struct AActor* Avatar); // Function Gobi.AnimContext_ClingTarget.HandleTraitsApplied // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_ClosestCharacter
// Size: 0x1a0 (Inherited: 0x150)
struct UAnimContext_ClosestCharacter : UAnimContext_Character {
	struct FGameplayTagQuery CharacterTags; // 0x150(0x48)
	int32_t MinCloseCharacters; // 0x198(0x04)
	float MaxCharacterDistance; // 0x19c(0x04)
};

// Class Gobi.AnimContext_DamageInfo
// Size: 0x130 (Inherited: 0x70)
struct UAnimContext_DamageInfo : UAnimContext_Transform {
	struct FDamageInfo DamageInfo; // 0x70(0xb8)
	bool bIgnoreZeroDamageInSameFrame; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
};

// Class Gobi.AnimContext_DamageSource
// Size: 0x78 (Inherited: 0x70)
struct UAnimContext_DamageSource : UAnimContext_Transform {
	struct UAnimContext_DamageInfo* DamageInfo; // 0x70(0x08)
};

// Class Gobi.AnimContext_Direction
// Size: 0x70 (Inherited: 0x60)
struct UAnimContext_Direction : UAnimContext_Rotation {
	struct UAnimContext_Transform* DirectionFrom; // 0x60(0x08)
	struct UAnimContext_Transform* DirectionTo; // 0x68(0x08)
};

// Class Gobi.AnimContext_Distance
// Size: 0x80 (Inherited: 0x50)
struct UAnimContext_Distance : UAnimContext {
	struct UAnimContext_Transform* DistFrom; // 0x50(0x08)
	struct UAnimContext_Transform* DistTo; // 0x58(0x08)
	bool bAccountForRadii; // 0x60(0x01)
	bool bAccountForNavLinkOffset; // 0x61(0x01)
	char pad_62[0x1e]; // 0x62(0x1e)
};

// Class Gobi.AnimContext_Enemy
// Size: 0x168 (Inherited: 0x150)
struct UAnimContext_Enemy : UAnimContext_Character {
	char pad_150[0x18]; // 0x150(0x18)
};

// Class Gobi.AnimContext_EnemySceneComp
// Size: 0x98 (Inherited: 0x98)
struct UAnimContext_EnemySceneComp : UAnimContext_ActorSceneComp {
};

// Class Gobi.AnimContext_EnemySocket
// Size: 0x98 (Inherited: 0x98)
struct UAnimContext_EnemySocket : UAnimContext_ActorSocket {
};

// Class Gobi.AnimContext_Facing
// Size: 0x70 (Inherited: 0x60)
struct UAnimContext_Facing : UAnimContext_Rotation {
	struct UAnimContext_Transform* Facing; // 0x60(0x08)
	struct UAnimContext_Transform* TargetPos; // 0x68(0x08)
};

// Class Gobi.AnimContext_GameplayTags
// Size: 0x80 (Inherited: 0x50)
struct UAnimContext_GameplayTags : UAnimContext {
	struct UAnimContext_Actor* Actor; // 0x50(0x08)
	char pad_58[0x28]; // 0x58(0x28)

	void RemoveGameplayTags(struct FGameplayTagContainer Tag); // Function Gobi.AnimContext_GameplayTags.RemoveGameplayTags // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_HitReactionInfo
// Size: 0x130 (Inherited: 0x130)
struct UAnimContext_HitReactionInfo : UAnimContext_DamageInfo {
};

// Class Gobi.AnimContext_HitResult
// Size: 0xf8 (Inherited: 0x70)
struct UAnimContext_HitResult : UAnimContext_Transform {
	char pad_70[0x88]; // 0x70(0x88)
};

// Class Gobi.AnimContext_LastVisibleLocation
// Size: 0x90 (Inherited: 0x70)
struct UAnimContext_LastVisibleLocation : UAnimContext_Transform {
	char pad_70[0x8]; // 0x70(0x08)
	struct UAnimContext_Trace* Trace; // 0x78(0x08)
	char pad_80[0x10]; // 0x80(0x10)
};

// Class Gobi.AnimContext_MantleTarget
// Size: 0x80 (Inherited: 0x70)
struct UAnimContext_MantleTarget : UAnimContext_Transform {
	char pad_70[0x8]; // 0x70(0x08)
	bool bUseMantleLedgePos; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Gobi.GameplayContext_MantleTraceResult
// Size: 0xd0 (Inherited: 0x50)
struct UGameplayContext_MantleTraceResult : UGameplayContext {
	char pad_50[0x80]; // 0x50(0x80)
};

// Class Gobi.GameplayContext_MantleRemainingHeight
// Size: 0x60 (Inherited: 0x50)
struct UGameplayContext_MantleRemainingHeight : UGameplayContext {
	char pad_50[0x10]; // 0x50(0x10)
};

// Class Gobi.AnimContext_MontageHistory
// Size: 0x60 (Inherited: 0x50)
struct UAnimContext_MontageHistory : UAnimContext {
	char pad_50[0x10]; // 0x50(0x10)
};

// Class Gobi.AnimContext_NavCast
// Size: 0x70 (Inherited: 0x50)
struct UAnimContext_NavCast : UAnimContext {
	struct UAnimContext_Actor* CastFrom; // 0x50(0x08)
	struct UAnimContext_Transform* CastTo; // 0x58(0x08)
	struct UNavigationQueryFilter* QueryFilter; // 0x60(0x08)
	char pad_68[0x8]; // 0x68(0x08)
};

// Class Gobi.AnimContext_NavLinkContextLoc
// Size: 0x80 (Inherited: 0x70)
struct UAnimContext_NavLinkContextLoc : UAnimContext_Transform {
	enum class ENavLinkContextLocations DesiredContextLocation; // 0x70(0x01)
	char pad_71[0xf]; // 0x71(0x0f)
};

// Class Gobi.AnimContext_NavLinkLocation
// Size: 0x90 (Inherited: 0x70)
struct UAnimContext_NavLinkLocation : UAnimContext_Transform {
	char pad_70[0x20]; // 0x70(0x20)
};

// Class Gobi.AnimContext_NavLinkEnd
// Size: 0x98 (Inherited: 0x90)
struct UAnimContext_NavLinkEnd : UAnimContext_NavLinkLocation {
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Gobi.AnimContext_NavLinkEndOnNav
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_NavLinkEndOnNav : UAnimContext_NavLinkLocation {
};

// Class Gobi.AnimContext_NavLinkProxyLocation
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_NavLinkProxyLocation : UAnimContext_Transform {
};

// Class Gobi.AnimContext_NavLinkSpawnEnd
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_NavLinkSpawnEnd : UAnimContext_NavLinkLocation {
};

// Class Gobi.AnimContext_NavLinkStart
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_NavLinkStart : UAnimContext_NavLinkLocation {
};

// Class Gobi.AnimContext_NavLinkStartOnNav
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_NavLinkStartOnNav : UAnimContext_NavLinkLocation {
};

// Class Gobi.AnimContext_NavPathCorner
// Size: 0x80 (Inherited: 0x70)
struct UAnimContext_NavPathCorner : UAnimContext_Transform {
	int32_t CornerIdx; // 0x70(0x04)
	char pad_74[0xc]; // 0x74(0x0c)
};

// Class Gobi.AnimContext_NavPathEnd
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_NavPathEnd : UAnimContext_Transform {
};

// Class Gobi.AnimContext_NavPathFlaggedNode
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_NavPathFlaggedNode : UAnimContext_NavLinkLocation {
};

// Class Gobi.AnimContext_NavPathNode
// Size: 0x98 (Inherited: 0x90)
struct UAnimContext_NavPathNode : UAnimContext_NavLinkLocation {
	int32_t NodeIndex; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Gobi.AnimContext_PathDestination
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_PathDestination : UAnimContext_Transform {
};

// Class Gobi.AnimContext_PawnProximity
// Size: 0xe8 (Inherited: 0x50)
struct UAnimContext_PawnProximity : UAnimContext {
	struct UAnimContext_Transform* QueryOrigin; // 0x50(0x08)
	struct UAnimContext_Transform* QueryBorder; // 0x58(0x08)
	float QueryRadius; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct AGobiCharacter* PawnFilterClass; // 0x68(0x08)
	struct FGameplayTagQuery TagQueryFilter; // 0x70(0x48)
	struct FGameplayTagContainer BlockingGameplayTags; // 0xb8(0x20)
	char pad_D8[0x10]; // 0xd8(0x10)
};

// Class Gobi.AnimContext_PounceDestination
// Size: 0x78 (Inherited: 0x70)
struct UAnimContext_PounceDestination : UAnimContext_Transform {
	struct UAnimContext_PounceComponent* Pounce; // 0x70(0x08)
};

// Class Gobi.AnimContext_PrevTransform
// Size: 0x98 (Inherited: 0x70)
struct UAnimContext_PrevTransform : UAnimContext_Transform {
	struct UAnimContext_Transform* Current; // 0x70(0x08)
	char pad_78[0x20]; // 0x78(0x20)
};

// Class Gobi.AnimContext_PseudoAlertLocation
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_PseudoAlertLocation : UAnimContext_Transform {
};

// Class Gobi.AnimContext_Random
// Size: 0xb8 (Inherited: 0x50)
struct UAnimContext_Random : UAnimContext {
	char pad_50[0x68]; // 0x50(0x68)
};

// Class Gobi.AnimContext_RandomOnce
// Size: 0xa0 (Inherited: 0x50)
struct UAnimContext_RandomOnce : UAnimContext {
	struct TMap<struct FName, float> RandomValues; // 0x50(0x50)
};

// Class Gobi.AnimContext_ReachInSmartActor
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_ReachInSmartActor : UAnimContext_Actor {
};

// Class Gobi.AnimContext_RetreatLocation
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_RetreatLocation : UAnimContext_Transform {
};

// Class Gobi.AnimContext_SmartActor
// Size: 0x90 (Inherited: 0x90)
struct UAnimContext_SmartActor : UAnimContext_Actor {
};

// Class Gobi.AnimContext_SqueezeTarget
// Size: 0x78 (Inherited: 0x70)
struct UAnimContext_SqueezeTarget : UAnimContext_Transform {
	char pad_70[0x8]; // 0x70(0x08)

	void OnSqueezeCandidateSet(); // Function Gobi.AnimContext_SqueezeTarget.OnSqueezeCandidateSet // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_Trace
// Size: 0x110 (Inherited: 0x50)
struct UAnimContext_Trace : UAnimContext {
	struct UAnimContext_Transform* TraceStart; // 0x50(0x08)
	struct UAnimContext_Transform* TraceEnd; // 0x58(0x08)
	float TraceStartForwardOffset; // 0x60(0x04)
	float TraceEndForwardOffset; // 0x64(0x04)
	enum class ECollisionChannel TraceChannel; // 0x68(0x01)
	bool bUseCustomTraceChannel; // 0x69(0x01)
	char pad_6A[0x2]; // 0x6a(0x02)
	struct FName CustomTraceChannel; // 0x6c(0x08)
	bool bTraceBothDirections; // 0x74(0x01)
	bool bDoSweep; // 0x75(0x01)
	char pad_76[0x2]; // 0x76(0x02)
	float Radius; // 0x78(0x04)
	float HalfHeight; // 0x7c(0x04)
	char pad_80[0x90]; // 0x80(0x90)
};

// Class Gobi.AnimContext_WallGrabLocation
// Size: 0x78 (Inherited: 0x70)
struct UAnimContext_WallGrabLocation : UAnimContext_Transform {
	char pad_70[0x8]; // 0x70(0x08)

	void HandleTraitsApplied(struct AActor* Avatar); // Function Gobi.AnimContext_WallGrabLocation.HandleTraitsApplied // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimContext_WanderLocation
// Size: 0x70 (Inherited: 0x70)
struct UAnimContext_WanderLocation : UAnimContext_Transform {
};

// Class Gobi.AnimContextLocatorComponent
// Size: 0x4f0 (Inherited: 0x4a0)
struct UAnimContextLocatorComponent : UPrimitiveComponent {
	char pad_4A0[0x8]; // 0x4a0(0x08)
	struct FGameplayTag LocatorTag; // 0x4a8(0x08)
	struct TArray<struct FTagLocator> Locators; // 0x4b0(0x10)
	float TraceDistance; // 0x4c0(0x04)
	float ScanDistance; // 0x4c4(0x04)
	bool bShowDetailDebug; // 0x4c8(0x01)
	bool bHasValidClimbData; // 0x4c9(0x01)
	char pad_4CA[0x26]; // 0x4ca(0x26)
};

// Class Gobi.AnimEvalSet_Climb
// Size: 0x240 (Inherited: 0xc0)
struct UAnimEvalSet_Climb : UAnimationEvalSet {
	struct FGameplayEval_IsNavLinkNext IsNavLinkNext; // 0xc0(0x48)
	struct FGameplayEval_IsAvatarFacing IsFacingNavLink; // 0x108(0x58)
	struct FAnimEval_MontageLength HowShortIsMontage; // 0x160(0x50)
	struct FAnimEval_Climb ClimbLinkEval; // 0x1b0(0x68)
	float MaxStartingDistance; // 0x218(0x04)
	float ClimbUp; // 0x21c(0x04)
	float TopDistance; // 0x220(0x04)
	float ClimbDown; // 0x224(0x04)
	struct TArray<struct UNavArea*> ClimbNavAreas; // 0x228(0x10)
	float MaxFacingAngle; // 0x238(0x04)
	bool bNeedsClearPathToLinkStart; // 0x23c(0x01)
	char pad_23D[0x3]; // 0x23d(0x03)
};

// Class Gobi.AnimEvalSet_ClimbLink
// Size: 0x218 (Inherited: 0xc0)
struct UAnimEvalSet_ClimbLink : UAnimationEvalSet {
	struct FGameplayEval_IsNavLinkNext IsNavLinkNext; // 0xc0(0x48)
	struct FGameplayEval_IsAvatarFacing IsFacingNavLink; // 0x108(0x58)
	struct FAnimEval_ClimbLink ClimbLinkEval; // 0x160(0x78)
	float MaxStartingDistance; // 0x1d8(0x04)
	float MinClimbUp; // 0x1dc(0x04)
	float MaxClimbUp; // 0x1e0(0x04)
	float MinTopDistance; // 0x1e4(0x04)
	float MaxTopDistance; // 0x1e8(0x04)
	float MinClimbDown; // 0x1ec(0x04)
	float MaxClimbDown; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct UNavArea*> ClimbNavAreas; // 0x1f8(0x10)
	float ClimbEvalWeight; // 0x208(0x04)
	float MaxFacingAngle; // 0x20c(0x04)
	bool bNeedsClearPathToLinkStart; // 0x210(0x01)
	char pad_211[0x7]; // 0x211(0x07)
};

// Class Gobi.AnimEvalSet_FilterNavLink
// Size: 0x140 (Inherited: 0xc0)
struct UAnimEvalSet_FilterNavLink : UAnimationEvalSet {
	struct TArray<struct UNavArea*> AllowedNavAreas; // 0xc0(0x10)
	struct FGameplayEval_NavArea AllowedNavAreaEval; // 0xd0(0x70)
};

// Class Gobi.AnimEvaluator
// Size: 0x50 (Inherited: 0x30)
struct UAnimEvaluator : UObject {
	bool bDrawDebug; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float Weight; // 0x34(0x04)
	enum class EEvalType EvalType; // 0x38(0x01)
	bool bInvertTest; // 0x39(0x01)
	char pad_3A[0x2]; // 0x3a(0x02)
	int32_t ID; // 0x3c(0x04)
	char pad_40[0x10]; // 0x40(0x10)
};

// Class Gobi.AnimEvaluator_HitBone
// Size: 0x60 (Inherited: 0x50)
struct UAnimEvaluator_HitBone : UAnimEvaluator {
	struct FName HitBoneBelow; // 0x50(0x08)
	struct UAnimContext_HitResult* Hit; // 0x58(0x08)
};

// Class Gobi.GobiAnimInstance
// Size: 0x3c0 (Inherited: 0x2c0)
struct UGobiAnimInstance : UAnimInstance {
	struct APawn* PawnOwner; // 0x2b8(0x08)
	struct UGobiCharacterMovementComponent* MovementComponent; // 0x2c0(0x08)
	struct FGobiAnimationData BaseData; // 0x2c8(0x14)
	struct FGobiAnimationState AnimationState; // 0x2dc(0x58)
	struct FGobiAnimationState LastAnimationState; // 0x334(0x58)
	bool bUseStartStopTransitions; // 0x38c(0x01)
	float SpeedInterpAlpha; // 0x390(0x04)
	bool bShowDebug; // 0x394(0x01)
	bool IsThirdPerson; // 0x395(0x01)
	char pad_39B[0x25]; // 0x39b(0x25)

	void DebugDrawHandler(struct UCanvas* Canvas, struct APlayerController* InPlayerController); // Function Gobi.GobiAnimInstance.DebugDrawHandler // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimInstance3P
// Size: 0x7b0 (Inherited: 0x3c0)
struct UAnimInstance3P : UGobiAnimInstance {
	struct FAnimLocomotionData LocomotionData; // 0x3b8(0x40)
	struct FAnimDirectionRange ForwardDirection; // 0x3f8(0x1c)
	struct FAnimDirectionRange RightDirection; // 0x414(0x1c)
	struct FAnimDirectionRange LeftDirection; // 0x430(0x1c)
	struct FAnimDirectionRange BackwardDirection; // 0x44c(0x1c)
	struct FLocoTurnInPlace TurnInPlaceState; // 0x468(0xb0)
	struct FLocomotionPrediction LocoPredict; // 0x518(0x68)
	struct FLocoLeaning Leaning; // 0x580(0x0c)
	float DirectionInterpAlpha; // 0x58c(0x04)
	float DirectionChangingSpeedThreshold; // 0x590(0x04)
	struct FLookAtInfo LookAtInfo; // 0x594(0x34)
	struct FAimRotationInfo AimRotationInfo; // 0x5c8(0x0c)
	struct FLadderAnimState LadderAnimState; // 0x5d4(0x08)
	struct FGobiFootPlanting FootPlanting; // 0x5e0(0x168)
	struct FGobiAnimationCurveData IkAlphaCurve; // 0x748(0x10)
	struct FGobiAnimationCurveData FootPlantingAlphaCurve; // 0x758(0x10)
	struct FGobiAnimationCurveData DisableAimOffsetCurve; // 0x768(0x10)
	float LegIKAlpha; // 0x778(0x04)
	float FootPlantingAlpha; // 0x77c(0x04)
	struct FGobiSlopeWarping SlopeWarping; // 0x780(0x14)
	float AimOffsetAlpha; // 0x794(0x04)
	struct FAnimState3P AnimState3P; // 0x798(0x08)
	char pad_7A4[0xc]; // 0x7a4(0x0c)

	void OnLeftTurnInPlaceState(); // Function Gobi.AnimInstance3P.OnLeftTurnInPlaceState // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AnimInstanceFP
// Size: 0x3c0 (Inherited: 0x3c0)
struct UAnimInstanceFP : UGobiAnimInstance {
};

// Class Gobi.AnimMetaData_AnimEvaluatorSet
// Size: 0x40 (Inherited: 0x30)
struct UAnimMetaData_AnimEvaluatorSet : UAnimMetaData {
	struct UAnimationEvalSet* AnimEvaluatorSet; // 0x30(0x08)
	enum class EPawnControllerType PawnControllerType; // 0x38(0x01)
	bool bDrawDebug; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Gobi.AnimMetaData_MontageLink
// Size: 0x38 (Inherited: 0x30)
struct UAnimMetaData_MontageLink : UAnimMetaData {
	struct UAnimMontage* LinkedMontage; // 0x30(0x08)
};

// Class Gobi.AnimMetaData_MontageSync
// Size: 0x50 (Inherited: 0x30)
struct UAnimMetaData_MontageSync : UAnimMetaData {
	struct UAnimMontage* Montage; // 0x30(0x08)
	struct UGameplayContext_ActorComponent* SyncTargetContext; // 0x38(0x08)
	bool bSyncStops; // 0x40(0x01)
	char pad_41[0xf]; // 0x41(0x0f)
};

// Class Gobi.AnimNotify_AOEEmitter
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_AOEEmitter : UAnimNotify {
	struct FGameplayTag AOEEmitterTag; // 0x40(0x08)
};

// Class Gobi.AnimNotify_ApplyGameplayEffect
// Size: 0x78 (Inherited: 0x40)
struct UAnimNotify_ApplyGameplayEffect : UAnimNotify {
	bool bUnconditional; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float Distance; // 0x44(0x04)
	struct FName BoneName; // 0x48(0x08)
	struct FCollisionProfileName OverlapCollisionProfile; // 0x50(0x08)
	bool bRequiresLineOfSight; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	struct FName LineOfSightTargetComponentTag; // 0x5c(0x08)
	bool bUseTargetEyePosForLoS; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct UGameplayEffect*> GameplayEffects; // 0x68(0x10)
};

// Class Gobi.AnimNotify_BeginPhysicalDeath
// Size: 0x40 (Inherited: 0x40)
struct UAnimNotify_BeginPhysicalDeath : UAnimNotify {
};

// Class Gobi.AnimNotify_BlendOut
// Size: 0x40 (Inherited: 0x40)
struct UAnimNotify_BlendOut : UAnimNotify {
};

// Class Gobi.AnimNotify_CameraShake
// Size: 0xc0 (Inherited: 0x40)
struct UAnimNotify_CameraShake : UAnimNotify {
	float InnerRadius; // 0x40(0x04)
	float OuterRadius; // 0x44(0x04)
	struct FVector EpicenterOffset; // 0x48(0x0c)
	bool bUseBoneLocationAsEpicenter; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	struct FName EpicenterBone; // 0x58(0x08)
	float Falloff; // 0x60(0x04)
	bool bOrientShakeTowardsEpicenter; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct UCameraShake* Shake; // 0x68(0x08)
	struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x70(0x08)
	struct FGameplayTagQuery TagQueryRequirment; // 0x78(0x48)
};

// Class Gobi.AnimNotify_ChangeAttachMovement
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_ChangeAttachMovement : UAnimNotify {
	bool bNewMoveToAttachLocation; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Gobi.AnimNotify_Corpse
// Size: 0x40 (Inherited: 0x40)
struct UAnimNotify_Corpse : UAnimNotify {
};

// Class Gobi.AnimNotify_EmissiveScaling
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_EmissiveScaling : UAnimNotify {
	float EmissiveValue; // 0x40(0x04)
	float TimeToScale; // 0x44(0x04)
};

// Class Gobi.AnimNotify_EvalBranch
// Size: 0x50 (Inherited: 0x40)
struct UAnimNotify_EvalBranch : UAnimNotify {
	struct TArray<struct FEvalBranchData> BranchData; // 0x40(0x10)
};

// Class Gobi.AnimNotify_EvalBranchWithOffset
// Size: 0x58 (Inherited: 0x50)
struct UAnimNotify_EvalBranchWithOffset : UAnimNotify_EvalBranch {
	bool bInvertOffset; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Gobi.AnimNotify_Explode
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_Explode : UAnimNotify {
	struct FGameplayTag ExplosionComponentTag; // 0x40(0x08)
};

// Class Gobi.AnimNotify_FocusTrackingRefPose
// Size: 0xa8 (Inherited: 0x40)
struct UAnimNotify_FocusTrackingRefPose : UAnimNotify {
	struct FFocusTrackingRefPose RefPoseData; // 0x40(0x60)
	struct FName SlotName; // 0xa0(0x08)
};

// Class Gobi.AnimNotify_GameplayCue
// Size: 0x68 (Inherited: 0x40)
struct UAnimNotify_GameplayCue : UAnimNotify {
	struct UAnimContext_Actor* Instigator; // 0x40(0x08)
	struct UAnimContext_Actor* SourceActor; // 0x48(0x08)
	struct UAnimContext_Actor* TargetActor; // 0x50(0x08)
	struct FName BoneName; // 0x58(0x08)
	struct FGameplayTag Cue; // 0x60(0x08)
};

// Class Gobi.AnimNotify_GobiMusicEvent
// Size: 0x60 (Inherited: 0x40)
struct UAnimNotify_GobiMusicEvent : UAnimNotify {
	struct FDataTableRowHandle EventHandle; // 0x40(0x20)
};

// Class Gobi.AnimNotify_HideActor
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_HideActor : UAnimNotify {
	bool bHidden; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Gobi.AnimNotify_MotionCorrectionGoal
// Size: 0xd8 (Inherited: 0x40)
struct UAnimNotify_MotionCorrectionGoal : UAnimNotify {
	bool bDrawDebug; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FMotionCorrectionGoal CorrectionGoal; // 0x48(0x90)
};

// Class Gobi.AnimNotify_Mutilate
// Size: 0x60 (Inherited: 0x40)
struct UAnimNotify_Mutilate : UAnimNotify {
	bool bExplode; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float PctToDismember; // 0x44(0x04)
	float DismemberImpulseMagnitude; // 0x48(0x04)
	float ImpulseMagnitude; // 0x4c(0x04)
	enum class EMutilationRegion Region; // 0x50(0x01)
	enum class EMutilationType Type; // 0x51(0x01)
	char pad_52[0x6]; // 0x52(0x06)
	struct UAnimContext_DamageInfo* DamageInfo; // 0x58(0x08)
};

// Class Gobi.AnimNotify_Navigation
// Size: 0x50 (Inherited: 0x40)
struct UAnimNotify_Navigation : UAnimNotify {
	struct UNavArea* NavModifierAreaClass; // 0x40(0x08)
	struct UNavArea* NavLinkAreaClass; // 0x48(0x08)
};

// Class Gobi.AnimNotify_ParticleCollider
// Size: 0xe0 (Inherited: 0x40)
struct UAnimNotify_ParticleCollider : UAnimNotify {
	struct FTransform Offset; // 0x40(0x30)
	struct FName BoneName; // 0x70(0x08)
	struct FImpactEmitterDefinition EmitterDef; // 0x78(0x68)
};

// Class Gobi.AnimNotify_PauseResumeAI
// Size: 0x58 (Inherited: 0x40)
struct UAnimNotify_PauseResumeAI : UAnimNotify {
	enum class EAIPauseResume Mode; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FString Reason; // 0x48(0x10)
};

// Class Gobi.AnimNotify_PlayerSound
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_PlayerSound : UAnimNotify {
	struct UAkAudioEvent* PlayerSoundEvent; // 0x40(0x08)
};

// Class Gobi.AnimNotify_PlayFPParticleEffect
// Size: 0x90 (Inherited: 0x90)
struct UAnimNotify_PlayFPParticleEffect : UAnimNotify_PlayParticleEffect {
};

// Class Gobi.AnimNotify_Ragdoll
// Size: 0x50 (Inherited: 0x40)
struct UAnimNotify_Ragdoll : UAnimNotify {
	struct FName BoneName; // 0x40(0x08)
	struct FName CollisionProfileToSet; // 0x48(0x08)
};

// Class Gobi.AnimNotify_RattleTrigger
// Size: 0x50 (Inherited: 0x40)
struct UAnimNotify_RattleTrigger : UAnimNotify {
	struct FName Bone; // 0x40(0x08)
	float Radius; // 0x48(0x04)
	float SpeedModifier; // 0x4c(0x04)
};

// Class Gobi.AnimNotify_ReachIn
// Size: 0x40 (Inherited: 0x40)
struct UAnimNotify_ReachIn : UAnimNotify {
};

// Class Gobi.AnimNotify_SetAttackLocation
// Size: 0x40 (Inherited: 0x40)
struct UAnimNotify_SetAttackLocation : UAnimNotify {
};

// Class Gobi.AnimNotify_SetChargeDistance
// Size: 0x50 (Inherited: 0x40)
struct UAnimNotify_SetChargeDistance : UAnimNotify {
	struct UAnimContext_ChargeComponent* Charge; // 0x40(0x08)
	struct UAnimContext_Transform* TargetLocation; // 0x48(0x08)
};

// Class Gobi.AnimNotify_SetLeapDestination
// Size: 0x50 (Inherited: 0x40)
struct UAnimNotify_SetLeapDestination : UAnimNotify {
	struct UAnimContext_LeapComponent* Leap; // 0x40(0x08)
	struct UAnimContext_Transform* Destination; // 0x48(0x08)
};

// Class Gobi.AnimNotify_SetPhysicalBlend
// Size: 0x58 (Inherited: 0x40)
struct UAnimNotify_SetPhysicalBlend : UAnimNotify {
	struct FName BoneName; // 0x40(0x08)
	struct FName CollisionProfileName; // 0x48(0x08)
	float PhysicsBlendWeight; // 0x50(0x04)
	bool bSkipCustomPhysicsType; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
};

// Class Gobi.AnimNotify_SharedSoundBase
// Size: 0x50 (Inherited: 0x40)
struct UAnimNotify_SharedSoundBase : UAnimNotify {
	struct FName Bone; // 0x40(0x08)
	struct USoundCollectionAssetAnimPreview* DemoSoundAsset; // 0x48(0x08)
};

// Class Gobi.AnimNotify_SharedSoundHuman
// Size: 0x58 (Inherited: 0x50)
struct UAnimNotify_SharedSoundHuman : UAnimNotify_SharedSoundBase {
	enum class ESharedSurvivorAnimSound HumanSound; // 0x50(0x01)
	bool PlayIfLocal; // 0x51(0x01)
	bool PlayIfRemote; // 0x52(0x01)
	char pad_53[0x5]; // 0x53(0x05)
};

// Class Gobi.AnimNotify_SharedSoundEnemy
// Size: 0x60 (Inherited: 0x50)
struct UAnimNotify_SharedSoundEnemy : UAnimNotify_SharedSoundBase {
	enum class ESharedEnemyAnimSound EnemySound; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	float ChanceToPlayIfLocal; // 0x54(0x04)
	float ChanceToPlayIfRemote; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class Gobi.AnimNotify_SpawnDecal
// Size: 0x68 (Inherited: 0x40)
struct UAnimNotify_SpawnDecal : UAnimNotify {
	struct UAnimContext_Rotation* TraceDirectionContext; // 0x40(0x08)
	enum class ECollisionChannel TraceChannel; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float TraceLength; // 0x4c(0x04)
	struct FName TraceStartPosBoneName; // 0x50(0x08)
	float ImpactDirectionAngle; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct UDecalDefinition* DecalDefinitionAsset; // 0x60(0x08)
};

// Class Gobi.AnimNotify_SpawnImpactEffect
// Size: 0x90 (Inherited: 0x40)
struct UAnimNotify_SpawnImpactEffect : UAnimNotify {
	bool bUseRotationContext; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct UAnimContext_Rotation* TraceDirectionContext; // 0x48(0x08)
	enum class EAnimNotifySpawnImpactTraceDirection TraceDirection; // 0x50(0x01)
	enum class ECollisionChannel TraceChannel; // 0x51(0x01)
	char pad_52[0x2]; // 0x52(0x02)
	float TraceLength; // 0x54(0x04)
	struct FName TraceStartPosBoneName; // 0x58(0x08)
	enum class EAnimNotifySpawnImpactDirectionOverride DirectionOverride; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float DirectionOverrideYawOffset; // 0x64(0x04)
	struct UImpactEffectConfig* ImpactEffectConfig; // 0x68(0x08)
	struct FGameplayTagContainer BlockingTags; // 0x70(0x20)
};

// Class Gobi.AnimNotify_SpawnThrowProjectileBase
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_SpawnThrowProjectileBase : UAnimNotify {
	struct UProjectileThrowComponent* ProjectileThrowClass; // 0x40(0x08)
};

// Class Gobi.AnimNotify_StartTitanTailThrashRockFall
// Size: 0x40 (Inherited: 0x40)
struct UAnimNotify_StartTitanTailThrashRockFall : UAnimNotify {
};

// Class Gobi.AnimNotify_Teleport
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_Teleport : UAnimNotify {
	struct UAnimContext_Transform* Destination; // 0x40(0x08)
};

// Class Gobi.AnimNotify_ThrowProjectileBase
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_ThrowProjectileBase : UAnimNotify {
	struct UProjectileThrowComponent* ProjectileThrowClass; // 0x40(0x08)
};

// Class Gobi.AnimNotify_TRSEvent
// Size: 0x48 (Inherited: 0x40)
struct UAnimNotify_TRSEvent : UAnimNotify {
	struct FName EventName; // 0x40(0x08)
};

// Class Gobi.AnimNotify_WeaponSharedSound
// Size: 0x58 (Inherited: 0x40)
struct UAnimNotify_WeaponSharedSound : UAnimNotify {
	struct UAkAudioEvent* PreviewAudio; // 0x40(0x08)
	struct FName BoneName; // 0x48(0x08)
	enum class ESharedWeaponAnimSound SoundLookup; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Gobi.AnimNotifyState_ApplyGameplayEffects
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotifyState_ApplyGameplayEffects : UAnimNotifyState {
	struct TArray<struct UGameplayEffect*> GameplayEffects; // 0x38(0x10)
};

// Class Gobi.AnimNotifyState_AttackWindow
// Size: 0x60 (Inherited: 0x38)
struct UAnimNotifyState_AttackWindow : UAnimNotifyState {
	struct FGameplayTag AttackVolumeTag; // 0x38(0x08)
	struct TArray<struct UGameplayEffect*> AttackGameplayEffects; // 0x40(0x10)
	bool bResetOverlaps; // 0x50(0x01)
	bool bUpdateOverlaps; // 0x51(0x01)
	bool bOverrideAttackVolumeCollision; // 0x52(0x01)
	char pad_53[0x1]; // 0x53(0x01)
	struct FCollisionProfileName AttackVolumeCollisionProfile; // 0x54(0x08)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class Gobi.AnimNotifyState_ClampInputRotationRate
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotifyState_ClampInputRotationRate : UAnimNotifyState {
	struct FName Label; // 0x38(0x08)
	enum class EClampInputRotationType Type; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FVector2D Rate; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Gobi.AnimNotifyState_ContextTickable
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotifyState_ContextTickable : UAnimNotifyState {
	struct UGameplayContext* Context; // 0x38(0x08)
};

// Class Gobi.AnimNotifyState_EvalChainMontage
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotifyState_EvalChainMontage : UAnimNotifyState {
	struct TArray<struct FEvalChain> EvalChains; // 0x38(0x10)
};

// Class Gobi.AnimNotifyState_ModifyView
// Size: 0xb8 (Inherited: 0x38)
struct UAnimNotifyState_ModifyView : UAnimNotifyState {
	struct FCameraViewModifier ViewModifier; // 0x38(0x38)
	struct FGameplayTagQuery RequiredTags; // 0x70(0x48)
};

// Class Gobi.AnimNotifyState_MotionCorrection
// Size: 0xd8 (Inherited: 0x38)
struct UAnimNotifyState_MotionCorrection : UAnimNotifyState {
	bool bDrawDebug; // 0x38(0x01)
	bool bIsLinkedToGoal; // 0x39(0x01)
	char pad_3A[0x2]; // 0x3a(0x02)
	struct FName LinkedGoal; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
	struct FMotionCorrectionGoal CorrectionGoal; // 0x48(0x90)
};

// Class Gobi.AnimNotifyState_ParticleColliderTimed
// Size: 0x108 (Inherited: 0xb8)
struct UAnimNotifyState_ParticleColliderTimed : UAnimNotifyState_TimedParticleEffect {
	struct TMap<struct FName, struct UImpactEffectConfig*> Events; // 0xb8(0x50)
};

// Class Gobi.AnimNotifyState_ProjectileSpray
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyState_ProjectileSpray : UAnimNotifyState {
};

// Class Gobi.AnimNotifyState_RepickMontage
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotifyState_RepickMontage : UAnimNotifyState {
	bool bAllowRepickOfSelf; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Gobi.AnimNotifyState_SetBoneVis
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotifyState_SetBoneVis : UAnimNotifyState {
	struct TArray<struct FAnimNotify_BoneVisDef> BoneVisibilityChanges; // 0x38(0x10)
};

// Class Gobi.AnimNotifyState_SetTags
// Size: 0x70 (Inherited: 0x38)
struct UAnimNotifyState_SetTags : UAnimNotifyState {
	struct FGameplayTagContainer Tags; // 0x38(0x20)
	bool bApplyToAnimatingActor; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct UAnimContext_Actor* Actor; // 0x60(0x08)
	struct UAnimContext_GameplayTags* ActorTags; // 0x68(0x08)
};

// Class Gobi.AnimNotifyState_ThrowProjectile
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotifyState_ThrowProjectile : UAnimNotifyState {
	struct UProjectileThrowComponent* ProjectileThrowClass; // 0x38(0x08)
};

// Class Gobi.AnimNotifyState_TitanStage3TailThrashModeDisable
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotifyState_TitanStage3TailThrashModeDisable : UAnimNotifyState {
	enum class ETitanStage3TailThrashMode ThrashMode; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Gobi.AnimNotifyState_TraversalFlyMode
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyState_TraversalFlyMode : UAnimNotifyState {
};

// Class Gobi.AnimUtils
// Size: 0x30 (Inherited: 0x30)
struct UAnimUtils : UBlueprintFunctionLibrary {

	void StopSyncedMontages(struct UAnimInstance* LeaderAnimInstance, struct UAnimMontage* Montage); // Function Gobi.AnimUtils.StopSyncedMontages // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AOEAttackComponent
// Size: 0x3f8 (Inherited: 0x1c8)
struct UAOEAttackComponent : UAbilityComponent {
	char pad_1C8[0x8]; // 0x1c8(0x08)
	struct FMulticastInlineDelegate OnStartAttack; // 0x1d0(0x10)
	struct FMulticastInlineDelegate OnStopAttack; // 0x1e0(0x10)
	char pad_1F0[0xa8]; // 0x1f0(0xa8)
	struct TArray<struct UAnimMontage*> AttackMontages; // 0x298(0x10)
	struct TArray<struct UAnimMontage*> AttackEndMontages; // 0x2a8(0x10)
	struct FName AOEMontageNotifyName; // 0x2b8(0x08)
	struct FName ReattackMontageNotifyName; // 0x2c0(0x08)
	struct FName AttackMontagesName; // 0x2c8(0x08)
	struct FGameplayTagContainer AppliedTags; // 0x2d0(0x20)
	struct FGameplayTagContainer BlockingTags; // 0x2f0(0x20)
	struct FGameplayTagQuery CancelTagsQuery; // 0x310(0x48)
	struct FGameplayTagQuery ShowReticleTagsQuery; // 0x358(0x48)
	bool bReactivateIfInputHeld; // 0x3a0(0x01)
	bool bUsesPrimaryButton; // 0x3a1(0x01)
	char pad_3A2[0x2]; // 0x3a2(0x02)
	float ServerVolumePadding; // 0x3a4(0x04)
	struct TArray<struct UGameplayEffect*> ApplyEffectsToSelf; // 0x3a8(0x10)
	struct TArray<struct UGameplayEffect*> AOEEffects; // 0x3b8(0x10)
	struct AGobiReticle* AOEReticleClass; // 0x3c8(0x08)
	struct AGobiReticle* AOEReticleActiveClass; // 0x3d0(0x08)
	bool bUsesTuningData; // 0x3d8(0x01)
	char pad_3D9[0x3]; // 0x3d9(0x03)
	struct FAOEAttackTuning AOEAttackTuning; // 0x3dc(0x18)
	char pad_3F4[0x4]; // 0x3f4(0x04)

	void OnStopAOEAttack__DelegateSignature(struct UAOEAttackComponent* AOEAttackComponent); // DelegateFunction Gobi.AOEAttackComponent.OnStopAOEAttack__DelegateSignature // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ApplyDamageDealtEffectsMod
// Size: 0x398 (Inherited: 0x88)
struct UApplyDamageDealtEffectsMod : UGameplayMod {
	enum class EApplyDamageEffectModType ApplicationMethod; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct FDamageDealtTriggeredEffectConfig DamageDealtTriggerConfig; // 0x90(0x108)
	struct FCharacterEmitterDef DamageSourceEmitterDef; // 0x198(0x100)
	struct FCharacterEmitterDef DamageTargetEmitterDef; // 0x298(0x100)
};

// Class Gobi.ApplyEffectItemTraceComponent
// Size: 0x4f0 (Inherited: 0x4e0)
struct UApplyEffectItemTraceComponent : UApplyEffectItemComponent {
	float TraceDistance; // 0x4e0(0x04)
	bool bTargetCharactersOnly; // 0x4e4(0x01)
	enum class ECollisionChannel TraceChannel; // 0x4e5(0x01)
	char pad_4E6[0x2]; // 0x4e6(0x02)
	struct UObject* RequiredClassType; // 0x4e8(0x08)
};

// Class Gobi.ApplyEffectItemGrapplerComponent
// Size: 0x500 (Inherited: 0x4f0)
struct UApplyEffectItemGrapplerComponent : UApplyEffectItemTraceComponent {
	char pad_4F0[0x8]; // 0x4f0(0x08)
	bool bUseTraceIfNoGrappler; // 0x4f8(0x01)
	char pad_4F9[0x7]; // 0x4f9(0x07)
};

// Class Gobi.ApplyEffectItemIncapablePlayerComponent
// Size: 0x4e0 (Inherited: 0x4e0)
struct UApplyEffectItemIncapablePlayerComponent : UApplyEffectItemComponent {
};

// Class Gobi.ApplyGameModeTagMod
// Size: 0xa8 (Inherited: 0x88)
struct UApplyGameModeTagMod : UGameplayMod {
	struct FGameplayTagContainer TagsToApply; // 0x88(0x20)
};

// Class Gobi.ApplyGameplayEffectMod
// Size: 0xe0 (Inherited: 0x88)
struct UApplyGameplayEffectMod : UGameplayMod {
	char pad_88[0x18]; // 0x88(0x18)
	float ChanceToApplyEffects; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FGameplayTagContainer TagsToApply; // 0xa8(0x20)
	struct TArray<struct UGameplayEffect*> GameplayEffectsToApply; // 0xc8(0x10)
	enum class EGameplayCardAffinity LinkedAffinity; // 0xd8(0x01)
	char pad_D9[0x3]; // 0xd9(0x03)
	int32_t RandomSeed; // 0xdc(0x04)
};

// Class Gobi.ApplyOnItemAppliedMod
// Size: 0x1d8 (Inherited: 0x88)
struct UApplyOnItemAppliedMod : UGameplayMod {
	enum class EApplyOnItemAppliedTargeting ActivateWhenAppliedTo; // 0x88(0x01)
	enum class EApplyOnItemAppliedTargeting ApplyEmitterDefTo; // 0x89(0x01)
	char pad_8A[0x6]; // 0x8a(0x06)
	struct FGameplayTagQuery ItemTagQuery; // 0x90(0x48)
	struct FCharacterEmitterDef CharacterEmitterDef; // 0xd8(0x100)

	void OnSelectedItemChanged(struct AItem* OldItem, struct AItem* NewItem); // Function Gobi.ApplyOnItemAppliedMod.OnSelectedItemChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ApplyOnItemSelectedMod
// Size: 0x1d0 (Inherited: 0x88)
struct UApplyOnItemSelectedMod : UGameplayMod {
	struct FGameplayTagQuery ItemTagQuery; // 0x88(0x48)
	struct FCharacterEmitterDef CharacterEmitterDef; // 0xd0(0x100)

	void OnSelectedItemChanged(struct AItem* OldItem, struct AItem* NewItem); // Function Gobi.ApplyOnItemSelectedMod.OnSelectedItemChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ApplyOnItemThrownMod
// Size: 0x1d0 (Inherited: 0x88)
struct UApplyOnItemThrownMod : UGameplayMod {
	struct FGameplayTagQuery ItemTagQuery; // 0x88(0x48)
	struct FCharacterEmitterDef CharacterEmitterDef; // 0xd0(0x100)

	void OnSelectedItemChanged(struct AItem* OldItem, struct AItem* NewItem); // Function Gobi.ApplyOnItemThrownMod.OnSelectedItemChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ApplyOnTagMod
// Size: 0x1e0 (Inherited: 0x88)
struct UApplyOnTagMod : UGameplayMod {
	char pad_88[0x10]; // 0x88(0x10)
	struct FGameplayTagQuery CharacterTagQuery; // 0x98(0x48)
	struct FCharacterEmitterDef CharacterEmitterDef; // 0xe0(0x100)
};

// Class Gobi.ApplyTagMod
// Size: 0xa8 (Inherited: 0x88)
struct UApplyTagMod : UGameplayMod {
	struct FGameplayTagContainer TagsToApply; // 0x88(0x20)
};

// Class Gobi.ArmorComponent
// Size: 0x260 (Inherited: 0xd8)
struct UArmorComponent : UActorComponent {
	struct FMulticastInlineDelegate OnArmorDamage; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnArmorHealthChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnDestroyedArmor; // 0xf8(0x10)
	struct TArray<struct FArmor> InitialArmor; // 0x108(0x10)
	struct UArmorSet* InitialArmorSet; // 0x118(0x08)
	float DestroyedImpactScale; // 0x120(0x04)
	char pad_124[0x64]; // 0x124(0x64)
	struct FDamageInfo LastDamageInfo; // 0x188(0xb8)
	struct TArray<struct FArmorHealth> ArmorHealth; // 0x240(0x10)
	struct TArray<struct FArmorDestroyed> ArmorDestroyed; // 0x250(0x10)

	void OnRep_LastDamageInfo(); // Function Gobi.ArmorComponent.OnRep_LastDamageInfo // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ArmorSet
// Size: 0x48 (Inherited: 0x38)
struct UArmorSet : UDataAsset {
	struct TArray<struct FArmor> Armor; // 0x38(0x10)
};

// Class Gobi.Trait
// Size: 0x30 (Inherited: 0x30)
struct UTrait : UObject {
};

// Class Gobi.ArmorTrait
// Size: 0x120 (Inherited: 0x30)
struct UArmorTrait : UTrait {
	struct FArmor Armor; // 0x30(0xf0)
};

// Class Gobi.ArmoryScreen
// Size: 0x5c8 (Inherited: 0x560)
struct UArmoryScreen : UHubChildScreen {
	char pad_560[0x68]; // 0x560(0x68)

	void OnWeaponFocused(struct UUserWidget* Widget); // Function Gobi.ArmoryScreen.OnWeaponFocused // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AssetLoader
// Size: 0x258 (Inherited: 0x250)
struct AAssetLoader : AActor {
	struct UAssetLoaderComponent* AssetLoaderComponent; // 0x250(0x08)
};

// Class Gobi.AssetLoaderComponent
// Size: 0xe8 (Inherited: 0xd8)
struct UAssetLoaderComponent : UActorComponent {
	struct TArray<struct UAssetTable*> AssetLists; // 0xd8(0x10)
};

// Class Gobi.AsyncAssetSet
// Size: 0xa0 (Inherited: 0x30)
struct UAsyncAssetSet : UObject {
	char pad_30[0x60]; // 0x30(0x60)
	struct TArray<struct UObject*> LoadedObjects; // 0x90(0x10)
};

// Class Gobi.AttachableComponent
// Size: 0x1c8 (Inherited: 0x120)
struct UAttachableComponent : UMovementTickableComponent {
	struct FAttachToActorInfo AttachedToInfo; // 0x120(0x68)
	bool bAttachToActorDestroyed; // 0x188(0x01)
	char pad_189[0x3]; // 0x189(0x03)
	struct FCollisionProfileName AttachedCollisionProfile; // 0x18c(0x08)
	char pad_194[0x34]; // 0x194(0x34)

	void OnRep_AttachedToInfo(); // Function Gobi.AttachableComponent.OnRep_AttachedToInfo // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AttachableTrait
// Size: 0x90 (Inherited: 0x30)
struct UAttachableTrait : UTrait {
	enum class EAttachmentRule AttachmentRule; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FName SocketName; // 0x34(0x08)
	struct FName ParentCompTag; // 0x3c(0x08)
	char pad_44[0xc]; // 0x44(0x0c)
	struct FTransform AttachmentTransform; // 0x50(0x30)
	bool bInWeldSimulatedBodies; // 0x80(0x01)
	enum class EDetachmentRule DetachmentRule; // 0x81(0x01)
	char pad_82[0xe]; // 0x82(0x0e)
};

// Class Gobi.AttachmentComparisonIconUserWidget
// Size: 0x458 (Inherited: 0x450)
struct UAttachmentComparisonIconUserWidget : UGobiUserWidget {
	char pad_450[0x8]; // 0x450(0x08)

	void SetComparison(enum class EItemComparison InComparison); // Function Gobi.AttachmentComparisonIconUserWidget.SetComparison // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AttachmentDefinitionComponent
// Size: 0xe8 (Inherited: 0xd8)
struct UAttachmentDefinitionComponent : UActorComponent {
	struct FAttachmentDefinition AttachmentDefinition; // 0xd8(0x10)
};

// Class Gobi.AudioAreaTrigger
// Size: 0x2f8 (Inherited: 0x250)
struct AAudioAreaTrigger : AActor {
	struct USceneComponent* InternalRootComponent; // 0x250(0x08)
	struct TArray<struct UAkAudioBank*> AudioBanks; // 0x258(0x10)
	char pad_268[0x8]; // 0x268(0x08)
	struct TArray<struct FMultiPositioningInfo> OneAkEventMultipleTargetPoints; // 0x270(0x10)
	struct TArray<struct FMultiAudioEventInfo> OneTargetPointMultipleAkEvents; // 0x280(0x10)
	struct TArray<struct UAkAudioEvent*> DirectAudioAllEnter; // 0x290(0x10)
	struct TArray<struct UAkAudioEvent*> DirectAudioAllExit; // 0x2a0(0x10)
	struct TArray<struct UAkAudioEvent*> DirectAudioLocalEnter; // 0x2b0(0x10)
	struct TArray<struct UAkAudioEvent*> DirectAudioLocalExit; // 0x2c0(0x10)
	bool bDebug; // 0x2d0(0x01)
	char pad_2D1[0x27]; // 0x2d1(0x27)

	void OnUnpossessed(struct AGobiCharacter* GobiCharacter); // Function Gobi.AudioAreaTrigger.OnUnpossessed // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioBlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UAudioBlueprintFunctionLibrary : UBlueprintFunctionLibrary {

	void UnregisterActiveMusicScenario(struct UObject* WorldContextObject, struct FName ScenarioName); // Function Gobi.AudioBlueprintFunctionLibrary.UnregisterActiveMusicScenario // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioController
// Size: 0x2f0 (Inherited: 0x250)
struct AAudioController : AActor {
	struct TArray<struct UAkAudioBank*> SharedBanks; // 0x250(0x10)
	struct TArray<struct UAkAudioBank*> MapSpecificBanks; // 0x260(0x10)
	struct UAkAudioBank* PVPBank; // 0x270(0x08)
	struct UAkSimpleComponent* AkSimpleComp; // 0x278(0x08)
	struct UAudioStateComponent* AudioStateMonitor; // 0x280(0x08)
	struct UCardListenerComponent* ModListener; // 0x288(0x08)
	struct UAkAudioEvent* DemoPausedSound; // 0x290(0x08)
	struct UAkAudioEvent* DemoUnpausedSound; // 0x298(0x08)
	struct FName MapMusicIdentifier; // 0x2a0(0x08)
	struct FDataTableRowHandle SafeRoomMusicRow; // 0x2a8(0x20)
	struct UAkAudioBank* AtmosphereBank; // 0x2c8(0x08)
	struct UAkAudioEvent* AtmosphereStart; // 0x2d0(0x08)
	struct UAkAudioEvent* AtmosphereStop; // 0x2d8(0x08)
	struct UAkAudioEvent* RainEvent; // 0x2e0(0x08)
	float StartingPresentationValue; // 0x2e8(0x04)
	char pad_2EC[0x4]; // 0x2ec(0x04)

	void HandleGameplayCardAdded(struct AGobiPlayerState* GobiPlayerState, struct FActiveGameplayCard GameplayCard); // Function Gobi.AudioController.HandleGameplayCardAdded // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioDarkSetup
// Size: 0x250 (Inherited: 0x250)
struct AAudioDarkSetup : AActor {
};

// Class Gobi.AudioDestructibleComponent
// Size: 0x1c0 (Inherited: 0xd8)
struct UAudioDestructibleComponent : UActorComponent {
	struct UAkAudioEvent* ImpactHeavyAudio; // 0xd8(0x08)
	struct UAkAudioEvent* ImpactLightAudio; // 0xe0(0x08)
	struct UAkAudioEvent* RiddenDamageSwtAudio; // 0xe8(0x08)
	struct UAkAudioEvent* DebrisFallAudio; // 0xf0(0x08)
	struct UAkAudioEvent* BreakAudio; // 0xf8(0x08)
	struct TArray<struct UAkAudioEvent*> BreakSweetenersAudio; // 0x100(0x10)
	struct FGameplayTagContainer HeavyTagContainer; // 0x110(0x20)
	struct TMap<struct FGameplayTag, struct UAkAudioEvent*> DamageTypeEventMap; // 0x130(0x50)
	struct FVector ImpactOffset; // 0x180(0x0c)
	float DebrisDelay; // 0x18c(0x04)
	bool bIndestructible; // 0x190(0x01)
	char pad_191[0x2f]; // 0x191(0x2f)

	void HandleDestructibleDamaged(float NewHealth, float DeltaHealth); // Function Gobi.AudioDestructibleComponent.HandleDestructibleDamaged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioInteractableComponent
// Size: 0x270 (Inherited: 0x220)
struct UAudioInteractableComponent : USceneComponent {
	struct UAkAudioEvent* AudioToPlay; // 0x220(0x08)
	bool bCanBeDamaged; // 0x228(0x01)
	bool bCanBeUsed; // 0x229(0x01)
	char pad_22A[0x6]; // 0x22a(0x06)
	struct FText DefaultPromptText; // 0x230(0x18)
	float Cooldown; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct UHealthComponent* HealthComponent; // 0x250(0x08)
	struct UUsableComponent* UsableComponent; // 0x258(0x08)
	char pad_260[0x10]; // 0x260(0x10)

	void OnHit(struct FDamageInfo DamageInfo); // Function Gobi.AudioInteractableComponent.OnHit // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioMaterialOverride
// Size: 0x2e0 (Inherited: 0x2c8)
struct AAudioMaterialOverride : AAcousticVolume {
	float Priority; // 0x2c8(0x04)
	enum class EPhysicalSurface Surface; // 0x2cc(0x01)
	char pad_2CD[0x3]; // 0x2cd(0x03)
	struct FString SpecialSurface; // 0x2d0(0x10)
};

// Class Gobi.AudioMaterialOverrideSubsystem
// Size: 0x90 (Inherited: 0x38)
struct UAudioMaterialOverrideSubsystem : UWorldSubsystem {
	char pad_38[0x58]; // 0x38(0x58)
};

// Class Gobi.AudioMutilationManager
// Size: 0x88 (Inherited: 0x30)
struct UAudioMutilationManager : UObject {
	uint16_t MaxMutilationEventsPerFrame; // 0x30(0x02)
	char pad_32[0x56]; // 0x32(0x56)
};

// Class Gobi.AudioOptionsPanelUserWidget
// Size: 0x490 (Inherited: 0x460)
struct UAudioOptionsPanelUserWidget : UOptionsPanelUserWidget {
	char pad_460[0x30]; // 0x460(0x30)

	void OnDialogueLanguageChanged(struct UGobiUserWidget* Widget); // Function Gobi.AudioOptionsPanelUserWidget.OnDialogueLanguageChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioStateComponent
// Size: 0x168 (Inherited: 0xd8)
struct UAudioStateComponent : UActorComponent {
	struct FMulticastInlineDelegate OnUIActivated; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnIncapStateChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnResetMission; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnMissionSuccess; // 0x108(0x10)
	struct FMulticastInlineDelegate OnCampaignEnded; // 0x118(0x10)
	struct FMulticastInlineDelegate OnLoadingNextMission; // 0x128(0x10)
	struct UAkAudioEvent* AKERiddenSaferoomOpen; // 0x138(0x08)
	bool bIsFullscreen; // 0x140(0x01)
	bool bIsMoviePlaying; // 0x141(0x01)
	bool bIsInGameCinematicPlaying; // 0x142(0x01)
	bool bIsLoadingIntoNextMission; // 0x143(0x01)
	char pad_144[0x24]; // 0x144(0x24)

	void SaferoomStateChanged(enum class EPartySafeRoomState OldPartySafeRoomState, enum class EPartySafeRoomState NewPartySafeRoomState); // Function Gobi.AudioStateComponent.SaferoomStateChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioZombieManagerSubsystem
// Size: 0xa0 (Inherited: 0x38)
struct UAudioZombieManagerSubsystem : UWorldSubsystem {
	struct TMap<struct FName, struct UAudioZombieManagerSystem*> AudioZombieManagerSystems; // 0x38(0x50)
	char pad_88[0x18]; // 0x88(0x18)

	void RequestPushNormPreference(struct FName ManagerName, struct UEnemyAudioComponent* AudioComponent); // Function Gobi.AudioZombieManagerSubsystem.RequestPushNormPreference // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioZombieManagerSystem
// Size: 0x1a0 (Inherited: 0x30)
struct UAudioZombieManagerSystem : UObject {
	struct FName ManagerName; // 0x30(0x08)
	bool bPushZombieCallouts; // 0x38(0x01)
	bool bPushNumThreateningZombies; // 0x39(0x01)
	bool bPushMaxThreat; // 0x3a(0x01)
	bool bPushCumulativeThreat; // 0x3b(0x01)
	struct FName NumThreateningZombiesRTPCName; // 0x3c(0x08)
	struct FName MaxThreatRTPCName; // 0x44(0x08)
	struct FName CumulativeThreatRTPCName; // 0x4c(0x08)
	float PVPCollapsePhaseMultiplier; // 0x54(0x04)
	struct FGameplayTagQuery RegistrationQuery; // 0x58(0x48)
	float FrayRadius; // 0xa0(0x04)
	float MinRadiusMultiplier; // 0xa4(0x04)
	float CalloutRadius; // 0xa8(0x04)
	float MaxRadius; // 0xac(0x04)
	float MaxRadiusMultiplier; // 0xb0(0x04)
	float FromBehindMultiplier; // 0xb4(0x04)
	float MutedMultiplier; // 0xb8(0x04)
	bool bUpdatePreferenceOnManagedCharacter; // 0xbc(0x01)
	char pad_BD[0x3]; // 0xbd(0x03)
	float PreferenceMinDeltaBeforeUpdate; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct TMap<struct FGameplayTag, float> TagMultipliers; // 0xc8(0x50)
	struct FColor DebugColor; // 0x118(0x04)
	bool bTextRenderer; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
	float DebugTextSize; // 0x120(0x04)
	char pad_124[0x7c]; // 0x124(0x7c)
};

// Class Gobi.AutoCrouchTriggerVolume
// Size: 0x298 (Inherited: 0x298)
struct AAutoCrouchTriggerVolume : APhysicsVolume {
};

// Class Gobi.AutomatedClient
// Size: 0x30 (Inherited: 0x30)
struct UAutomatedClient : UObject {

	void HandleMissionEnded(bool bEnded, bool bSuccessfully); // Function Gobi.AutomatedClient.HandleMissionEnded // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BadgeEditPanelUserWidget
// Size: 0x480 (Inherited: 0x450)
struct UBadgeEditPanelUserWidget : UGobiUserWidget {
	struct UGobiUserWidget* ImagePickerWidget; // 0x450(0x08)
	struct UGobiUserWidget* TextPickerWidget; // 0x458(0x08)
	enum class EBadgeEditMode BadgeEditMode; // 0x460(0x01)
	char pad_461[0x1f]; // 0x461(0x1f)

	void SetEquippedElementIndex(int32_t ElementIndex); // Function Gobi.BadgeEditPanelUserWidget.SetEquippedElementIndex // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BarbedWire_Planted
// Size: 0x2a0 (Inherited: 0x250)
struct ABarbedWire_Planted : AActor {
	struct UGameplayEffectsComponent* GameplayEffectsComponent; // 0x250(0x08)
	struct USceneComponent* InternalRootComponent; // 0x258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent; // 0x260(0x08)
	struct UBoxComponent* BoxComponent; // 0x268(0x08)
	struct UGameplayEffectEmitterComponent* GameplayEffectEmitterComponent; // 0x270(0x08)
	struct UHealthComponent* HealthComponent; // 0x278(0x08)
	struct UItemAudioComponent* ItemAudioComponent; // 0x280(0x08)
	bool bShouldSpread; // 0x288(0x01)
	char pad_289[0x3]; // 0x289(0x03)
	float SpreadDistance; // 0x28c(0x04)
	struct FVector TraceOffset; // 0x290(0x0c)
	enum class ECollisionChannel TraceChannel; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)
};

// Class Gobi.BashHealthComponent
// Size: 0x140 (Inherited: 0xd8)
struct UBashHealthComponent : UActorComponent {
	int32_t MaxBashesBeforeDeath; // 0xd8(0x04)
	bool bAIDieFromBashIfIdle; // 0xdc(0x01)
	char pad_DD[0x3]; // 0xdd(0x03)
	struct FGameplayTagQuery DamageTypeTagQuery; // 0xe0(0x48)
	struct UGobiDamageType* DamageTypeOverride; // 0x128(0x08)
	char pad_130[0x10]; // 0x130(0x10)

	void OnDamage(struct FDamageInfo DamageInfo); // Function Gobi.BashHealthComponent.OnDamage // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BatchLOSInterface
// Size: 0x30 (Inherited: 0x30)
struct UBatchLOSInterface : UInterface {
};

// Class Gobi.Bird
// Size: 0x408 (Inherited: 0x250)
struct ABird : AActor {
	char pad_250[0x8]; // 0x250(0x08)
	struct UStaticMesh* PerchedMesh; // 0x258(0x08)
	struct UStaticMesh* FlyingMesh; // 0x260(0x08)
	struct USkeletalMesh* SkeletalMesh; // 0x268(0x08)
	struct FName ParticlesBone; // 0x270(0x08)
	float FlyoffParticlesChance; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct UParticleSystem* FlyoffParticles; // 0x280(0x08)
	struct UParticleSystem* DeathParticles; // 0x288(0x08)
	struct UAnimMontage* IdleAnim; // 0x290(0x08)
	struct TMap<struct FName, float> IdleFlourishWeights; // 0x298(0x50)
	struct TArray<struct FName> IdleFlourishesWithHorizontalMovement; // 0x2e8(0x10)
	struct FVector2D IdleFlourishDelay; // 0x2f8(0x08)
	struct UAnimMontage* FlyingAnim; // 0x300(0x08)
	struct FName LandingSection; // 0x308(0x08)
	float LandingDuration; // 0x310(0x04)
	struct FVector2D HealthScale; // 0x314(0x08)
	struct FVector2D Scale; // 0x31c(0x08)
	struct FVector2D Speed; // 0x324(0x08)
	float TurnRate; // 0x32c(0x04)
	float LaunchDelay; // 0x330(0x04)
	float AlertHearingRadius; // 0x334(0x04)
	float AlertRadiusMultiplier; // 0x338(0x04)
	float WeaponShotHearingRadius; // 0x33c(0x04)
	float WeaponWhizByHearingRadius; // 0x340(0x04)
	float WeaponImpactHearingRadius; // 0x344(0x04)
	float WeaponAlertRadiusScalePower; // 0x348(0x04)
	bool bDamageable; // 0x34c(0x01)
	char pad_34D[0x3]; // 0x34d(0x03)
	struct UAkAudioEvent* AKEDeath; // 0x350(0x08)
	struct UAkAudioEvent* AKEDeathFire; // 0x358(0x08)
	struct FGameplayTag UpdateRateOptimizationCategory; // 0x360(0x08)
	enum class EBirdState State; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	struct USplineComponent* SplineFlying; // 0x370(0x08)
	struct ABirdSystem* BirdSystem; // 0x378(0x08)
	struct ABirdSite* CurrentSite; // 0x380(0x08)
	bool TakeoffDelay; // 0x388(0x01)
	char pad_389[0x2f]; // 0x389(0x2f)
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3b8(0x08)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x3c0(0x08)
	struct UGameplayTagsComponent* GameplayTagsComponent; // 0x3c8(0x08)
	struct UHealthComponent* HealthComponent; // 0x3d0(0x08)
	struct UGameplayEffectsComponent* GameplayEffectsComponent; // 0x3d8(0x08)
	char pad_3E0[0x28]; // 0x3e0(0x28)

	void SetState(enum class EBirdState NewState); // Function Gobi.Bird.SetState // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GobiGameCoachLesson
// Size: 0x488 (Inherited: 0xc8)
struct UGobiGameCoachLesson : UGameCoachLesson {
	char pad_C8[0x18]; // 0xc8(0x18)
	struct UGobiLocalPlayer* GobiLocalPlayer; // 0xe0(0x08)
	struct AGobiCharacter* TargetCharacter; // 0xe8(0x08)
	bool bListenForPawnChanges; // 0xf0(0x01)
	bool bAllowAllTRSEvents; // 0xf1(0x01)
	char pad_F2[0x6]; // 0xf2(0x06)
	struct FMulticastInlineDelegate OnExtraInfo; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnShowWaypoint; // 0x108(0x10)
	struct FMulticastInlineDelegate OnSetWaypointText; // 0x118(0x10)
	enum class EGobiTeam Team; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	struct FGameplayTagQuery LocalPlayerTags; // 0x130(0x48)
	struct FGameplayTagQuery TargetTags; // 0x178(0x48)
	struct FGameplayTagQuery LocalPlayerInventoryItemTagQuery; // 0x1c0(0x48)
	struct TArray<struct UGobiGameCoachEvaluatorSet*> LocalPlayerTeachableEvalSets; // 0x208(0x10)
	struct TArray<struct UGobiGameCoachEvaluatorSet*> TargetTeachableEvalSets; // 0x218(0x10)
	struct FDataTableRowHandle ActiveMissionObjective; // 0x228(0x20)
	bool bMainMenu; // 0x248(0x01)
	bool bSocialSpace; // 0x249(0x01)
	bool bPvP; // 0x24a(0x01)
	bool bCoop; // 0x24b(0x01)
	enum class EMissionDifficulty LowestCoopDifficulty; // 0x24c(0x01)
	enum class EMissionDifficulty HighestCoopDifficulty; // 0x24d(0x01)
	bool bShowDemo2020; // 0x24e(0x01)
	char pad_24F[0x1]; // 0x24f(0x01)
	struct FGameplayTagQuery TeachingSuccessLocalPlayerTags; // 0x250(0x48)
	struct FGameplayTagQuery TeachingSuccessTargetTags; // 0x298(0x48)
	struct TArray<struct UGobiGameCoachEvaluatorSet*> TeachingSuccessLocalPlayerEvalSets; // 0x2e0(0x10)
	struct TArray<struct UGobiGameCoachEvaluatorSet*> TeachingSuccessTargetEvalSets; // 0x2f0(0x10)
	struct TArray<struct FName> TeachingSuccessTRSEventNames; // 0x300(0x10)
	struct FGameplayTagQuery TeachingFailureLocalPlayerTags; // 0x310(0x48)
	struct FGameplayTagQuery TeachingFailureTargetTags; // 0x358(0x48)
	struct TArray<struct UGobiGameCoachEvaluatorSet*> TeachingFailureLocalPlayerEvalSets; // 0x3a0(0x10)
	bool bFailIfEvalSetFails; // 0x3b0(0x01)
	char pad_3B1[0x7]; // 0x3b1(0x07)
	struct TArray<struct UGobiGameCoachEvaluatorSet*> TeachingFailureTargetEvalSets; // 0x3b8(0x10)
	struct UTexture2D* NotificationIcon; // 0x3c8(0x08)
	struct FText NotificationText; // 0x3d0(0x18)
	struct FText NotificationGamepadText; // 0x3e8(0x18)
	bool bNotificationOutputTTS; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct UTexture2D* WaypointIcon; // 0x408(0x08)
	struct FText WaypointTitle; // 0x410(0x18)
	struct FText WaypointText; // 0x428(0x18)
	struct UTexture2D* NameplateIcon; // 0x440(0x08)
	struct FText NameplateTitle; // 0x448(0x18)
	struct FText NameplateText; // 0x460(0x18)
	enum class EEquipmentSlot HighlightEquipSlot; // 0x478(0x01)
	bool bShowInGameOnly; // 0x479(0x01)
	bool bHideForPotentialUsableTarget; // 0x47a(0x01)
	bool bHideForAltUseTarget; // 0x47b(0x01)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct UAkAudioEvent* DisplayOverrideSound; // 0x480(0x08)

	void ShowWaypoint__DelegateSignature(struct UGobiGameCoachLesson* Lesson, bool bShow); // DelegateFunction Gobi.GobiGameCoachLesson.ShowWaypoint__DelegateSignature // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BirdsAlertedGameCoachLesson
// Size: 0x4c0 (Inherited: 0x488)
struct UBirdsAlertedGameCoachLesson : UGobiGameCoachLesson {
	float BirdTeachDuration; // 0x488(0x04)
	char pad_48C[0x34]; // 0x48c(0x34)
};

// Class Gobi.BirdSite
// Size: 0x480 (Inherited: 0x250)
struct ABirdSite : AActor {
	int32_t PerchVisibility; // 0x250(0x04)
	char pad_254[0x24]; // 0x254(0x24)
	bool bAllowHorizontalBirdMovement; // 0x278(0x01)
	bool bEnableTrigger; // 0x279(0x01)
	bool bTriggersAllBirdSites; // 0x27a(0x01)
	char pad_27B[0x5]; // 0x27b(0x05)
	struct FGamePropertyFloat ChanceToHorde; // 0x280(0x38)
	struct FGamePropertyFloat ChanceToAlert; // 0x2b8(0x38)
	bool bHordeRetriggerable; // 0x2f0(0x01)
	bool bAlertRetriggerable; // 0x2f1(0x01)
	char pad_2F2[0x6]; // 0x2f2(0x06)
	struct FGameplayTagContainer TriggerOmenTags; // 0x2f8(0x20)
	float HordeAlertDelay; // 0x318(0x04)
	int32_t MinBirdsToHordeAndAlert; // 0x31c(0x04)
	float TrackedCharactersUpdateRate; // 0x320(0x04)
	float CrouchedTriggerRadius; // 0x324(0x04)
	struct FVector2D TakeOffDistance; // 0x328(0x08)
	struct FVector2D TakeOffPitch; // 0x330(0x08)
	struct FVector2D TakeOffYaw; // 0x338(0x08)
	enum class EBirdFacing BirdFacing; // 0x340(0x01)
	bool bBirdsVisibleInInvalidCell; // 0x341(0x01)
	bool bSnapSplinePointsToGround; // 0x342(0x01)
	char pad_343[0x1]; // 0x343(0x01)
	float SnapSearchUp; // 0x344(0x04)
	float SnapSearchDown; // 0x348(0x04)
	bool AlertsTriggerAll; // 0x34c(0x01)
	char pad_34D[0x3]; // 0x34d(0x03)
	struct USplineComponent* SplineComponent; // 0x350(0x08)
	struct UAkComponent* AkComponent; // 0x358(0x08)
	struct UPingableComponent* PingableComponent; // 0x360(0x08)
	struct UBoxComponent* PingableVolume; // 0x368(0x08)
	struct FGameplayTag HordeCue; // 0x370(0x08)
	struct FVector2D HordeCueDistance; // 0x378(0x08)
	struct FVector2D HordeCueHeight; // 0x380(0x08)
	struct UAkAudioEvent* AKEIdleLoop; // 0x388(0x08)
	struct UAkAudioEvent* AKEIdleLoopStop; // 0x390(0x08)
	struct UAkAudioEvent* AKEFlyAway; // 0x398(0x08)
	float MaxDistanceSurprised; // 0x3a0(0x04)
	char pad_3A4[0x74]; // 0x3a4(0x74)
	struct ABirdSystem* BirdSystem; // 0x418(0x08)
	char pad_420[0x60]; // 0x420(0x60)

	void OnRep_PerchVisibility(); // Function Gobi.BirdSite.OnRep_PerchVisibility // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.MicroManager
// Size: 0x58 (Inherited: 0x30)
struct UMicroManager : UObject {
	char pad_30[0x28]; // 0x30(0x28)
};

// Class Gobi.BirdSystemMicroManager
// Size: 0xc8 (Inherited: 0x58)
struct UBirdSystemMicroManager : UMicroManager {
	char pad_58[0x70]; // 0x58(0x70)
};

// Class Gobi.MicroManagerMod
// Size: 0x90 (Inherited: 0x88)
struct UMicroManagerMod : UGameplayMod {
	char pad_88[0x8]; // 0x88(0x08)
};

// Class Gobi.BirdSystemMod
// Size: 0xe0 (Inherited: 0x90)
struct UBirdSystemMod : UMicroManagerMod {
	struct FGamePropertyIntMod MinSystems; // 0x90(0x10)
	struct FGamePropertyIntMod MaxSystems; // 0xa0(0x10)
	char pad_B0[0x30]; // 0xb0(0x30)
};

// Class Gobi.BirdSystem
// Size: 0x408 (Inherited: 0x250)
struct ABirdSystem : AActor {
	char pad_250[0x8]; // 0x250(0x08)
	bool bBirdSystemEnabled; // 0x258(0x01)
	bool bNetworked; // 0x259(0x01)
	bool bControlledByMicroManager; // 0x25a(0x01)
	char pad_25B[0x1]; // 0x25b(0x01)
	uint32_t SupportedGameModes; // 0x25c(0x04)
	int32_t BirdCount; // 0x260(0x04)
	struct FVector2D InitialLocation; // 0x264(0x08)
	struct FVector2D HoverRadius; // 0x26c(0x08)
	int32_t CircleCount; // 0x274(0x04)
	int32_t SplinePointCount; // 0x278(0x04)
	float SplineRadius; // 0x27c(0x04)
	bool bLandSameSiteAllowed; // 0x280(0x01)
	enum class EBirdAfterInitialFlight InitialFlightOption; // 0x281(0x01)
	char pad_282[0x6]; // 0x282(0x06)
	struct TArray<struct ABird*> ActorTypes; // 0x288(0x10)
	struct TArray<struct ABirdSite*> Sites; // 0x298(0x10)
	char pad_2A8[0xa0]; // 0x2a8(0xa0)
	struct ABirdSite* StartSite; // 0x348(0x08)
	struct TArray<struct ABird*> BirdActors; // 0x350(0x10)
	struct TArray<struct USplineComponent*> Splines; // 0x360(0x10)
	struct TArray<int8_t> BirdSpawns; // 0x370(0x10)
	struct TArray<struct FBirdInfo> BirdInfos; // 0x380(0x10)
	char pad_390[0x78]; // 0x390(0x78)

	void OnRep_BirdSpawns(); // Function Gobi.BirdSystem.OnRep_BirdSpawns // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ObjectPropertyMod
// Size: 0xa8 (Inherited: 0x88)
struct UObjectPropertyMod : UGameplayMod {
	struct FName PropertyName; // 0x88(0x08)
	enum class EObjectPropertyModType ModType; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	struct FCustomDataProviderFloat Modifier; // 0x94(0x08)
	struct FCustomDataProviderInt32 IntModifier; // 0x9c(0x08)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Gobi.BloaterExplodePropertyMod
// Size: 0xb0 (Inherited: 0xa8)
struct UBloaterExplodePropertyMod : UObjectPropertyMod {
	enum class EExplodModType Type; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class Gobi.ScenarioComponent
// Size: 0x318 (Inherited: 0xd8)
struct UScenarioComponent : UActorComponent {
	bool bInterruptable; // 0xd8(0x01)
	bool bInterrupting; // 0xd9(0x01)
	bool bCanEverSpawn; // 0xda(0x01)
	bool bWantsSoloSpawning; // 0xdb(0x01)
	bool bDisableOnComplete; // 0xdc(0x01)
	enum class EPacingPhase HeldPacingPhaseForInfiniteWaves; // 0xdd(0x01)
	bool bUseDelayBeforeSpawn; // 0xde(0x01)
	char pad_DF[0x1]; // 0xdf(0x01)
	struct TArray<struct FGameplayTag> FirstWaveCueTags; // 0xe0(0x10)
	struct TArray<struct FGameplayTag> LastWaveDoneCueTags; // 0xf0(0x10)
	struct TArray<struct FGameplayTag> NextWaveCueTags; // 0x100(0x10)
	struct FGameplayTag SpawningLocationTag; // 0x110(0x08)
	uint32_t SupportedGameModes; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct FTopLevelSpawnDeckOverrides AISDGTopLevelSpawnDeckOverrides; // 0x120(0x48)
	char pad_168[0x20]; // 0x168(0x20)
	struct UScenarioEvaluatorSet* ActivationConditions; // 0x188(0x08)
	struct UScenarioEvaluatorSet* CompletionConditions; // 0x190(0x08)
	struct UScenarioEvaluatorSet* FailureConditions; // 0x198(0x08)
	float FailureTime; // 0x1a0(0x04)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct UScenarioHeroEvaluatorSet* HeroEvaluators; // 0x1a8(0x08)
	struct UAISpawnDeckGenerator* AISpawnDeckGenerator; // 0x1b0(0x08)
	struct UAISpawnDeck* AISpawnDeck; // 0x1b8(0x08)
	char pad_1C0[0x8]; // 0x1c0(0x08)
	struct FGameplayTagContainer AISpawnDeckOverrideTags; // 0x1c8(0x20)
	struct UAISpawnDeckGenerator* OverrideAISpawnDeckGenerator; // 0x1e8(0x08)
	struct FRecycleConfigOverride InitialRecycleConfigOverride; // 0x1f0(0x28)
	struct FRecycleConfigOverride RecycleConfigOverride; // 0x218(0x28)
	struct TArray<struct AActor*> UsableActors; // 0x240(0x10)
	char pad_250[0x8]; // 0x250(0x08)
	struct TArray<struct AAISmartActorBase*> AISmartActors; // 0x258(0x10)
	enum class EScenarioState State; // 0x268(0x01)
	char pad_269[0x37]; // 0x269(0x37)
	struct TArray<struct FScenarioHeroDebugInfo> HeroDebugInfos; // 0x2a0(0x10)
	struct FName LastActiveSpawnRule; // 0x2b0(0x08)
	float SpawnerSuccessRate; // 0x2b8(0x04)
	char pad_2BC[0x2]; // 0x2bc(0x02)
	bool bDeckCleanup; // 0x2be(0x01)
	char pad_2BF[0x1]; // 0x2bf(0x01)
	float MaxDeckCleanupDuration; // 0x2c0(0x04)
	float DeckCleanupHeroAdvanceRange; // 0x2c4(0x04)
	char pad_2C8[0x50]; // 0x2c8(0x50)

	bool UsePossibleScenarioData(struct FGameplayTag ScenarioTag, struct FGameplayTag EqsTag); // Function Gobi.ScenarioComponent.UsePossibleScenarioData // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BlueprintableScenarioComponent
// Size: 0x328 (Inherited: 0x318)
struct UBlueprintableScenarioComponent : UScenarioComponent {
	char pad_318[0x10]; // 0x318(0x10)

	void BPEvent_OnSpawnDeckGeneration(int32_t CurrentWave, int32_t TotalWaves); // Function Gobi.BlueprintableScenarioComponent.BPEvent_OnSpawnDeckGeneration // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BoneMapComponent
// Size: 0x128 (Inherited: 0xd8)
struct UBoneMapComponent : UActorComponent {
	struct TMap<struct FGameplayTag, struct FBoneCollection> BoneMap; // 0xd8(0x50)
};

// Class Gobi.BoneVisibilityTrait
// Size: 0x40 (Inherited: 0x30)
struct UBoneVisibilityTrait : UTrait {
	struct TArray<struct FBoneVisibilityMeshConfig> MeshConfigs; // 0x30(0x10)
};

// Class Gobi.BotAIScriptingComponent
// Size: 0x6b0 (Inherited: 0x470)
struct UBotAIScriptingComponent : UAIScriptingComponent {
	struct FBlackboardKeySelector TeammateTargetBBKey; // 0x470(0x28)
	struct FBlackboardKeySelector TeammateDistBBKey; // 0x498(0x28)
	struct FBlackboardKeySelector ShouldTeleportBBKey; // 0x4c0(0x28)
	struct FBlackboardKeySelector WanderFollowTeammateBBKey; // 0x4e8(0x28)
	struct FBlackboardKeySelector AllowMeleeNavBBKey; // 0x510(0x28)
	struct FBlackboardKeySelector GoToLocationBBKey; // 0x538(0x28)
	struct FBlackboardKeySelector InteractTargetBBKey; // 0x560(0x28)
	char pad_588[0x8]; // 0x588(0x08)
	struct FBlackboardKeySelector InteractTargetNavLocBBKey; // 0x590(0x28)
	struct FBlackboardKeySelector DesiredSelfItemPickupBBKey; // 0x5b8(0x28)
	struct FBlackboardKeySelector DesiredTeamItemPickupBBKey; // 0x5e0(0x28)
	struct FBlackboardKeySelector DesiredUsableBBKey; // 0x608(0x28)
	struct FBlackboardKeySelector ItemUseBBKey; // 0x630(0x28)
	struct FBlackboardKeySelector ItemUseNavActorBBKey; // 0x658(0x28)
	struct FBlackboardKeySelector ItemUseNavLocBBKey; // 0x680(0x28)
	char pad_6A8[0x8]; // 0x6a8(0x08)

	void ValidateCurInteractTarget(); // Function Gobi.BotAIScriptingComponent.ValidateCurInteractTarget // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GobiAIController
// Size: 0x390 (Inherited: 0x340)
struct AGobiAIController : AAIController {
	char pad_340[0x8]; // 0x340(0x08)
	struct UBehaviorTree* BTAsset; // 0x348(0x08)
	char pad_350[0x14]; // 0x350(0x14)
	struct FDMapAISpawnData DMapSpawnData; // 0x364(0x0c)
	struct FMulticastInlineDelegate OnDMapSpawnDistanceCalculated; // 0x370(0x10)
	bool bIsClientAI; // 0x380(0x01)
	char pad_381[0xf]; // 0x381(0x0f)

	void RemoveSenseMod(struct UAISense* SenseClass, float ModAdjustment); // Function Gobi.GobiAIController.RemoveSenseMod // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BotController
// Size: 0x1198 (Inherited: 0x390)
struct ABotController : AGobiAIController {
	char pad_390[0x8]; // 0x390(0x08)
	struct FMulticastInlineDelegate OnGoToLocReached; // 0x398(0x10)
	struct FMulticastInlineDelegate OnGoToLocSeqCompleted; // 0x3a8(0x10)
	struct FMulticastInlineDelegate OnBotConfigChangedEvent; // 0x3b8(0x10)
	struct FMulticastInlineDelegate OnBotSwarmedEvent; // 0x3c8(0x10)
	struct FMulticastInlineDelegate OnCombatEvent; // 0x3d8(0x10)
	float CombatExitDelay; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct FTetherSystem TetherSystem; // 0x3f0(0x118)
	struct FBotPingSystem PingSystem; // 0x508(0x50)
	struct FBotThreatList ThreatList; // 0x558(0x50)
	char pad_5A8[0x8]; // 0x5a8(0x08)
	struct AGobiCharacter* OwnerGobiChar; // 0x5b0(0x08)
	struct AHeroCharacter* OwnerHeroChar; // 0x5b8(0x08)
	struct FGameplayTag BotTypeBotTag; // 0x5c0(0x08)
	struct FGameplayTag BotTypeNPCTag; // 0x5c8(0x08)
	struct FGameplayTag BotBehaviorNoCombatTag; // 0x5d0(0x08)
	struct FGameplayTag BotBehaviorNoWanderTag; // 0x5d8(0x08)
	struct FGameplayTagContainer AttackTags; // 0x5e0(0x20)
	float ThreatDistScore; // 0x600(0x04)
	float EyePosHeight; // 0x604(0x04)
	struct FGameplayTagContainer DbgDisableActionsTags; // 0x608(0x20)
	struct FGameplayTagContainer DbgDisableAttacksTags; // 0x628(0x20)
	struct FGameplayTagContainer DbgDisableMovementTags; // 0x648(0x20)
	char pad_668[0x8]; // 0x668(0x08)
	struct FGameplayTagContainer DisableMovementTags; // 0x670(0x20)
	struct UEnvQuery* Wander_EQS; // 0x690(0x08)
	struct UEnvQuery* ThreatEQS; // 0x698(0x08)
	struct UEnvQuery* AttackLocEQS; // 0x6a0(0x08)
	struct UAIDistanceRanges* AttackDistanceRanges; // 0x6a8(0x08)
	struct FGameplayTag BotInteractIgnoreTag; // 0x6b0(0x08)
	struct FGameplayTag BotInteractIgnoreAlwaysTag; // 0x6b8(0x08)
	struct FGameplayTag BotItemPickupLimitTag; // 0x6c0(0x08)
	struct FGameplayTagQuery TargetMeleeOnlyTagQuery; // 0x6c8(0x48)
	struct FGameplayTagQuery TargetMeleePreferredTagQuery; // 0x710(0x48)
	struct FGameplayTagQuery TargetRangedOnlyTagQuery; // 0x758(0x48)
	float ItemPickupSearchDist; // 0x7a0(0x04)
	char pad_7A4[0x4]; // 0x7a4(0x04)
	struct FGameplayTagQuery EnvironSenseAllowedTagQuery; // 0x7a8(0x48)
	struct FGameplayTagQuery ThreatPingTagQuery; // 0x7f0(0x48)
	char pad_838[0xf8]; // 0x838(0xf8)
	float UsableSearchDist; // 0x930(0x04)
	float InteractNavToDist; // 0x934(0x04)
	float InteractActivateDist; // 0x938(0x04)
	float TeammateFollowTetherDist; // 0x93c(0x04)
	char pad_940[0x10]; // 0x940(0x10)
	struct UBotPlaystyleConfigCollection* DefaultBotPlaystyleConfigSet; // 0x950(0x08)
	char pad_958[0x6b0]; // 0x958(0x6b0)
	struct UPlayerStatsComponent* StatsComponent; // 0x1008(0x08)
	char pad_1010[0x7f]; // 0x1010(0x7f)
	bool bIsCombatAllowed; // 0x108f(0x01)
	bool bIsWanderAllowed; // 0x1090(0x01)
	bool bReturnToCombatStartLoc; // 0x1091(0x01)
	bool bAutoHideWeapons; // 0x1092(0x01)
	char pad_1093[0x105]; // 0x1093(0x105)

	void SetWanderAllowed(struct AGobiCharacter* BotChar, bool bIsAllowed); // Function Gobi.BotController.SetWanderAllowed // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GobiGameModeBase
// Size: 0x438 (Inherited: 0x338)
struct AGobiGameModeBase : AGameMode {
	char pad_338[0x8]; // 0x338(0x08)
	struct FMulticastInlineDelegate OnWaitingPostMatch; // 0x340(0x10)
	enum class EGameModeType GameModeType; // 0x350(0x01)
	bool bSupportsBots; // 0x351(0x01)
	char pad_352[0x2]; // 0x352(0x02)
	float WaitToResetMatchDuration; // 0x354(0x04)
	float WaitToStartAfterResetMatchDuration; // 0x358(0x04)
	float ResettingMatchTimeoutDuration; // 0x35c(0x04)
	float ResetCompletedMatchStateDuration; // 0x360(0x04)
	float CreditsWaitDuration; // 0x364(0x04)
	struct APlayerSpawnManagerBase* PlayerSpawnManager; // 0x368(0x08)
	struct UGameplayTagsComponent* GameplayTagsComponent; // 0x370(0x08)
	struct ALevelStreamingCoordinator* LevelStreamingCoordinator; // 0x378(0x08)
	struct ULootData* LootData; // 0x380(0x08)
	struct APlayerSpawnManagerBase* PlayerSpawnManagerClass; // 0x388(0x08)
	struct AActor* AudioControllerClass; // 0x390(0x08)
	struct AActor* AudioController; // 0x398(0x08)
	struct UGameDirector* GameDirectorClass; // 0x3a0(0x08)
	struct UGameDirector* GameDirector; // 0x3a8(0x08)
	struct ABotController* BotControllerClass; // 0x3b0(0x08)
	struct ALevelResetCoordinator* LevelResetCoordinator; // 0x3b8(0x08)
	struct ALullSystem* LullSystem; // 0x3c0(0x08)
	char pad_3C8[0x8]; // 0x3c8(0x08)
	float WaitForBackfillDuration; // 0x3d0(0x04)
	float WaitForReadyPlayersDuration; // 0x3d4(0x04)
	char pad_3D8[0x8]; // 0x3d8(0x08)
	struct UWaypointManager* WaypointManager; // 0x3e0(0x08)
	char pad_3E8[0x50]; // 0x3e8(0x50)

	void SetPersistentAIData(struct FName Name, float Value); // Function Gobi.GobiGameModeBase.SetPersistentAIData // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.HeroGameMode
// Size: 0x4e0 (Inherited: 0x438)
struct AHeroGameMode : AGobiGameModeBase {
	struct FName SpawnTagOverride; // 0x438(0x08)
	float PostMatchWaitDuration; // 0x440(0x04)
	float TransitionWaitDuration; // 0x444(0x04)
	char pad_448[0x44]; // 0x448(0x44)
	struct FName DefaultSpawnTag; // 0x48c(0x08)
	char pad_494[0x4]; // 0x494(0x04)
	struct FGameplayTagQuery ExcludeCharactersFromGameDirectorSpawning; // 0x498(0x48)
};

// Class Gobi.MissionGameMode
// Size: 0x520 (Inherited: 0x4e0)
struct AMissionGameMode : AHeroGameMode {
	char pad_4E0[0x10]; // 0x4e0(0x10)
	bool bHeroRescueRespawnEnabled; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	float GoldenPathTraveledDistancePctForRespawn; // 0x4f4(0x04)
	float RespawnDelayTime; // 0x4f8(0x04)
	float NoHumanPresenceFailTimerDelaySeconds; // 0x4fc(0x04)
	float IncapableHeroFailureDelay; // 0x500(0x04)
	bool bHeroTestNonCapableGrappleTags; // 0x504(0x01)
	char pad_505[0x1b]; // 0x505(0x1b)

	void RequestRescueRespawns(struct UObject* WorldContextObj, struct UEnvQuery* EQSTest); // Function Gobi.MissionGameMode.RequestRescueRespawns // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BotPlaythroughGameMode
// Size: 0x570 (Inherited: 0x520)
struct ABotPlaythroughGameMode : AMissionGameMode {
	char pad_520[0x18]; // 0x520(0x18)
	struct UMapSpatialInfoComponent* MapSpatialInfoComponent; // 0x538(0x08)
	struct APlayerController* PlayerCommandController; // 0x540(0x08)
	char pad_548[0x28]; // 0x548(0x28)
};

// Class Gobi.BotPlaystyleConfigCollection
// Size: 0x48 (Inherited: 0x38)
struct UBotPlaystyleConfigCollection : UDataAsset {
	struct TArray<struct FBotPlaystyleConfig> Playstyles; // 0x38(0x10)
};

// Class Gobi.BreakableComponent
// Size: 0x460 (Inherited: 0xd8)
struct UBreakableComponent : UActorComponent {
	struct FCollisionProfileName PristineHiddenCollisionProfile; // 0xd8(0x08)
	struct FCollisionProfileName DeformableVisibleCollisionProfile; // 0xe0(0x08)
	struct FCollisionProfileName BreakableVisibleCollisionProfile; // 0xe8(0x08)
	struct FCollisionProfileName BreakableVisibleIntercollisionProfile; // 0xf0(0x08)
	float BonesToHealth; // 0xf8(0x04)
	float BoneHealthVariance; // 0xfc(0x04)
	struct TArray<struct FName> AnchorBones; // 0x100(0x10)
	struct TArray<struct FName> UncrackableBones; // 0x110(0x10)
	struct TArray<struct FName> UnbreakableBones; // 0x120(0x10)
	struct TArray<struct FBonePair> CustomNeighbors; // 0x130(0x10)
	struct TArray<struct FBonePair> CustomNotNeighbors; // 0x140(0x10)
	struct FVector2D CrackDepth; // 0x150(0x08)
	float LinearImpulseScale; // 0x158(0x04)
	float AngularImpulseScale; // 0x15c(0x04)
	float DestroyedImpulseScale; // 0x160(0x04)
	float DetachableLinearImpulseScale; // 0x164(0x04)
	float DetachableAngularImpulseScale; // 0x168(0x04)
	float MaxSimulationTime; // 0x16c(0x04)
	struct FVector2D IntercollisionDelay; // 0x170(0x08)
	struct UCurveFloat* DoorShakeCurve; // 0x178(0x08)
	float DoorShakeDistance; // 0x180(0x04)
	float DoorShakeHalfAngle; // 0x184(0x04)
	struct USceneComponent* Hinge; // 0x188(0x08)
	struct UHealthComponent* HealthComponent; // 0x190(0x08)
	struct TArray<struct UMeshComponent*> PristineMeshes; // 0x198(0x10)
	struct UPoseableMeshComponent* DeformableMesh; // 0x1a8(0x08)
	struct UPoseableMeshComponent* BreakableMesh; // 0x1b0(0x08)
	struct USkinnedDamageTextureComponent* SkinnedDamage; // 0x1b8(0x08)
	struct TMap<struct USceneComponent*, struct FName> AttachmentBoneMap; // 0x1c0(0x50)
	struct TArray<struct FDetachableInfo> Detachables; // 0x210(0x10)
	char pad_220[0xa0]; // 0x220(0xa0)
	struct FVector NetHitDir; // 0x2c0(0x0c)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	struct TArray<int32_t> NetBonesCracked; // 0x2d0(0x10)
	struct TArray<int32_t> NetBonesDestroyed; // 0x2e0(0x10)
	struct TArray<struct FHitInfo> NetDeformations; // 0x2f0(0x10)
	struct TArray<struct FBoneInfo> BoneInfos; // 0x300(0x10)
	char pad_310[0x150]; // 0x310(0x150)

	void RefreshData(); // Function Gobi.BreakableComponent.RefreshData // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DamageFilter
// Size: 0x40 (Inherited: 0x30)
struct UDamageFilter : UObject {
	struct TArray<struct FDamageTypeDamageMod> DamageTypeMods; // 0x30(0x10)
};

// Class Gobi.BreakableDamageFilter
// Size: 0x40 (Inherited: 0x40)
struct UBreakableDamageFilter : UDamageFilter {
};

// Class Gobi.BrightnessLevelScriptActor
// Size: 0x260 (Inherited: 0x258)
struct ABrightnessLevelScriptActor : ALevelScriptActor {
	struct ACameraActor* Camera; // 0x258(0x08)
};

// Class Gobi.BrightnessOptionsUserWidget
// Size: 0x508 (Inherited: 0x498)
struct UBrightnessOptionsUserWidget : UFTUEOptionsPanelUserWidget {
	char pad_498[0x70]; // 0x498(0x70)

	void OnSaturationChanged(struct UGobiUserWidget* Widget); // Function Gobi.BrightnessOptionsUserWidget.OnSaturationChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BroadcastMessageManager
// Size: 0x70 (Inherited: 0x30)
struct UBroadcastMessageManager : UObject {
	char pad_30[0x40]; // 0x30(0x40)
};

// Class Gobi.ZombieAnimInstance
// Size: 0x7f0 (Inherited: 0x7b0)
struct UZombieAnimInstance : UAnimInstance3P {
	struct FZombieAnimState ZombieAnimState; // 0x7b0(0x04)
	float AimSpeed; // 0x7b4(0x04)
	struct FGobiAnimationCurveData AttackAimAlphaCurve; // 0x7b8(0x10)
	float AttackAimAlpha; // 0x7c8(0x04)
	float AttackAimCounterYaw; // 0x7cc(0x04)
	float LocoCounterYaw; // 0x7d0(0x04)
	char pad_7D4[0x1c]; // 0x7d4(0x1c)
};

// Class Gobi.BruteAnimInstance
// Size: 0x800 (Inherited: 0x7f0)
struct UBruteAnimInstance : UZombieAnimInstance {
	struct FBruteAnimState BruteAnimState; // 0x7e8(0x10)
};

// Class Gobi.BruteComponent
// Size: 0x398 (Inherited: 0xd8)
struct UBruteComponent : UActorComponent {
	char pad_D8[0x18]; // 0xd8(0x18)
	struct FGameplayTag BruteStateTags[0x5]; // 0xf0(0x28)
	float MeleeProbability; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UBlackboardData* BlackboardAsset; // 0x120(0x08)
	struct FBlackboardKeySelector EnemyBBKey; // 0x128(0x28)
	struct FGameplayTagQuery MeleeActionTagQuery; // 0x150(0x48)
	struct FGameplayTagQuery TumorTossActionTagQuery; // 0x198(0x48)
	int32_t MinTargetAttacksBeforeTargetSwitch; // 0x1e0(0x04)
	float MinTargetDistanceDiffBeforeTargetSwitch; // 0x1e4(0x04)
	char pad_1E8[0x140]; // 0x1e8(0x140)
	struct AGobiCharacter* BruteOwner; // 0x328(0x08)
	enum class EBruteState CurrentBruteState; // 0x330(0x01)
	enum class EBruteState PreviousBruteState; // 0x331(0x01)
	char pad_332[0x66]; // 0x332(0x66)

	void OnRep_CurrentBruteState(enum class EBruteState OldState); // Function Gobi.BruteComponent.OnRep_CurrentBruteState // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.BTComposite_SimpleParallelEx
// Size: 0xa0 (Inherited: 0x98)
struct UBTComposite_SimpleParallelEx : UBTCompositeNode {
	enum class EBTParallelExMode ParallelMode; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Gobi.BTDecorator_CanTriggerAction
// Size: 0x138 (Inherited: 0x70)
struct UBTDecorator_CanTriggerAction : UBTDecorator {
	struct FGameplayTagQuery ActionTagQuery; // 0x70(0x48)
	struct FAIDataProviderGameplayTagQueryContainerValue ActionTags; // 0xb8(0x78)
	bool bTestIsEnabledForActor; // 0x130(0x01)
	bool bDisableOnSuccess; // 0x131(0x01)
	char pad_132[0x2]; // 0x132(0x02)
	float FlowControlDelay; // 0x134(0x04)
};

// Class Gobi.BTDecorator_CheckDifficulty
// Size: 0x78 (Inherited: 0x70)
struct UBTDecorator_CheckDifficulty : UBTDecorator {
	struct FDifficultyBool IsAllowed; // 0x70(0x05)
	char pad_75[0x3]; // 0x75(0x03)
};

// Class Gobi.BTDecorator_CheckEnemyDamageAttackable
// Size: 0x1c8 (Inherited: 0x70)
struct UBTDecorator_CheckEnemyDamageAttackable : UBTDecorator {
	struct FBlackboardKeySelector EnemyBBKey; // 0x70(0x28)
	bool bOwnerDamageOnly; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct FAIDataProviderIntValue MaxAttackFailures; // 0xa0(0x38)
	bool bUseAttackTime; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
	struct FAIDataProviderFloatValue MaxTimeSinceAttackFailure; // 0xe0(0x38)
	bool bUseAttackDistance; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
	struct FAIDataProviderBoolValue UseAttackLocation; // 0x120(0x38)
	struct FAIDataProviderFloatValue MinDistanceSinceAttackFailure; // 0x158(0x38)
	struct FAIDataProviderFloatValue MaxDistance; // 0x190(0x38)
};

// Class Gobi.BTDecorator_CheckGameplayTagsOnActorFlowControl
// Size: 0x150 (Inherited: 0x148)
struct UBTDecorator_CheckGameplayTagsOnActorFlowControl : UBTDecorator_CheckGameplayTagsOnActor {
	enum class EBTGameplayTagRestart NotifyObserver; // 0x148(0x01)
	char pad_149[0x7]; // 0x149(0x07)
};

// Class Gobi.BTDecorator_ClearBlackboardKey
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_ClearBlackboardKey : UBTDecorator_BlackboardBase {
	char bOnlyClearOnSuccess : 1; // 0x98(0x01)
	char pad_98_1 : 7; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Gobi.BTDecorator_ConditionClearBBKey
// Size: 0xd0 (Inherited: 0xc8)
struct UBTDecorator_ConditionClearBBKey : UBTDecorator_Blackboard {
	char pad_C8[0x8]; // 0xc8(0x08)
};

// Class Gobi.BTDecorator_CopyLocationFromBBKey
// Size: 0xc0 (Inherited: 0x70)
struct UBTDecorator_CopyLocationFromBBKey : UBTDecorator {
	struct FBlackboardKeySelector BlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector BlackboardKeyToCopy; // 0x98(0x28)
};

// Class Gobi.BTDecorator_DataBindingIsValid
// Size: 0xa8 (Inherited: 0x70)
struct UBTDecorator_DataBindingIsValid : UBTDecorator {
	struct FAIDataProviderUObjectValue UObjectDataProvider; // 0x70(0x38)
};

// Class Gobi.BTDecorator_HasBlackboardTimeoutExpired
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_HasBlackboardTimeoutExpired : UBTDecorator_BlackboardBase {
	float Offset; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Gobi.BTDecorator_IsActionEnabledForActor
// Size: 0x138 (Inherited: 0x70)
struct UBTDecorator_IsActionEnabledForActor : UBTDecorator {
	struct FGameplayTagQuery ActionTagQuery; // 0x70(0x48)
	struct FAIDataProviderGameplayTagQueryContainerValue ActionTags; // 0xb8(0x78)
	bool bDisableOnSuccess; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	float FlowControlDelay; // 0x134(0x04)
};

// Class Gobi.BTDecorator_IsInPacingPhase
// Size: 0x78 (Inherited: 0x70)
struct UBTDecorator_IsInPacingPhase : UBTDecorator {
	enum class EPacingPhase PacingPhase; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Gobi.BTDecorator_IsInTeamRange
// Size: 0x98 (Inherited: 0x98)
struct UBTDecorator_IsInTeamRange : UBTDecorator_BlackboardBase {
};

// Class Gobi.BTDecorator_KeepFocus
// Size: 0xa0 (Inherited: 0x70)
struct UBTDecorator_KeepFocus : UBTDecorator {
	struct FBlackboardKeySelector FocusTargetKey; // 0x70(0x28)
	char FocusPriority; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Gobi.BTDecorator_NavRaycast
// Size: 0x98 (Inherited: 0x70)
struct UBTDecorator_NavRaycast : UBTDecorator {
	struct FBlackboardKeySelector TargetBBKey; // 0x70(0x28)
};

// Class Gobi.BTDecorator_SetBlackboardKey
// Size: 0xf0 (Inherited: 0x70)
struct UBTDecorator_SetBlackboardKey : UBTDecorator {
	struct FBlackboardKeySet KeySet; // 0x70(0x80)
};

// Class Gobi.BTService_ActorLocation
// Size: 0xc8 (Inherited: 0x78)
struct UBTService_ActorLocation : UBTService {
	struct FBlackboardKeySelector ActorBBKey; // 0x78(0x28)
	struct FBlackboardKeySelector LocationBBKey; // 0xa0(0x28)
};

// Class Gobi.BTService_Angle
// Size: 0xe0 (Inherited: 0xa0)
struct UBTService_Angle : UBTService_BlackboardBase {
	struct FBlackboardKeySelector TargetBlackboardKey; // 0xa0(0x28)
	struct UEnum* AngleLabelEnum; // 0xc8(0x08)
	struct TArray<struct FAngleRange> AngleRanges; // 0xd0(0x10)
};

// Class Gobi.BTService_BlackboardValues
// Size: 0x88 (Inherited: 0x78)
struct UBTService_BlackboardValues : UBTService {
	struct TArray<struct FBlackBoardValue> Values; // 0x78(0x10)
};

// Class Gobi.BTService_CanTriggerAction
// Size: 0x90 (Inherited: 0x78)
struct UBTService_CanTriggerAction : UBTService {
	struct TArray<struct FActionToCheck> ActionsToCheck; // 0x78(0x10)
	enum class EGameplayActionMatchingTagType MatchingTagType; // 0x88(0x01)
	bool bTestIsEnabledForActor; // 0x89(0x01)
	char pad_8A[0x6]; // 0x8a(0x06)
};

// Class Gobi.BTService_CanUseSmartActor
// Size: 0xc8 (Inherited: 0xa0)
struct UBTService_CanUseSmartActor : UBTService_BlackboardBase {
	struct FBlackboardKeySelector SmartActorBlackboardKey; // 0xa0(0x28)
};

// Class Gobi.BTService_GobiRunEQS
// Size: 0x190 (Inherited: 0x138)
struct UBTService_GobiRunEQS : UBTService_RunEQS {
	bool bRequiresBlackboardCondition; // 0x138(0x01)
	enum class EBasicKeyOperation BlackboardCondition; // 0x139(0x01)
	char pad_13A[0x6]; // 0x13a(0x06)
	struct FGameplayTagQuery TagRequirements; // 0x140(0x48)
	bool bAllowsAnyObject; // 0x188(0x01)
	char pad_189[0x7]; // 0x189(0x07)
};

// Class Gobi.BTService_ChaserRunEQS
// Size: 0x1b8 (Inherited: 0x190)
struct UBTService_ChaserRunEQS : UBTService_GobiRunEQS {
	struct FBlackboardKeySelector WallClingBlackboardKey; // 0x190(0x28)
};

// Class Gobi.BTService_ClosestActorOfClass
// Size: 0xa8 (Inherited: 0xa0)
struct UBTService_ClosestActorOfClass : UBTService_BlackboardBase {
	struct AActor* SearchedActorClass; // 0xa0(0x08)
};

// Class Gobi.BTService_Damage
// Size: 0xc8 (Inherited: 0x78)
struct UBTService_Damage : UBTService {
	struct FBlackboardKeySelector DamageCounterBBKey; // 0x78(0x28)
	struct FGameplayTagContainer DamageTags; // 0xa0(0x20)
	enum class EGameplayTagContainerMatchType DamageTagMatchType; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
};

// Class Gobi.BTService_Distance
// Size: 0x100 (Inherited: 0xa0)
struct UBTService_Distance : UBTService_BlackboardBase {
	struct FBlackboardKeySelector TargetPositionBlackboardKey; // 0xa0(0x28)
	struct FAIDataProviderUObjectValue DistanceRanges; // 0xc8(0x38)
};

// Class Gobi.BTService_EnvironSensor
// Size: 0x138 (Inherited: 0x78)
struct UBTService_EnvironSensor : UBTService {
	struct FGameplayTagQuery AllowSensorTagQuery; // 0x78(0x48)
	struct FAIDataProviderGameplayTagQueryContainerValue ThreatPingTagQueryDP; // 0xc0(0x78)
};

// Class Gobi.BTService_GameplayTags
// Size: 0x88 (Inherited: 0x78)
struct UBTService_GameplayTags : UBTService {
	struct TArray<struct FGameplayTagChange> Values; // 0x78(0x10)
};

// Class Gobi.BTService_Hag
// Size: 0xc8 (Inherited: 0x78)
struct UBTService_Hag : UBTService {
	struct FBlackboardKeySelector HagStateBBKey; // 0x78(0x28)
	struct FBlackboardKeySelector PrevHagStateBBKey; // 0xa0(0x28)
};

// Class Gobi.BTService_Health
// Size: 0xb8 (Inherited: 0x78)
struct UBTService_Health : UBTService {
	struct FBlackboardKeySelector HealthBBKey; // 0x78(0x28)
	struct UEnum* HealthLabelEnum; // 0xa0(0x08)
	struct TArray<struct FHealthRange> HealthRanges; // 0xa8(0x10)
};

// Class Gobi.BTService_Horde
// Size: 0xe8 (Inherited: 0x78)
struct UBTService_Horde : UBTService {
	struct FBlackboardKeySelector AlertLocationBBKey; // 0x78(0x28)
	struct FGameplayTagQuery HordeTagQuery; // 0xa0(0x48)
};

// Class Gobi.BTService_LifeState
// Size: 0xf0 (Inherited: 0x78)
struct UBTService_LifeState : UBTService {
	struct FBlackboardKeySelector LifeStateBBKey; // 0x78(0x28)
	struct TMap<struct FGameplayTag, enum class ELifeState> TagToEnumMap; // 0xa0(0x50)
};

// Class Gobi.BTService_LineOfSight
// Size: 0xc8 (Inherited: 0xa0)
struct UBTService_LineOfSight : UBTService_BlackboardBase {
	struct FBlackboardKeySelector TargetBlackboardKey; // 0xa0(0x28)
};

// Class Gobi.BTService_OutsideOfSneakVolume
// Size: 0xc0 (Inherited: 0xa0)
struct UBTService_OutsideOfSneakVolume : UBTService_BlackboardBase {
	struct FGameplayTagContainer ApplyTags; // 0xa0(0x20)
};

// Class Gobi.BTService_RegisterAttackAttempt
// Size: 0xa8 (Inherited: 0x78)
struct UBTService_RegisterAttackAttempt : UBTService {
	enum class ETimeframe Timeframe; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FBlackboardKeySelector EnemyBBKey; // 0x80(0x28)
};

// Class Gobi.BTService_ShouldHorde
// Size: 0x110 (Inherited: 0x78)
struct UBTService_ShouldHorde : UBTService {
	struct FBlackboardKeySelector AlertGenerationBBKey; // 0x78(0x28)
	struct FAIDataProviderFloatValue HeroLOSThreshold; // 0xa0(0x38)
	struct FAIDataProviderIntValue AggroBubble; // 0xd8(0x38)
};

// Class Gobi.BTService_SmartActor
// Size: 0x180 (Inherited: 0x78)
struct UBTService_SmartActor : UBTService {
	struct FBlackboardKeySelector SmartActorBBKey; // 0x78(0x28)
	struct FGameplayTagQuery RequiredSmartActorTags; // 0xa0(0x48)
	struct FAIDataProviderGameplayTagContainerValue BlockingSmartActorTags; // 0xe8(0x50)
	struct FAIDataProviderFloatValue MaxSearchDistance; // 0x138(0x38)
	char pad_170[0x10]; // 0x170(0x10)
};

// Class Gobi.BTService_TacticalSensor
// Size: 0xc0 (Inherited: 0x78)
struct UBTService_TacticalSensor : UBTService {
	struct FGameplayTagQuery AllowSensorTagQuery; // 0x78(0x48)
};

// Class Gobi.BTService_TeamSensor
// Size: 0x1a8 (Inherited: 0x78)
struct UBTService_TeamSensor : UBTService {
	struct FGameplayTagQuery AllowSensorTagQuery; // 0x78(0x48)
	struct FGameplayTagQuery TeammateTagQuery; // 0xc0(0x48)
	struct FBlackboardKeySelector TeammateTargetBBKey; // 0x108(0x28)
	struct FBlackboardKeySelector TeammateDistBBKey; // 0x130(0x28)
	struct FBlackboardKeySelector ShouldTeamTeleportBBKey; // 0x158(0x28)
	struct FBlackboardKeySelector TeamCentroidBBKey; // 0x180(0x28)
};

// Class Gobi.BTTask_NavigateTo
// Size: 0x168 (Inherited: 0xa0)
struct UBTTask_NavigateTo : UBTTask_BlackboardBase {
	struct FAIDataProviderFloatValue AcceptableRadius; // 0xa0(0x38)
	struct UNavigationQueryFilter* FilterClass; // 0xd8(0x08)
	float ObservedBlackboardValueTolerance; // 0xe0(0x04)
	char bAllowStrafe : 1; // 0xe4(0x01)
	char bAllowPartialPath : 1; // 0xe4(0x01)
	char bStopOnOverlap : 1; // 0xe4(0x01)
	char bResetVelocityOnAbort : 1; // 0xe4(0x01)
	char bObserveBlackboardValue : 1; // 0xe4(0x01)
	char pad_E4_5 : 3; // 0xe4(0x01)
	char pad_E5[0x3]; // 0xe5(0x03)
	bool bFailOnBetterClaim; // 0xe8(0x01)
	bool bPursueTarget; // 0xe9(0x01)
	char pad_EA[0x2]; // 0xea(0x02)
	struct FVector2D PursueTargetUpdateRate; // 0xec(0x08)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct FAIDataProviderUObjectValue SteeringBehaviorDataProvider; // 0xf8(0x38)
	struct FAIDataProviderUObjectValue SteeringControlDataProvider; // 0x130(0x38)
};

// Class Gobi.BTTask_RegisterAttackAttempt
// Size: 0xa0 (Inherited: 0x78)
struct UBTTask_RegisterAttackAttempt : UBTTaskNode {
	struct FBlackboardKeySelector EnemyBBKey; // 0x78(0x28)
};

// Class Gobi.BTTask_SetBlackboardTime
// Size: 0xa8 (Inherited: 0xa0)
struct UBTTask_SetBlackboardTime : UBTTask_BlackboardBase {
	float Offset; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Gobi.BTTask_SetBruteState
// Size: 0x80 (Inherited: 0x78)
struct UBTTask_SetBruteState : UBTTaskNode {
	enum class EBruteState BruteState; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Gobi.BTTask_SetHagState
// Size: 0x80 (Inherited: 0x78)
struct UBTTask_SetHagState : UBTTaskNode {
	enum class EHagState HagState; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Gobi.BTTask_TriggerAction
// Size: 0x148 (Inherited: 0x78)
struct UBTTask_TriggerAction : UBTTaskNode {
	struct FAIDataProviderGameplayTagContainerValue GameplayTags; // 0x78(0x50)
	enum class EGameplayActionMatchingTagType MatchingTagType; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
	struct FAIDataProviderGameplayTagQueryContainerValue MatchingTagQuery; // 0xd0(0x78)
};

// Class Gobi.BTTask_TriggerHorde
// Size: 0x88 (Inherited: 0x78)
struct UBTTask_TriggerHorde : UBTTaskNode {
	struct FString TriggerReason; // 0x78(0x10)
};

// Class Gobi.BTTask_UseSmartActor
// Size: 0xa0 (Inherited: 0x78)
struct UBTTask_UseSmartActor : UBTTaskNode {
	struct FBlackboardKeySelector SmartActorBlackboardKey; // 0x78(0x28)
};

// Class Gobi.BTTaskNode_CancelNavigate
// Size: 0x78 (Inherited: 0x78)
struct UBTTaskNode_CancelNavigate : UBTTaskNode {
};

// Class Gobi.BuildEnvironmentConfiguration
// Size: 0x50 (Inherited: 0x38)
struct UBuildEnvironmentConfiguration : UGameInstanceSubsystem {
	char pad_38[0x18]; // 0x38(0x18)
};

// Class Gobi.BulletPenetrationDefense
// Size: 0x88 (Inherited: 0x38)
struct UBulletPenetrationDefense : UDataAsset {
	struct TMap<enum class EPhysicalSurface, struct FBulletPenetrationDefenseDefinition> Surfaces; // 0x38(0x50)
};

// Class Gobi.BulletPenetrationComponent
// Size: 0x1f8 (Inherited: 0x150)
struct UBulletPenetrationComponent : UItemBaseComponent {
	char pad_150[0x38]; // 0x150(0x38)
	bool bIgnoreDeadActors; // 0x188(0x01)
	char pad_189[0x7]; // 0x189(0x07)
	struct FUnlimitedBulletPenetration UnlimitedPenetration; // 0x190(0x58)
	struct UBulletPenetrationDefense* PenetrationDefense; // 0x1e8(0x08)
	struct FBulletPenetrationTuning BulletPenetrationTuning; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
};

// Class Gobi.BurnCardScreen
// Size: 0x530 (Inherited: 0x530)
struct UBurnCardScreen : UUIScreen {
};

// Class Gobi.BurstAttackComponent
// Size: 0x3d8 (Inherited: 0x1c8)
struct UBurstAttackComponent : UAbilityComponent {
	char pad_1C8[0x8]; // 0x1c8(0x08)
	struct FMulticastInlineDelegate OnBurstEnded; // 0x1d0(0x10)
	struct FBurstMoveTickData MoveTickData; // 0x1e0(0x14)
	char pad_1F4[0xae]; // 0x1f4(0xae)
	bool bCanBurstOffLedges; // 0x2a2(0x01)
	bool bCanWalkOffLedgesDuringBurstEnd; // 0x2a3(0x01)
	bool bSqueezeAttack; // 0x2a4(0x01)
	bool bMeleeAttack; // 0x2a5(0x01)
	bool bSecondaryButtonCancelsBurst; // 0x2a6(0x01)
	char pad_2A7[0x1]; // 0x2a7(0x01)
	struct FGameplayTag MeleeAttackComponentTag; // 0x2a8(0x08)
	struct FName BurstCollisionProfileName; // 0x2b0(0x08)
	struct FName BurstMontagesName; // 0x2b8(0x08)
	struct FName RotationRateClampName; // 0x2c0(0x08)
	struct TArray<struct UAnimMontage*> BurstMontages; // 0x2c8(0x10)
	struct TArray<struct UAnimMontage*> BurstTraversalMontages; // 0x2d8(0x10)
	struct TArray<struct UAnimMontage*> BurstStopMontages; // 0x2e8(0x10)
	struct FGameplayTagContainer AppliedTags; // 0x2f8(0x20)
	struct FGameplayTagQuery BlockingTags; // 0x318(0x48)
	struct FGameplayTagContainer CancelTags; // 0x360(0x20)
	struct FGameplayTag BurstCollisionStumbleTag; // 0x380(0x08)
	struct TArray<struct UGameplayEffect*> BurstCollisionStumbleEffects; // 0x388(0x10)
	bool bUsesTuningData; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	struct FBurstAttackTuning BurstAttackTuning; // 0x39c(0x3c)

	void StopBurst(bool bImmediate); // Function Gobi.BurstAttackComponent.StopBurst // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.C4Placement
// Size: 0x2d8 (Inherited: 0x250)
struct AC4Placement : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x250(0x08)
	struct UUsableComponent* UsableComponent; // 0x258(0x08)
	struct UBoxComponent* UsableTriggerComponent; // 0x260(0x08)
	struct UAkComponent* AkComponent; // 0x268(0x08)
	struct UPointLightComponent* PointLightComponent; // 0x270(0x08)
	struct UGameCoachLessonsComponent* GameCoachLessonsComponent; // 0x278(0x08)
	struct USceneComponent* AlignComponent; // 0x280(0x08)
	struct UAnimMontage* UseMontage3P; // 0x288(0x08)
	struct UMaterialInterface* PlaceableMaterial; // 0x290(0x08)
	struct UMaterialInterface* C4PlacedMaterial; // 0x298(0x08)
	struct UAkAudioEvent* AKEC4Activated; // 0x2a0(0x08)
	struct UAkAudioEvent* AKEC4ActiveChirp; // 0x2a8(0x08)
	float PointLightMaxIntensity; // 0x2b0(0x04)
	float PointLightMinIntensity; // 0x2b4(0x04)
	float FirstFlashChirpDelay; // 0x2b8(0x04)
	float InitialFlashChirpDelay; // 0x2bc(0x04)
	int32_t InitialFlashChirpCountMax; // 0x2c0(0x04)
	float FlashChirpDelay; // 0x2c4(0x04)
	char pad_2C8[0x10]; // 0x2c8(0x10)

	void StopFlashChirps(); // Function Gobi.C4Placement.StopFlashChirps // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CableFerry
// Size: 0x3b0 (Inherited: 0x250)
struct ACableFerry : AActor {
	enum class EFerryState CurrentFerryState; // 0x250(0x01)
	char pad_251[0x27]; // 0x251(0x27)
	struct AGobiGameStateBase* GobiGameState; // 0x278(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x280(0x08)
	struct UStaticMeshComponent* Ferry; // 0x288(0x08)
	struct UStaticMeshComponent* FerryMotor; // 0x290(0x08)
	struct UCableComponent* FerryMotorCable1; // 0x298(0x08)
	struct UCableComponent* FerryMotorCable2; // 0x2a0(0x08)
	struct USceneComponent* IntactFerryRoot; // 0x2a8(0x08)
	struct USceneComponent* BrokenFerryRoot; // 0x2b0(0x08)
	struct UBoxComponent* UsableVolume; // 0x2b8(0x08)
	struct UBoxComponent* DamageVolume; // 0x2c0(0x08)
	struct TArray<struct UBoxComponent*> ZombieBlockVolumes; // 0x2c8(0x10)
	struct UBoxComponent* PlayerCheckerVolume; // 0x2d8(0x08)
	struct UBoxComponent* NavModifierVolume; // 0x2e0(0x08)
	struct USplineComponent* FerryTravelSpline; // 0x2e8(0x08)
	struct UUsableComponent* UsableComp; // 0x2f0(0x08)
	struct UUsableComponent* NotUsableComp; // 0x2f8(0x08)
	struct UHealthComponent* HealthComp; // 0x300(0x08)
	struct UGobiNavModifierComponent* GobiNavModifierComp; // 0x308(0x08)
	struct UUsableHighlightComponent* UsableHighlightComp; // 0x310(0x08)
	struct UGameplayEffectsComponent* GameplayEffectsComp; // 0x318(0x08)
	struct TArray<struct UStaticMeshComponent*> IntactFerry; // 0x320(0x10)
	struct TArray<struct UStaticMeshComponent*> IntactFerryMotor; // 0x330(0x10)
	struct TArray<struct UStaticMeshComponent*> BrokenFerry; // 0x340(0x10)
	struct TArray<struct UStaticMeshComponent*> BrokenFerryMotor; // 0x350(0x10)
	struct TArray<struct AHeroCharacter*> PlayersInVolume; // 0x360(0x10)
	struct TArray<struct FName> HeroAttachmentLocations; // 0x370(0x10)
	struct TArray<struct FName> FerryHitLocations; // 0x380(0x10)
	struct AActor* ThreatActorClassForBigObjects; // 0x390(0x08)
	struct TArray<struct AActor*> SpawnThreatActors; // 0x398(0x10)
	struct FGameplayTag FerrySceneComponentTag; // 0x3a8(0x08)

	void SetFerryState(enum class EFerryState DesiredState); // Function Gobi.CableFerry.SetFerryState // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CalloutTooltipUserWidget
// Size: 0x458 (Inherited: 0x450)
struct UCalloutTooltipUserWidget : UGobiUserWidget {
	char pad_450[0x8]; // 0x450(0x08)

	void EventAddTextTip(struct FText TipText); // Function Gobi.CalloutTooltipUserWidget.EventAddTextTip // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CameraManagerDebugger
// Size: 0x260 (Inherited: 0x250)
struct ACameraManagerDebugger : AActor {
	struct TWeakObjectPtr<struct AGobiPlayerCameraManager> CameraManager; // 0x250(0x08)
	char pad_258[0x8]; // 0x258(0x08)

	void DebugDrawHandler(struct UCanvas* Canvas, struct APlayerController* InPlayerController); // Function Gobi.CameraManagerDebugger.DebugDrawHandler // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CameraModifier_ScreenEffect
// Size: 0x630 (Inherited: 0x50)
struct UCameraModifier_ScreenEffect : UCameraModifier {
	struct FPostProcessSettings PostProcessSettings; // 0x50(0x560)
	bool bPlayOnce; // 0x5b0(0x01)
	char pad_5B1[0x7]; // 0x5b1(0x07)
	struct FFloatParameterBehavior PostProcessActivationBlend; // 0x5b8(0x10)
	struct FFloatParameterBehavior PostProcessDeactivationBlend; // 0x5c8(0x10)
	struct UMaterialInterface* ParentMaterial; // 0x5d8(0x08)
	struct TArray<struct FFloatMaterialParameter> ScalarParameters; // 0x5e0(0x10)
	struct TArray<struct FVectorMaterialParameter> VectorParameters; // 0x5f0(0x10)
	bool bUseDistanceFromSource; // 0x600(0x01)
	char pad_601[0x3]; // 0x601(0x03)
	float DistanceToStartScaling; // 0x604(0x04)
	float DistanceToRemoveEffectAt; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct UMaterialInstanceDynamic* MaterialInstance; // 0x610(0x08)
	struct TWeakObjectPtr<struct AActor> Source; // 0x618(0x08)
	char pad_620[0x8]; // 0x620(0x08)
	struct UScreenFXComponent* OwnerComponent; // 0x628(0x08)

	void ModifyPostProcess(float DeltaTime, float OutPostProcessBlendWeight, struct FPostProcessSettings OutPostProcessSettings); // Function Gobi.CameraModifier_ScreenEffect.ModifyPostProcess // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CameraModifier_ADSScreenEffect
// Size: 0x630 (Inherited: 0x630)
struct UCameraModifier_ADSScreenEffect : UCameraModifier_ScreenEffect {
};

// Class Gobi.CameraModifier_DamageScreenEffect
// Size: 0x650 (Inherited: 0x630)
struct UCameraModifier_DamageScreenEffect : UCameraModifier_ScreenEffect {
	struct TArray<struct FDamageThreshold> DamageThresholds; // 0x630(0x10)
	char pad_640[0x10]; // 0x640(0x10)
};

// Class Gobi.CameraModifier_InterpolateFOV
// Size: 0xd8 (Inherited: 0x50)
struct UCameraModifier_InterpolateFOV : UCameraModifier {
	float TargetFOVPct; // 0x50(0x04)
	char pad_54[0x8]; // 0x54(0x08)
	enum class EAlphaBlendOption BlendOption; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct UCurveFloat* CustomBlendCurve; // 0x60(0x08)
	char pad_68[0x50]; // 0x68(0x50)
	struct ULocalPlayer* OwnerPlayer; // 0xb8(0x08)
	char pad_C0[0x18]; // 0xc0(0x18)
};

// Class Gobi.CameraModifier_WeaponRecoil
// Size: 0x70 (Inherited: 0x50)
struct UCameraModifier_WeaponRecoil : UCameraModifier {
	char pad_50[0x20]; // 0x50(0x20)
};

// Class Gobi.CameraViewModifierComponent
// Size: 0xf8 (Inherited: 0xd8)
struct UCameraViewModifierComponent : UActorComponent {
	char pad_D8[0x18]; // 0xd8(0x18)
	struct UCameraModifier_InterpolateFOV* CameraModifierClass; // 0xf0(0x08)
};

// Class Gobi.CampaignRunComponent
// Size: 0x130 (Inherited: 0xd8)
struct UCampaignRunComponent : UActorComponent {
	char pad_D8[0x18]; // 0xd8(0x18)
	enum class EActiveCampaignRunType ActiveCampaignRunType; // 0xf0(0x04)
	enum class ECampaignRoundResult LastRoundResult; // 0xf4(0x04)
	int32_t RemainingRetries; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct UDedicatedServerManager* DedicatedServerManager; // 0x100(0x08)
	struct UCampaignRunManager* CampaignRunManager; // 0x108(0x08)
	struct UGobiPlayerProfileManager* PlayerProfileManager; // 0x110(0x08)
	char pad_118[0x10]; // 0x118(0x10)
	bool bCampaignRunAbandoned; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)

	void OnRep_CampaignRunAbandoned(); // Function Gobi.CampaignRunComponent.OnRep_CampaignRunAbandoned // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CampaignRunManager
// Size: 0xe8 (Inherited: 0x30)
struct UCampaignRunManager : UObject {
	char pad_30[0x38]; // 0x30(0x38)
	struct FCampaignRunDataV3 LoadedCampaignRunData; // 0x68(0x68)
	char pad_D0[0x18]; // 0xd0(0x18)
};

// Class Gobi.CampaignRunData
// Size: 0x70 (Inherited: 0x30)
struct UCampaignRunData : UObject {
	enum class ECampaignRoundResult LastRoundResult; // 0x30(0x04)
	bool bNeedsCardDraw; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	uint64_t GameplayCardManagerSeed; // 0x38(0x08)
	struct TArray<struct FActiveGameplayCard> StaticDirectorCards; // 0x40(0x10)
	struct TArray<struct FActiveGameplayCard> DynamicDirectorCards; // 0x50(0x10)
	struct TArray<struct FCampaignPlayerSlotData> CampaignPlayerSlotData; // 0x60(0x10)
};

// Class Gobi.BaseProjectile
// Size: 0x600 (Inherited: 0x250)
struct ABaseProjectile : AActor {
	char pad_250[0x1f0]; // 0x250(0x1f0)
	struct UProjectileMovementComponent* ProjectileMovement; // 0x440(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent; // 0x450(0x08)
	float MaxLifetime; // 0x458(0x04)
	bool bRequiresClearTraceCheck; // 0x45c(0x01)
	bool bRequiresClientCollision; // 0x45d(0x01)
	enum class ECollisionChannel ClearTraceChannel; // 0x45e(0x01)
	char pad_45F[0x1]; // 0x45f(0x01)
	struct FGameplayTag InterpComponentGameplayTag; // 0x460(0x08)
	struct FMulticastInlineDelegate OnProjectileImpact; // 0x468(0x10)
	uint16_t ProjectileImpactBehavior; // 0x478(0x02)
	char pad_47A[0x6]; // 0x47a(0x06)
	struct FGameplayTagQuery ApplyImpactBehaviorToOverlappingActors; // 0x480(0x48)
	float HitDestroyDelay; // 0x4c8(0x04)
	float StayHiddenDuration; // 0x4cc(0x04)
	float DeathDestroyDelay; // 0x4d0(0x04)
	bool bWaterDeepDestroys; // 0x4d4(0x01)
	char pad_4D5[0x3]; // 0x4d5(0x03)
	float WaterDeepDepth; // 0x4d8(0x04)
	char pad_4DC[0x4]; // 0x4dc(0x04)
	struct FGameplayTag CollisionComponentGameplayTag; // 0x4e0(0x08)
	char pad_4E8[0x10]; // 0x4e8(0x10)
	struct TSet<struct AActor*> ActorsHit; // 0x4f8(0x50)
	struct FGameplayCueHandle ImpactCueHandle; // 0x548(0x18)
	struct FGameplayTag ImpactCue; // 0x560(0x08)
	struct UImpactEffectConfig* ImpactEffectConfig; // 0x568(0x08)
	bool bSpawnImpactDeferred; // 0x570(0x01)
	char pad_571[0x7]; // 0x571(0x07)
	struct UAkAudioEvent* ImpactAudioEvent; // 0x578(0x08)
	bool bAlsoImpactGroundIfImpactedCharacter; // 0x580(0x01)
	char pad_581[0x3]; // 0x581(0x03)
	float GroundTraceDownDistance; // 0x584(0x04)
	struct UAkAudioEvent* TravelLoopAudioEvent; // 0x588(0x08)
	struct UAkAudioEvent* TravelLoopStopAudioEvent; // 0x590(0x08)
	char pad_598[0x8]; // 0x598(0x08)
	bool bApplyDamage; // 0x5a0(0x01)
	char pad_5A1[0x3]; // 0x5a1(0x03)
	float DamageAmount; // 0x5a4(0x04)
	struct UGobiDamageType* DamageType; // 0x5a8(0x08)
	bool bIgnoreIncapHeroImpacts; // 0x5b0(0x01)
	char pad_5B1[0xf]; // 0x5b1(0x0f)
	struct TArray<struct FHitResult> ReplicatedImpacts; // 0x5c0(0x10)
	char pad_5D0[0x8]; // 0x5d0(0x08)
	struct UParticleSystem* EmitterOnSpawn; // 0x5d8(0x08)
	char pad_5E0[0x8]; // 0x5e0(0x08)
	struct UParticleSystem* EmitterOnImpact; // 0x5e8(0x08)
	bool bImpactEmitterInheritsImpactNormalRotation; // 0x5f0(0x01)
	char pad_5F1[0x3]; // 0x5f1(0x03)
	struct FRotator AdditionalImpactEmitterRotation; // 0x5f4(0x0c)

	void OnRep_Impacts(); // Function Gobi.BaseProjectile.OnRep_Impacts // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CapsuleProjectile
// Size: 0x608 (Inherited: 0x600)
struct ACapsuleProjectile : ABaseProjectile {
	struct UCapsuleComponent* CollisionComponent; // 0x600(0x08)
};

// Class Gobi.CarAlarmGameCoachLesson
// Size: 0x490 (Inherited: 0x488)
struct UCarAlarmGameCoachLesson : UGobiGameCoachLesson {
	float CarAlarmTeachDuration; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)
};

// Class Gobi.CarAlarmGameCoachLessonComponent
// Size: 0x108 (Inherited: 0x108)
struct UCarAlarmGameCoachLessonComponent : UGameCoachLessonsComponent {
};

// Class Gobi.StaticCaravans
// Size: 0x78 (Inherited: 0x38)
struct UStaticCaravans : UDataAsset {
	struct FStaticCaravan TutorialCaravan; // 0x38(0x30)
	struct TArray<struct FStaticCaravanChain> CaravanChains; // 0x68(0x10)
};

// Class Gobi.CaravanManager
// Size: 0x70 (Inherited: 0x30)
struct UCaravanManager : UGobiObject {
	char pad_30[0x10]; // 0x30(0x10)
	int32_t MaxCaravans; // 0x40(0x04)
	struct TWeakObjectPtr<struct UUIScreenManager> OwningScreenManager; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct FProfileCaravanData ProfileCaravanData; // 0x50(0x10)
	char pad_60[0x10]; // 0x60(0x10)
};

// Class Gobi.CaravanProgressScreen
// Size: 0x640 (Inherited: 0x530)
struct UCaravanProgressScreen : UUIScreen {
	char pad_530[0x70]; // 0x530(0x70)
	bool bWaitingOnRequest; // 0x5a0(0x01)
	char pad_5A1[0x9f]; // 0x5a1(0x9f)

	void UpdateWaiting(bool bWaiting); // Function Gobi.CaravanProgressScreen.UpdateWaiting // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CaravanScreen
// Size: 0x570 (Inherited: 0x560)
struct UCaravanScreen : UHubChildScreen {
	char pad_560[0x10]; // 0x560(0x10)

	void SetCaravanProgressScreenContext(struct FCaravanInstance InCaravanInstance); // Function Gobi.CaravanScreen.SetCaravanProgressScreenContext // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CaravanSelectPanelUserWidget
// Size: 0x480 (Inherited: 0x450)
struct UCaravanSelectPanelUserWidget : UGobiUserWidget {
	struct TArray<struct FCaravanInstance> LastKnownCaravans; // 0x450(0x10)
	char pad_460[0x20]; // 0x460(0x20)

	void PumpAnimations(); // Function Gobi.CaravanSelectPanelUserWidget.PumpAnimations // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardDragPayload
// Size: 0x50 (Inherited: 0x30)
struct UCardDragPayload : UObject {
	struct FDataTableRowHandle CardRowHandle; // 0x30(0x20)
};

// Class Gobi.CardDrawOverviewUserWidget
// Size: 0x4f8 (Inherited: 0x450)
struct UCardDrawOverviewUserWidget : UGobiUserWidget {
	char pad_450[0x28]; // 0x450(0x28)
	struct FCardAnim SourceToCenter; // 0x478(0x20)
	struct FCardAnim CenterToDest; // 0x498(0x20)
	struct FCardAnim SourceShrink; // 0x4b8(0x20)
	struct FCardAnim DestExpand; // 0x4d8(0x20)

	void StartAnimation(); // Function Gobi.CardDrawOverviewUserWidget.StartAnimation // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardDrawScreen
// Size: 0x5f0 (Inherited: 0x530)
struct UCardDrawScreen : UUIScreen {
	struct UAkAudioEvent* DefaultCardClickedSound; // 0x530(0x08)
	struct UAkAudioEvent* LightCardClickedSound; // 0x538(0x08)
	struct UAkAudioEvent* MediumCardClickedSound; // 0x540(0x08)
	struct UAkAudioEvent* HeavyCardClickedSound; // 0x548(0x08)
	struct UAkAudioEvent* WildCardClickedSound; // 0x550(0x08)
	float CardFlipDelay; // 0x558(0x04)
	bool bHasPlayedBurnCard; // 0x55c(0x01)
	char pad_55D[0x93]; // 0x55d(0x93)

	void UpdateDrawCount(int32_t InDrawCount); // Function Gobi.CardDrawScreen.UpdateDrawCount // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardFan
// Size: 0x718 (Inherited: 0x160)
struct UCardFan : UPanelWidget {
	struct FMulticastInlineDelegate OnShowExpandedCard; // 0x160(0x10)
	struct FMulticastInlineDelegate OnUserScrolled; // 0x170(0x10)
	struct UUserWidget* CardWidgetClass; // 0x180(0x08)
	struct FScrollBarStyle ScrollBarStyle; // 0x188(0x518)
	enum class ESlateVisibility ScrollBarVisibility; // 0x6a0(0x01)
	enum class EConsumeMouseWheel ConsumeMouseWheel; // 0x6a1(0x01)
	char pad_6A2[0x2]; // 0x6a2(0x02)
	struct FVector2D ScrollbarThickness; // 0x6a4(0x08)
	struct FMargin ScrollbarPadding; // 0x6ac(0x10)
	bool bAlwaysShowScrollbar; // 0x6bc(0x01)
	bool bAlwaysShowScrollbarTrack; // 0x6bd(0x01)
	bool bScrollBarHasSizeWhenNotInUse; // 0x6be(0x01)
	bool bAllowOverscroll; // 0x6bf(0x01)
	bool bAnimateWheelScrolling; // 0x6c0(0x01)
	bool bHandleNavigation; // 0x6c1(0x01)
	enum class EDescendantScrollDestination NavigationDestination; // 0x6c2(0x01)
	char pad_6C3[0x1]; // 0x6c3(0x01)
	float NavigationScrollPadding; // 0x6c4(0x04)
	struct FKey ClickDragKey; // 0x6c8(0x18)
	bool bAllowClickDragScrolling; // 0x6e0(0x01)
	char pad_6E1[0x3]; // 0x6e1(0x03)
	float WheelScrollMultiplier; // 0x6e4(0x04)
	float ScrollAnimationSpeed; // 0x6e8(0x04)
	float MinChildSize; // 0x6ec(0x04)
	float ChildSpacing; // 0x6f0(0x04)
	char pad_6F4[0x14]; // 0x6f4(0x14)
	struct UUserWidget* ExpandedCardWidget; // 0x708(0x08)
	char pad_710[0x8]; // 0x710(0x08)

	void SetWheelScrollMultiplier(float NewWheelScrollMultiplier); // Function Gobi.CardFan.SetWheelScrollMultiplier // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardFanSlot
// Size: 0x50 (Inherited: 0x40)
struct UCardFanSlot : UPanelSlot {
	enum class EVerticalAlignment VerticalAlignment; // 0x40(0x01)
	char pad_41[0xf]; // 0x41(0x0f)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function Gobi.CardFanSlot.SetVerticalAlignment // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardFilterUserWidget
// Size: 0x478 (Inherited: 0x450)
struct UCardFilterUserWidget : UGobiUserWidget {
	struct FMulticastInlineDelegate OnFilterChanged; // 0x450(0x10)
	struct TArray<enum class ECardFilter> Filters; // 0x460(0x10)
	enum class ECardFilter DefaultFilter; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)

	void SelectFilter(enum class ECardFilter NewFilter, bool bForceUpdate); // Function Gobi.CardFilterUserWidget.SelectFilter // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardInsertUserWidget
// Size: 0x4f0 (Inherited: 0x450)
struct UCardInsertUserWidget : UGobiUserWidget {
	struct UTextBlock* TitleText; // 0x450(0x08)
	struct UTextBlock* WrapTitleText; // 0x458(0x08)
	struct UWidgetSwitcher* TitleWidgetSwitcher; // 0x460(0x08)
	struct UTextBlock* TypeText; // 0x468(0x08)
	struct URichTextBlock* BodyText; // 0x470(0x08)
	struct URichTextBlock* SharedBodyText; // 0x478(0x08)
	char pad_480[0x70]; // 0x480(0x70)

	void UpdateTitleForLanguage(); // Function Gobi.CardInsertUserWidget.UpdateTitleForLanguage // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardListenerComponent
// Size: 0xf0 (Inherited: 0xd8)
struct UCardListenerComponent : UActorComponent {
	struct TArray<struct FCardRequestToCueData> CardRequestToTagMapping; // 0xd8(0x10)
	int32_t RequestCounter; // 0xe8(0x04)
	int32_t RequestIndex; // 0xec(0x04)

	void OnRep_RequestIndex(); // Function Gobi.CardListenerComponent.OnRep_RequestIndex // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardPaginatorUserWidget
// Size: 0x4e8 (Inherited: 0x450)
struct UCardPaginatorUserWidget : UGobiUserWidget {
	struct FMulticastInlineDelegate OnDragDrop; // 0x450(0x10)
	struct FMulticastInlineDelegate OnCardFocused; // 0x460(0x10)
	struct FMulticastInlineDelegate OnCardUnfocused; // 0x470(0x10)
	int32_t CARDS_PER_PAGE; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct USelectableGameplayCardUserWidget* CardClass; // 0x488(0x08)
	char pad_490[0x58]; // 0x490(0x58)

	void SetEquippedCards(struct TArray<struct FDataTableRowHandle> InEquippedCards); // Function Gobi.CardPaginatorUserWidget.SetEquippedCards // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardStatsUserWidget
// Size: 0x4c8 (Inherited: 0x450)
struct UCardStatsUserWidget : UGobiUserWidget {
	struct TSet<struct UStatEntryUserWidget*> StatWidgets; // 0x450(0x50)
	struct UAffinityStatsPopup* AffinityStatsPopup; // 0x4a0(0x08)
	struct UAffinityStatsPopup* AffinityPopupClass; // 0x4a8(0x08)
	char pad_4B0[0x18]; // 0x4b0(0x18)

	void OnAffinityStatsClicked(struct UGobiUserWidget* Widget); // Function Gobi.CardStatsUserWidget.OnAffinityStatsClicked // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardSystemAnalyticsComponent
// Size: 0x200 (Inherited: 0xd8)
struct UCardSystemAnalyticsComponent : UActorComponent {
	char pad_D8[0x128]; // 0xd8(0x128)

	void ReceiveZombieMutationsChanged(); // Function Gobi.CardSystemAnalyticsComponent.ReceiveZombieMutationsChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CardTooltipUserWidget
// Size: 0x528 (Inherited: 0x450)
struct UCardTooltipUserWidget : UGobiUserWidget {
	struct UWidget* HostWidget; // 0x450(0x08)
	struct FDataTableRowHandle HostCardRowHandle; // 0x458(0x20)
	struct UPerkDetailsEntryUserWidget* PerkEntryClass; // 0x478(0x08)
	float PerkDescWrapWidth; // 0x480(0x04)
	char pad_484[0xa4]; // 0x484(0xa4)

	void ToggleGamepadTooltip(); // Function Gobi.CardTooltipUserWidget.ToggleGamepadTooltip // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeData
// Size: 0xa0 (Inherited: 0x38)
struct UChallengeData : UDataAsset {
	struct UTexture2D* Banner; // 0x38(0x08)
	struct FText DisplayName; // 0x40(0x18)
	struct FDataTableRowHandle Map; // 0x58(0x20)
	struct TArray<struct FDataTableRowHandle> ChallengeCards; // 0x78(0x10)
	struct TArray<struct UChallengeObjectiveData*> ChallengeObjectives; // 0x88(0x10)
	int32_t InitialCurrency; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Gobi.ChallengeGameMode
// Size: 0x520 (Inherited: 0x520)
struct AChallengeGameMode : AMissionGameMode {
};

// Class Gobi.GobiGameStateBase
// Size: 0x500 (Inherited: 0x2c0)
struct AGobiGameStateBase : AGameState {
	struct UVoiceRoutingComponent* VoiceRoutingComponent; // 0x2c0(0x08)
	struct UCharacterSelectLevelManager* CharacterSelectLevelManager; // 0x2c8(0x08)
	enum class EGameModeType GameModeType; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct TArray<struct FGobiReadyStatus> PlayerReadyStatuses; // 0x2d8(0x10)
	float ActiveTransitionDuration; // 0x2e8(0x04)
	float LastTransitionTime; // 0x2ec(0x04)
	struct FString PoolConfig; // 0x2f0(0x10)
	struct TArray<int32_t> TeamScores; // 0x300(0x10)
	struct APlayerSlotManager* PlayerSlotManagerClass; // 0x310(0x08)
	struct APlayerSlot* PlayerSlotClass; // 0x318(0x08)
	struct APlayerSlotManager* PlayerSlotManager; // 0x320(0x08)
	struct APlayerAssetLoader* PlayerAssetLoader; // 0x328(0x08)
	int32_t NumTimesMissionRestarted; // 0x330(0x04)
	char pad_334[0x4]; // 0x334(0x04)
	struct UGameplayCardManager* GameplayCardManager; // 0x338(0x08)
	struct FLevelTravelDetails LevelTravelDetails; // 0x340(0x38)
	struct UZombieMutationManager* ZombieMutationManager; // 0x378(0x08)
	struct UCampaignRunComponent* CampaignRunComponent; // 0x380(0x08)
	struct UOmenConfigSetAsset* OmenConfigSet; // 0x388(0x08)
	struct FMulticastInlineDelegate OnAllPlayersReady; // 0x390(0x10)
	struct FMulticastInlineDelegate OnPlayerReadyChanged; // 0x3a0(0x10)
	int32_t TotalElapsedTime; // 0x3b0(0x04)
	bool bFirstMapInChain; // 0x3b4(0x01)
	bool bShouldSkipCardDraw; // 0x3b5(0x01)
	char pad_3B6[0x2]; // 0x3b6(0x02)
	int32_t ZombieMeshRandomSeed; // 0x3b8(0x04)
	char pad_3BC[0x4]; // 0x3bc(0x04)
	struct FMulticastInlineDelegate OnMatchStarted; // 0x3c0(0x10)
	struct FMulticastInlineDelegate OnMatchEnded; // 0x3d0(0x10)
	struct FMulticastInlineDelegate OnLeavingMap; // 0x3e0(0x10)
	struct FMulticastInlineDelegate OnWaitingToResetMatch; // 0x3f0(0x10)
	struct FMulticastInlineDelegate OnResetMission; // 0x400(0x10)
	struct FMulticastInlineDelegate OnResetCompleted; // 0x410(0x10)
	struct FMulticastInlineDelegate OnCreditsStarted; // 0x420(0x10)
	struct FMulticastInlineDelegate OnPlayerStatesChanged; // 0x430(0x10)
	struct FMulticastInlineDelegate OnWaitForReadyPlayers; // 0x440(0x10)
	struct FMulticastInlineDelegate OnMatchStateChanged; // 0x450(0x10)
	char pad_460[0x70]; // 0x460(0x70)
	struct TArray<struct FGobiReadyStatus> OldPlayerStatuses; // 0x4d0(0x10)
	struct AGobiGameStateDebugger* GameStateDebugger; // 0x4e0(0x08)
	struct UMissionManager* MissionManager; // 0x4e8(0x08)
	bool bTutorial; // 0x4f0(0x01)
	bool bIsSinglePlayer; // 0x4f1(0x01)
	char pad_4F2[0x6]; // 0x4f2(0x06)
	struct AGameplayAnalyticsManager* AnalyticsManager; // 0x4f8(0x08)

	void OnRep_ZombieMeshRandomSeed(); // Function Gobi.GobiGameStateBase.OnRep_ZombieMeshRandomSeed // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GobiGameState
// Size: 0x610 (Inherited: 0x500)
struct AGobiGameState : AGobiGameStateBase {
	struct FMulticastInlineDelegate OnSafeRoomStateChanged; // 0x500(0x10)
	struct FMulticastInlineDelegate OnPlayerInsideChanged; // 0x510(0x10)
	struct FMulticastInlineDelegate OnMissionDifficultyChanged; // 0x520(0x10)
	struct FMulticastInlineDelegate OnCampaignEnded; // 0x530(0x10)
	struct FMulticastInlineDelegate OnMissionEnded; // 0x540(0x10)
	enum class EPartySafeRoomState PartySafeRoomState; // 0x550(0x01)
	struct FMissionState MissionState; // 0x551(0x02)
	bool bEnableVoice; // 0x553(0x01)
	enum class EMissionDifficulty MissionDifficulty; // 0x554(0x01)
	char pad_555[0x3]; // 0x555(0x03)
	float FriendlyFireModifier; // 0x558(0x04)
	char pad_55C[0x4]; // 0x55c(0x04)
	struct UGameplayCueManager* GameplayCueManager; // 0x560(0x08)
	struct FSyncedPacketSimulationSettings PacketSimulationSettings; // 0x568(0x18)
	char pad_580[0x18]; // 0x580(0x18)
	struct UCharacterMovementDebugEndpoint* CharacterMovementDebugEndpoint; // 0x598(0x08)
	struct UServerStatusComponent* ServerStatusComponent; // 0x5a0(0x08)
	uint32_t GameThreatLevel; // 0x5a8(0x04)
	struct FGameplayTag OnThreatLevelRaised; // 0x5ac(0x08)
	char pad_5B4[0x18]; // 0x5b4(0x18)
	struct FGameplayTag OnThreatLevelLowered; // 0x5cc(0x08)
	char pad_5D4[0x18]; // 0x5d4(0x18)
	float GameThreatNormalized; // 0x5ec(0x04)
	float GameThreat; // 0x5f0(0x04)
	enum class EPacingPhase PacingPhase; // 0x5f4(0x01)
	char pad_5F5[0x3]; // 0x5f5(0x03)
	int32_t CurrentMapChainIndex; // 0x5f8(0x04)
	char pad_5FC[0x4]; // 0x5fc(0x04)
	struct FString NextMapToUnlock; // 0x600(0x10)

	bool WasMissionSuccessfull(); // Function Gobi.GobiGameState.WasMissionSuccessfull // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeGameState
// Size: 0x618 (Inherited: 0x610)
struct AChallengeGameState : AGobiGameState {
	struct UChallengeMonitorComponent* ChallengeMonitorComponent; // 0x610(0x08)
};

// Class Gobi.ChallengeHUDUserWidget
// Size: 0x450 (Inherited: 0x450)
struct UChallengeHUDUserWidget : UGobiUserWidget {

	void UpdateTracker(struct UChallengeObjectiveTracker* Tracker); // Function Gobi.ChallengeHUDUserWidget.UpdateTracker // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeMonitorComponent
// Size: 0x130 (Inherited: 0xd8)
struct UChallengeMonitorComponent : UActorComponent {
	struct FMulticastInlineDelegate OnChallengeSuccess; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnChallengeFailure; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnChallengeObjectivesUpdated; // 0xf8(0x10)
	bool bGauntlet; // 0x108(0x01)
	char pad_109[0x3]; // 0x109(0x03)
	struct FChallengeIndexPair ChallengeIndex; // 0x10c(0x08)
	char pad_114[0xc]; // 0x114(0x0c)
	struct TArray<struct UChallengeObjectiveTracker*> ObjectiveTrackers; // 0x120(0x10)

	void OnRep_ObjectiveTrackers(); // Function Gobi.ChallengeMonitorComponent.OnRep_ObjectiveTrackers // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeObjectiveData
// Size: 0x70 (Inherited: 0x30)
struct UChallengeObjectiveData : UObject {
	struct UTexture2D* Icon; // 0x30(0x08)
	struct FText DisplayName; // 0x38(0x18)
	struct FText Description; // 0x50(0x18)
	struct UChallengeObjectiveTracker* TrackerClass; // 0x68(0x08)
};

// Class Gobi.ChallengeObjectiveDamageDealtData
// Size: 0xc0 (Inherited: 0x70)
struct UChallengeObjectiveDamageDealtData : UChallengeObjectiveData {
	struct FGameplayTagQuery DamageTypeQuery; // 0x70(0x48)
	int32_t IgnoreDamageContextFlags; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
};

// Class Gobi.ChallengeObjectiveTracker
// Size: 0x48 (Inherited: 0x30)
struct UChallengeObjectiveTracker : UGobiObject {
	float Points; // 0x30(0x04)
	float Value; // 0x34(0x04)
	struct UChallengeObjectiveData* ObjectiveData; // 0x38(0x08)
	struct UChallengeMonitorComponent* ChallengeMonitor; // 0x40(0x08)

	void Reset(); // Function Gobi.ChallengeObjectiveTracker.Reset // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeObjectivePlayerSlotTracker
// Size: 0x50 (Inherited: 0x48)
struct UChallengeObjectivePlayerSlotTracker : UChallengeObjectiveTracker {
	enum class EGobiTeam SlotsToWatch; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)

	void OnSlotsUpdated(); // Function Gobi.ChallengeObjectivePlayerSlotTracker.OnSlotsUpdated // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeObjectiveDamageDealtTracker
// Size: 0xa8 (Inherited: 0x50)
struct UChallengeObjectiveDamageDealtTracker : UChallengeObjectivePlayerSlotTracker {
	char pad_50[0x58]; // 0x50(0x58)

	void OnInflictDamage(struct FDamageInfo DamageInfo); // Function Gobi.ChallengeObjectiveDamageDealtTracker.OnInflictDamage // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeObjectiveKillData
// Size: 0xb8 (Inherited: 0x70)
struct UChallengeObjectiveKillData : UChallengeObjectiveData {
	struct FGameplayTagQuery EnemyTypeQuery; // 0x70(0x48)
};

// Class Gobi.ChallengeObjectiveKillTracker
// Size: 0xa8 (Inherited: 0x50)
struct UChallengeObjectiveKillTracker : UChallengeObjectivePlayerSlotTracker {
	char pad_50[0x58]; // 0x50(0x58)

	void OnInflictDamage(struct FDamageInfo DamageInfo); // Function Gobi.ChallengeObjectiveKillTracker.OnInflictDamage // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChallengeObjectiveTeamHealthTracker
// Size: 0xa0 (Inherited: 0x50)
struct UChallengeObjectiveTeamHealthTracker : UChallengeObjectivePlayerSlotTracker {
	char pad_50[0x50]; // 0x50(0x50)

	void OnPlayerHealthChanged(float NewHealth, float DeltaHealth); // Function Gobi.ChallengeObjectiveTeamHealthTracker.OnPlayerHealthChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterAudioComponent
// Size: 0x2d8 (Inherited: 0xd8)
struct UCharacterAudioComponent : UActorComponent {
	char pad_D8[0x18]; // 0xd8(0x18)
	bool bUseCrowdSound; // 0xf0(0x01)
	enum class ECharacterBodySize BodySize; // 0xf1(0x01)
	char pad_F2[0x2]; // 0xf2(0x02)
	float MovementSpeedMaxDivisor; // 0xf4(0x04)
	struct UDataTable* GameplayTagSetDataTable; // 0xf8(0x08)
	struct UAkSkeletalComponent* AudioEmitter; // 0x100(0x08)
	struct USoundCollectionAsset* SelectedSoundCollection; // 0x108(0x08)
	struct TWeakObjectPtr<struct AGobiCharacter> OwningCharacter; // 0x110(0x08)
	struct FStartingStateAndParams StartingStateAndParams; // 0x118(0xb0)
	struct AGobiSpatialAudioVolume* CurrentSpatialVolume; // 0x1c8(0x08)
	bool bWetPrimed; // 0x1d0(0x01)
	char pad_1D1[0x7]; // 0x1d1(0x07)
	struct UAkAudioEvent* WaterEnter; // 0x1d8(0x08)
	struct UAkAudioEvent* WaterExit; // 0x1e0(0x08)
	struct UAkAudioEvent* WaterMove; // 0x1e8(0x08)
	struct UAkAudioEvent* WaterDrips; // 0x1f0(0x08)
	struct UAkAudioEvent* SpectateSwap; // 0x1f8(0x08)
	bool bStartingStatesDebug; // 0x200(0x01)
	char pad_201[0x3]; // 0x201(0x03)
	struct FName DialogueBoneName; // 0x204(0x08)
	char pad_20C[0xc]; // 0x20c(0x0c)
	struct FDelegate VoiceLineFinishedCallback; // 0x218(0x10)
	char pad_228[0x10]; // 0x228(0x10)
	struct FString CurrentVoiceLine; // 0x238(0x10)
	struct UAkAudioEvent* DialogueStopEvent; // 0x248(0x08)
	char pad_250[0x60]; // 0x250(0x60)
	struct TArray<struct FMusicDamageTypeEvent> DamageDrivenMusicEvents; // 0x2b0(0x10)
	char pad_2C0[0x18]; // 0x2c0(0x18)

	void VoiceLineFinished(enum class EAkCallbackType CallbackType, struct UAkCallbackInfo* CallbackInfo); // Function Gobi.CharacterAudioComponent.VoiceLineFinished // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterAudioManagerSubsystem
// Size: 0x50 (Inherited: 0x38)
struct UCharacterAudioManagerSubsystem : UWorldSubsystem {
	struct UAudioMutilationManager* MutilationManager; // 0x38(0x08)
	struct USharedSoundManager* SharedSoundManager; // 0x40(0x08)
	char pad_48[0x8]; // 0x48(0x08)
};

// Class Gobi.CharacterBlockingNoWallGrabVolume
// Size: 0x288 (Inherited: 0x288)
struct ACharacterBlockingNoWallGrabVolume : AVolume {
};

// Class Gobi.CharacterBlockingVolume
// Size: 0x288 (Inherited: 0x288)
struct ACharacterBlockingVolume : ABlockingVolume {
};

// Class Gobi.CharacterCustomizationManager
// Size: 0x290 (Inherited: 0x250)
struct ACharacterCustomizationManager : AInfo {
	struct ACustomizationMannequin* CustomizationMannequin; // 0x250(0x08)
	struct AWeaponCustomizationMannequin* WeaponCustomizationMannequin; // 0x258(0x08)
	struct FViewTargetTransitionParams ViewTargetTransitionParams; // 0x260(0x10)
	struct ACameraActor* CharacterCustomizationCamera; // 0x270(0x08)
	struct ACameraActor* WeaponCustomizationCamera; // 0x278(0x08)
	struct TArray<struct FCharacterRelatedActors> CharacterToActorMap; // 0x280(0x10)

	void ExitWeaponCustomization(struct AGobiPlayerState* GobiPlayerState); // Function Gobi.CharacterCustomizationManager.ExitWeaponCustomization // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterCustomizationScreen
// Size: 0x6e0 (Inherited: 0x530)
struct UCharacterCustomizationScreen : UUIScreen {
	char pad_530[0x1b0]; // 0x530(0x1b0)

	void SetUnlockCount(int32_t NumUnlocked, int32_t TotalUnlocks); // Function Gobi.CharacterCustomizationScreen.SetUnlockCount // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterCustomizationUtils
// Size: 0x30 (Inherited: 0x30)
struct UCharacterCustomizationUtils : UBlueprintFunctionLibrary {

	int32_t GetNumUnlockedCharacterCustomizations(struct APlayerController* PlayerController, struct FDataTableRowHandle CharacterRowHandle, enum class ECharacterCustomizationSlot Slot); // Function Gobi.CharacterCustomizationUtils.GetNumUnlockedCharacterCustomizations // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterDetailsUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UCharacterDetailsUserWidget : UGobiUserWidget {
	struct UPerkDetailsEntryUserWidget* PerkEntryClass; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)

	void SetCards(struct TArray<struct FDataTableRowHandle> CardHandles); // Function Gobi.CharacterDetailsUserWidget.SetCards // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GobiDialogueComponent
// Size: 0x1f0 (Inherited: 0x1d8)
struct UGobiDialogueComponent : UDialogueComponent {
	char pad_1D8[0x8]; // 0x1d8(0x08)
	struct TArray<struct FName> PvPZombieBlacklist; // 0x1e0(0x10)
};

// Class Gobi.CharacterDialogueComponent
// Size: 0x218 (Inherited: 0x1f0)
struct UCharacterDialogueComponent : UGobiDialogueComponent {
	struct TWeakObjectPtr<struct AGobiCharacter> OwnerCharacter; // 0x1f0(0x08)
	char pad_1F8[0x20]; // 0x1f8(0x20)

	void OnOwnerLifeStateChanged(struct FGameplayTag NewStateTag, struct FGameplayTag PreviousStateTag); // Function Gobi.CharacterDialogueComponent.OnOwnerLifeStateChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterEmitterComponent
// Size: 0x198 (Inherited: 0xd8)
struct UCharacterEmitterComponent : UActorComponent {
	char pad_D8[0x30]; // 0xd8(0x30)
	struct FGameplayEffectContext EffectContext; // 0x108(0x80)
	struct FName CollisionProfile; // 0x188(0x08)
	float LineOfSightForgivenessTime; // 0x190(0x04)
	char pad_194[0x4]; // 0x194(0x04)

	void RemoveDef(struct FCharacterEmitterDef CharacterEmitterDef); // Function Gobi.CharacterEmitterComponent.RemoveDef // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterEmitterMod
// Size: 0x188 (Inherited: 0x88)
struct UCharacterEmitterMod : UGameplayMod {
	struct FCharacterEmitterDef CharacterEmitterDef; // 0x88(0x100)
};

// Class Gobi.CharacterLineupLayoutManager
// Size: 0x298 (Inherited: 0x250)
struct ACharacterLineupLayoutManager : AInfo {
	char pad_250[0x8]; // 0x250(0x08)
	struct TArray<struct ACustomizationMannequin*> Mannequins; // 0x258(0x10)
	struct ATargetPoint* CharacterSelectTargetPoint; // 0x268(0x08)
	struct TArray<struct ATargetPoint*> PreRoundLockInTargetPoints; // 0x270(0x10)
	struct TArray<struct ATargetPoint*> PostRoundTargetPoints; // 0x280(0x10)
	struct ACameraActor* Camera; // 0x290(0x08)

	void SetLayoutType(enum class ELayoutType LayoutType); // Function Gobi.CharacterLineupLayoutManager.SetLayoutType // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterMovementDebugEndpoint
// Size: 0x198 (Inherited: 0xd8)
struct UCharacterMovementDebugEndpoint : UActorComponent {
	int32_t Port; // 0xd8(0x04)
	char pad_DC[0x1c]; // 0xdc(0x1c)
	struct TMap<struct ACharacter*, int32_t> RecordingCharacters; // 0xf8(0x50)
	struct TSet<struct ACharacter*> LocalRecordingCharacters; // 0x148(0x50)

	void OnRep_Port(); // Function Gobi.CharacterMovementDebugEndpoint.OnRep_Port // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterMusicInfo
// Size: 0x130 (Inherited: 0x38)
struct UCharacterMusicInfo : UDataAsset {
	struct AActor* ClassFilter; // 0x38(0x08)
	struct UAkAudioEvent* CharacterMusicStart; // 0x40(0x08)
	struct UAkAudioEvent* CharacterMusicStop; // 0x48(0x08)
	float MusicDelayDueToDeath; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct FString DistanceRTPCName; // 0x58(0x10)
	enum class EMusicEventType SupportedCharacterEvents; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float EngagedDistance; // 0x6c(0x04)
	float MaxDistance; // 0x70(0x04)
	struct FName PassiveMusicState; // 0x74(0x08)
	struct FName DistantMusicState; // 0x7c(0x08)
	bool bWantsBeatSync; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	struct FName StateGroup; // 0x88(0x08)
	struct FGameplayTag CharacterTag; // 0x90(0x08)
	struct TMap<struct FGameplayTag, struct FCharacterMusicStateConfig> TagToStateMapping; // 0x98(0x50)
	char pad_E8[0x8]; // 0xe8(0x08)
	struct FCharacterMusicStateConfig ActiveCharacterMusicState; // 0xf0(0x28)
	char pad_118[0x18]; // 0x118(0x18)

	void HandleGameplayTagChanged(struct FGameplayTag Tag, bool bTagAdded, struct AActor* SourceActor); // Function Gobi.CharacterMusicInfo.HandleGameplayTagChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterSelect
// Size: 0x48 (Inherited: 0x30)
struct UCharacterSelect : UObject {
	struct TArray<struct FCharacterSelectMapping> SelectedCharacterMapping; // 0x30(0x10)
	struct UDataTable* HeroDefinitions; // 0x40(0x08)

	void SetCustomRenderingStateEnabled(struct UObject* WorldContext, bool bEnabled); // Function Gobi.CharacterSelect.SetCustomRenderingStateEnabled // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterSelectLevelManager
// Size: 0x60 (Inherited: 0x30)
struct UCharacterSelectLevelManager : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	struct ACharacterLineupLayoutManager* LineupLayoutManager; // 0x48(0x08)
	char pad_50[0x10]; // 0x50(0x10)

	void OnCharacterSelectLevelShown(); // Function Gobi.CharacterSelectLevelManager.OnCharacterSelectLevelShown // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterSelectScreen
// Size: 0x560 (Inherited: 0x560)
struct UCharacterSelectScreen : UInGameScreen {
};

// Class Gobi.CharacterSelectUserWidget
// Size: 0x4e0 (Inherited: 0x450)
struct UCharacterSelectUserWidget : UGobiUserWidget {
	char pad_450[0x40]; // 0x450(0x40)
	struct TMap<struct AGobiPlayerState*, struct FDataTableRowHandle> ClaimedCharacters; // 0x490(0x50)

	void UpdateClaimedState(); // Function Gobi.CharacterSelectUserWidget.UpdateClaimedState // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CharacterSpawnActor
// Size: 0x498 (Inherited: 0x498)
struct ACharacterSpawnActor : AAISpawnActor {
};

// Class Gobi.ChargeComponent
// Size: 0x698 (Inherited: 0x1c8)
struct UChargeComponent : UAbilityComponent {
	char pad_1C8[0x8]; // 0x1c8(0x08)
	struct FMulticastInlineDelegate OnChargeEnded; // 0x1d0(0x10)
	struct FMulticastInlineDelegate OnChargeBreakPressed; // 0x1e0(0x10)
	bool bGameplayChargePushing; // 0x1f0(0x01)
	char pad_1F1[0x133]; // 0x1f1(0x133)
	struct FHitResult StumbleImpact; // 0x324(0x88)
	struct FChargeMoveTickData MoveTickData; // 0x3ac(0x20)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct UAnimMontage* CurrentActiveMontage; // 0x3d0(0x08)
	struct UGameplayEvaluatorSet* FilterSet; // 0x3d8(0x08)
	struct TArray<struct UAnimMontage*> AccelerateMontages; // 0x3e0(0x10)
	struct TArray<struct UAnimMontage*> DecelerateMontages; // 0x3f0(0x10)
	struct TArray<struct UAnimMontage*> CharacterImpactMontages; // 0x400(0x10)
	bool bStumbleOnWorldImpacts; // 0x410(0x01)
	bool bDeflectOnWorldImpacts; // 0x411(0x01)
	char pad_412[0x6]; // 0x412(0x06)
	struct TArray<struct UAnimMontage*> ImpactStumbleMontages; // 0x418(0x10)
	struct UImpactEffectConfig* StumbleImpactTable; // 0x428(0x08)
	struct FGameplayTagContainer AppliedTags; // 0x430(0x20)
	struct FGameplayTagContainer RampUpTags; // 0x450(0x20)
	struct FGameplayTagContainer DeceleratingTags; // 0x470(0x20)
	struct FGameplayTagQuery CancelTags; // 0x490(0x48)
	struct TArray<struct UGameplayEffect*> ChargingEffects; // 0x4d8(0x10)
	struct FGameplayTagQuery BlockingTags; // 0x4e8(0x48)
	struct FGameplayTagQuery BlockingTargetTags; // 0x530(0x48)
	struct FGameplayTagQuery InterruptChargeCharacterTags; // 0x578(0x48)
	struct FGameplayTag ChargeCollisionTag; // 0x5c0(0x08)
	struct TArray<struct UGameplayEffect*> ChargeCollisionEffects; // 0x5c8(0x10)
	struct TArray<struct UGameplayEffect*> ImpactStumbleEffects; // 0x5d8(0x10)
	struct TArray<struct FEnemyAudioEvent> AudioStartEvents; // 0x5e8(0x10)
	struct TArray<struct FEnemyAudioEvent> AudioStopEvents; // 0x5f8(0x10)
	struct FGameplayTag ImpactExplosionComponentTag; // 0x608(0x08)
	struct FChargeTuning ChargeTuning; // 0x610(0x88)

	void StopCharge(); // Function Gobi.ChargeComponent.StopCharge // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChargeProperyMod
// Size: 0xa8 (Inherited: 0xa8)
struct UChargeProperyMod : UObjectPropertyMod {
};

// Class Gobi.ChaserAnimInstance
// Size: 0x920 (Inherited: 0x7f0)
struct UChaserAnimInstance : UZombieAnimInstance {
	char pad_7F0[0x28]; // 0x7f0(0x28)
	struct FChaserAnimState ChaserAnimState; // 0x818(0x1c)
	char pad_834[0x4]; // 0x834(0x04)
	struct FGameplayTagQuery PounceQuery; // 0x838(0x48)
	struct FGameplayTagQuery PounceAttackingQuery; // 0x880(0x48)
	struct FGameplayTagQuery LeapInterruptedQuery; // 0x8c8(0x48)
	char pad_910[0x10]; // 0x910(0x10)
};

// Class Gobi.ChatBoxUserWidget
// Size: 0x4a8 (Inherited: 0x450)
struct UChatBoxUserWidget : UGobiUserWidget {
	struct UAkAudioEvent* PlayerJoinedGroupAudio; // 0x450(0x08)
	char pad_458[0x50]; // 0x458(0x50)

	void ShowInput(); // Function Gobi.ChatBoxUserWidget.ShowInput // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChatMessage
// Size: 0x58 (Inherited: 0x30)
struct UChatMessage : UObject {
	struct FText Message; // 0x30(0x18)
	char pad_48[0x10]; // 0x48(0x10)
};

// Class Gobi.ChatMessageUserWidget
// Size: 0x470 (Inherited: 0x450)
struct UChatMessageUserWidget : UGobiUserWidget {
	char pad_450[0x8]; // 0x450(0x08)
	float FadeDelay; // 0x458(0x04)
	float FadeDuration; // 0x45c(0x04)
	char pad_460[0x10]; // 0x460(0x10)

	void StartFade(); // Function Gobi.ChatMessageUserWidget.StartFade // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChatScreen
// Size: 0x600 (Inherited: 0x530)
struct UChatScreen : UUIScreen {
	struct FMulticastInlineDelegate OnScreenNewStatusChanged; // 0x530(0x10)
	struct TArray<struct TSoftClassPtr<UObject>> ScreensToMoveVoipOverlay; // 0x540(0x10)
	struct FMulticastInlineDelegate OnChatOpened; // 0x550(0x10)
	char pad_560[0xa0]; // 0x560(0xa0)

	void ShowDamageEffect(); // Function Gobi.ChatScreen.ShowDamageEffect // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ChunkInstallProgressUserWidget
// Size: 0x468 (Inherited: 0x450)
struct UChunkInstallProgressUserWidget : UGobiUserWidget {
	char pad_450[0x18]; // 0x450(0x18)

	void SetProgressMaterial(struct UMaterialInstanceDynamic* InMaterial); // Function Gobi.ChunkInstallProgressUserWidget.SetProgressMaterial // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CinematicAnalyticsComponent
// Size: 0x148 (Inherited: 0xd8)
struct UCinematicAnalyticsComponent : UActorComponent {
	char pad_D8[0x70]; // 0xd8(0x70)
};

// Class Gobi.UsableComponent
// Size: 0x4b8 (Inherited: 0xd8)
struct UUsableComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBeginUse; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnEndUse; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnSuccessfulUse; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnEnabledChanged; // 0x108(0x10)
	char pad_118[0x18]; // 0x118(0x18)
	struct FMulticastInlineDelegate OnSuccessfulUseDetailed; // 0x130(0x10)
	char pad_140[0x20]; // 0x140(0x20)
	struct AActor* UsingActor; // 0x160(0x08)
	struct FGameplayTag RequiredTriggerGameplayTag; // 0x168(0x08)
	float RequiredUseTime; // 0x170(0x04)
	bool bResetOnStopUse; // 0x174(0x01)
	bool bSupportsTapAndHold; // 0x175(0x01)
	char pad_176[0x72]; // 0x176(0x72)
	struct TArray<struct APlayerSlot*> UsedByPlayerSlots; // 0x1e8(0x10)
	bool bIsEnabled; // 0x1f8(0x01)
	bool bDisableOnSuccessfulUse; // 0x1f9(0x01)
	bool bAllowQuickUseItems; // 0x1fa(0x01)
	bool bAllowQuickUseItemsWithZeroRequiredUseTime; // 0x1fb(0x01)
	bool bRequireQuickUseItem; // 0x1fc(0x01)
	bool bQuickUseItemOnlyRequiredForFirstUse; // 0x1fd(0x01)
	bool bSingleUsePerPlayerSlot; // 0x1fe(0x01)
	char pad_1FF[0x1]; // 0x1ff(0x01)
	struct FText DefaultPromptText; // 0x200(0x18)
	struct FText SingleUsePerPlayerText; // 0x218(0x18)
	struct FUsableProgressBarDefinition UsersProgressBarDef; // 0x230(0x28)
	struct FUsableProgressBarDefinition OwnersProgressBarDef; // 0x258(0x28)
	bool bCanDisablePingable; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct TArray<struct UGameplayEffect*> OwnerAppliedGameplayEffects; // 0x288(0x10)
	struct TArray<struct UGameplayEffect*> UserAppliedGameplayEffects; // 0x298(0x10)
	struct FGameplayTagQuery OwnerRequiredTagQuery; // 0x2a8(0x48)
	struct FGameplayTagContainer UsingActorBlockingTags; // 0x2f0(0x20)
	struct FGameplayTagContainer TagsAppliedToOwner; // 0x310(0x20)
	struct FGameplayTagContainer TagsAppliedToUsingActor; // 0x330(0x20)
	struct FGameplayTag BeginUseCueTag; // 0x350(0x08)
	struct FGameplayTag SuccessfulUseCueTag; // 0x358(0x08)
	struct FGameplayTag EndUseCueTag; // 0x360(0x08)
	struct FCurrencyCondition CurrencyCondition; // 0x368(0x30)
	struct FHealthPercentCondition HealthPercentCondition; // 0x398(0x38)
	struct FMissionObjectiveCondition MissionObjectiveCondition; // 0x3d0(0x50)
	enum class EInventoryConditionMode InventoryConditionMode; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct TArray<struct FUsableInventoryCondition> InventoryConditions; // 0x428(0x10)
	struct TArray<struct FGameplayTagCondition> GameplayTagConditions; // 0x438(0x10)
	bool bRequireClearLineOfSight; // 0x448(0x01)
	enum class EUsableTraceLocation TraceLocation; // 0x449(0x01)
	char pad_44A[0x2]; // 0x44a(0x02)
	float ClearLoSTraceTimeForgiveness; // 0x44c(0x04)
	bool bFailTriggerTraceOnOwnerHit; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
	struct FGameplayTagContainer AssociatedMeshTags; // 0x458(0x20)
	bool bPerformReachOutAnimation; // 0x478(0x01)
	bool bBypassCapsuleCheckOnHold; // 0x479(0x01)
	char pad_47A[0x2]; // 0x47a(0x02)
	float CancelDistance; // 0x47c(0x04)
	struct UAkAudioEvent* FailedUseSound; // 0x480(0x08)
	struct UAnimMontage* UseAnimation; // 0x488(0x08)
	struct TArray<struct UAnimMontage*> UseAnimations; // 0x490(0x10)
	bool bScaleUseAnimBasedOnUsersUseRate; // 0x4a0(0x01)
	char pad_4A1[0x7]; // 0x4a1(0x07)
	struct UAnimMontage* EndUseAnimation; // 0x4a8(0x08)
	enum class EUsablePriority UsablePriority; // 0x4b0(0x01)
	char pad_4B1[0x7]; // 0x4b1(0x07)

	void UsableSuccessfulUseSignatureDetailed_DM__DelegateSignature(struct FUsableSuccessfulUsePayload Payload); // DelegateFunction Gobi.UsableComponent.UsableSuccessfulUseSignatureDetailed_DM__DelegateSignature // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CivilianEcouragementUsableComponent
// Size: 0x4c0 (Inherited: 0x4b8)
struct UCivilianEcouragementUsableComponent : UUsableComponent {
	char pad_4B8[0x8]; // 0x4b8(0x08)

	void OnPossessedBy(struct AController* Controller); // Function Gobi.CivilianEcouragementUsableComponent.OnPossessedBy // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ClaimManager
// Size: 0x40 (Inherited: 0x30)
struct UClaimManager : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Gobi.ClingComponent
// Size: 0x3a8 (Inherited: 0x120)
struct UClingComponent : UMovementTickableComponent {
	char pad_120[0x48]; // 0x120(0x48)
	struct FMulticastInlineDelegate OnStateChanged; // 0x168(0x10)
	struct FClingConfig ClingConfig; // 0x178(0x168)
	struct FClingMoveTickData MoveTickData; // 0x2e0(0x24)
	enum class EZombieAttachLocationType AttachedLocationType; // 0x304(0x01)
	enum class EZombieAttachLocationType AttachToLocationType; // 0x305(0x01)
	bool bIsSwiveling; // 0x306(0x01)
	bool bClingMoving; // 0x307(0x01)
	struct UAnimMontage* CurrentActiveMontage; // 0x308(0x08)
	char pad_310[0x40]; // 0x310(0x40)
	struct FName PoleAttachedCollisionProfileName; // 0x350(0x08)
	char pad_358[0x50]; // 0x358(0x50)

	void OnRep_MoveTickData(struct FClingMoveTickData PrevMoveTickData); // Function Gobi.ClingComponent.OnRep_MoveTickData // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ClingPropertyMod
// Size: 0xb0 (Inherited: 0xa8)
struct UClingPropertyMod : UObjectPropertyMod {
	enum class EClingPropertyModType Type; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	int32_t CanAttach; // 0xac(0x04)
};

// Class Gobi.ClingTrait
// Size: 0x1a0 (Inherited: 0x30)
struct UClingTrait : UTrait {
	struct FClingConfig Config; // 0x30(0x168)
	struct UClingComponent* ClingComponentClass; // 0x198(0x08)
};

// Class Gobi.ClipAmmoComponent
// Size: 0x228 (Inherited: 0x150)
struct UClipAmmoComponent : UItemBaseComponent {
	char pad_150[0x84]; // 0x150(0x84)
	int32_t CurrentClipAmount; // 0x1d4(0x04)
	char pad_1D8[0x4]; // 0x1d8(0x04)
	int32_t CalculatedMaxClipAmount; // 0x1dc(0x04)
	char pad_1E0[0x10]; // 0x1e0(0x10)
	struct FDataTableRowHandle AmmoRowHandle; // 0x1f0(0x20)
	float LowAmmoPercentage; // 0x210(0x04)
	bool bInfiniteReserveAmmo; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	struct FName AmmoBeltBoneNamePrefix; // 0x218(0x08)
	int32_t AmmoBeltVacuumClipCountStart; // 0x220(0x04)
	struct FClipAmmoTuning ClipAmmoTuning; // 0x224(0x04)

	void OnRep_CurrentClipAmount(); // Function Gobi.ClipAmmoComponent.OnRep_CurrentClipAmount // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ReloadComponent
// Size: 0x200 (Inherited: 0x150)
struct UReloadComponent : UItemBaseComponent {
	char pad_150[0x90]; // 0x150(0x90)
	struct TArray<struct UGameplayEffect*> PowerReloadEffects; // 0x1e0(0x10)
	struct TArray<struct UGameplayEffect*> PowerReloadPlayerEffects; // 0x1f0(0x10)

	bool IsReloadingFromUserInput(); // Function Gobi.ReloadComponent.IsReloadingFromUserInput // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ClipReloadComponent
// Size: 0x2e0 (Inherited: 0x200)
struct UClipReloadComponent : UReloadComponent {
	char pad_200[0x48]; // 0x200(0x48)
	struct FReplicatedReloadData ReplicatedReloadData; // 0x248(0x08)
	float ReloadLength; // 0x250(0x04)
	float ReloadAnimationLength; // 0x254(0x04)
	float ReloadAddTime; // 0x258(0x04)
	bool bAutoReloadWhenEmpty; // 0x25c(0x01)
	char pad_25D[0x3]; // 0x25d(0x03)
	struct UAnimMontage* ReloadMontageFP; // 0x260(0x08)
	struct UAnimMontage* ReloadMontage3P; // 0x268(0x08)
	struct FGameplayTag AppliedTag; // 0x270(0x08)
	struct FGameplayTagContainer BlockingTags; // 0x278(0x20)
	struct FGameplayTagContainer InterruptingTags; // 0x298(0x20)
	struct FGameplayTagContainer CancellingTags; // 0x2b8(0x20)
	struct UAkAudioEvent* BackgroundReloadAKE; // 0x2d8(0x08)

	void OnRep_ReloadData(); // Function Gobi.ClipReloadComponent.OnRep_ReloadData // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ClusterBoilComponent
// Size: 0x170 (Inherited: 0xd8)
struct UClusterBoilComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBoilDeath; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnGrew; // 0xe8(0x10)
	bool bShrunk; // 0xf8(0x01)
	char pad_F9[0x2f]; // 0xf9(0x2f)
	struct UHealthComponent* HealthComp; // 0x128(0x08)
	struct UStaticMeshComponent* OwnerMesh; // 0x130(0x08)
	struct UThreatComponent* ThreatComp; // 0x138(0x08)
	struct UAkAudioEvent* HitSound; // 0x140(0x08)
	struct UAkAudioEvent* DeathSound; // 0x148(0x08)
	struct UParticleSystem* DeathExplosion; // 0x150(0x08)
	struct UCurveFloat* ShrinkGrowCurve; // 0x158(0x08)
	float GrowDelay; // 0x160(0x04)
	struct FVector BoilWorldScale; // 0x164(0x0c)

	void OnWaitingOnReset(); // Function Gobi.ClusterBoilComponent.OnWaitingOnReset // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ColorBlindGroupData
// Size: 0x88 (Inherited: 0x38)
struct UColorBlindGroupData : UDataAsset {
	struct TMap<struct FName, struct FColorBlindGroup> ColorBlindGroups; // 0x38(0x50)
};

// Class Gobi.ColorBlindOutlineHighlightData
// Size: 0x88 (Inherited: 0x38)
struct UColorBlindOutlineHighlightData : UDataAsset {
	struct TMap<enum class EColorBlindMode, struct FHighlightPalette> OutlinePalettes; // 0x38(0x50)
};

// Class Gobi.CombineComponent
// Size: 0x3f8 (Inherited: 0xd8)
struct UCombineComponent : UActorComponent {
	bool bIsGameCoachEnabled; // 0xd8(0x01)
	bool bHasCombineFinished; // 0xd9(0x01)
	char pad_DA[0x36]; // 0xda(0x36)
	struct FMulticastInlineDelegate GameCoachIsOff; // 0x110(0x10)
	struct FMulticastInlineDelegate OnCombineStarted; // 0x120(0x10)
	struct FMulticastInlineDelegate OnCombineStopped; // 0x130(0x10)
	struct UUsableComponent* Usable; // 0x140(0x08)
	struct TArray<struct FCornstalk> CornStalks; // 0x148(0x10)
	struct FName CornStalkTag; // 0x158(0x08)
	struct UInstancedStaticMeshComponent* InstanceClass; // 0x160(0x08)
	struct FName InstanceClassTag; // 0x168(0x08)
	float CombineDistanceCheck; // 0x170(0x04)
	char pad_174[0x4]; // 0x174(0x04)
	struct TArray<struct FName> BladeSocketLocationNames; // 0x178(0x10)
	struct TArray<struct FVector> BladeSocketLocations; // 0x188(0x10)
	struct UGameCoachLessonsComponent* GameCoach; // 0x198(0x08)
	struct FName GameCoachTag; // 0x1a0(0x08)
	struct TArray<struct ABirdSite*> BirdSites; // 0x1a8(0x10)
	struct FName BirdSiteTag; // 0x1b8(0x08)
	float BirdLaunchDistance; // 0x1c0(0x04)
	char pad_1C4[0x4]; // 0x1c4(0x04)
	struct UGobiNavModifierComponent* GobiNavModifierStart; // 0x1c8(0x08)
	struct FName GobiNavModifierStartTag; // 0x1d0(0x08)
	struct UGobiNavModifierComponent* GobiNavModifierEnd; // 0x1d8(0x08)
	struct FName GobiNavModifierEndTag; // 0x1e0(0x08)
	struct UNavArea* NavAreaDisabled; // 0x1e8(0x08)
	struct UNavArea* NavAreaGobiDefault; // 0x1f0(0x08)
	struct TArray<struct UStaticMeshComponent*> Blades; // 0x1f8(0x10)
	struct FName BladesTag; // 0x208(0x08)
	struct TArray<struct APlaceableAudioJostle*> CornAudioJostles; // 0x210(0x10)
	struct FName CornAudioJostleTag; // 0x220(0x08)
	float MinCombineDistanceToAudioJostle; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct UAkComponent* AkVehicle; // 0x230(0x08)
	struct FName AkVehicleTag; // 0x238(0x08)
	struct UAkComponent* AkBlades; // 0x240(0x08)
	struct FName AkBladesTag; // 0x248(0x08)
	struct UItemAkBankComponent* ItemAkBank; // 0x250(0x08)
	struct FName ItemAkBankTag; // 0x258(0x08)
	struct UAkAudioEvent* CombineEngineStart; // 0x260(0x08)
	struct UAkAudioEvent* CombineEngineLoop; // 0x268(0x08)
	struct UAkAudioEvent* CombineEngineExplode; // 0x270(0x08)
	struct UAkAudioEvent* CombineEngineDeath; // 0x278(0x08)
	struct UAkAudioEvent* CombineEngineCrash; // 0x280(0x08)
	struct UAkAudioEvent* BladesLoop; // 0x288(0x08)
	struct UAkAudioEvent* BladesLoopStop; // 0x290(0x08)
	struct UAkAudioEvent* PlantShred; // 0x298(0x08)
	float PlantHitAudioDelayTime; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct UCurveFloat* CombineIgnitionCurve; // 0x2a8(0x08)
	float StartCountdown; // 0x2b0(0x04)
	float CombineIgnitionUpdateRate; // 0x2b4(0x04)
	struct TArray<struct USpotLightComponent*> Spotlights; // 0x2b8(0x10)
	struct FName SpotlightTag; // 0x2c8(0x08)
	float MaxIntensity; // 0x2d0(0x04)
	char pad_2D4[0x4]; // 0x2d4(0x04)
	struct UParticleSystemComponent* CombineSmokeParticle; // 0x2d8(0x08)
	struct FName CombineSmokeParticleTag; // 0x2e0(0x08)
	struct UParticleSystemComponent* CornShuckGroup; // 0x2e8(0x08)
	struct FName CornShuckGroupTag; // 0x2f0(0x08)
	struct UParticleSystemComponent* CombineWheels; // 0x2f8(0x08)
	struct FName CombineWheelsTag; // 0x300(0x08)
	struct UParticleSystem* CornShuck; // 0x308(0x08)
	float PlantHitVFXDelayTime; // 0x310(0x04)
	char pad_314[0x4]; // 0x314(0x04)
	struct UParticleSystemComponent* CornSpray; // 0x318(0x08)
	struct FName CornSprayTag; // 0x320(0x08)
	struct UParticleSystemComponent* CombineBloodVFX; // 0x328(0x08)
	struct FName CombineBloodVFXTag; // 0x330(0x08)
	struct UBoxComponent* BladeKillBox; // 0x338(0x08)
	struct FName BladeKillBoxTag; // 0x340(0x08)
	struct UBoxComponent* PushbackVolume; // 0x348(0x08)
	struct FName PushbackVolumeTag; // 0x350(0x08)
	struct UBoxComponent* BladeCornBox; // 0x358(0x08)
	struct FName BladeCornBoxTag; // 0x360(0x08)
	struct AActor* CornStalkClass; // 0x368(0x08)
	struct TArray<enum class EObjectTypeQuery> QueryTypes; // 0x370(0x10)
	float MoveCombineCountdown; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct USplineComponent* Spline; // 0x388(0x08)
	struct FName SplineTag; // 0x390(0x08)
	struct UStaticMeshComponent* CombineMesh; // 0x398(0x08)
	struct FName CombineMeshTag; // 0x3a0(0x08)
	float BladeMovementRate; // 0x3a8(0x04)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct UChildActorComponent* ChildActorComponentClass; // 0x3b0(0x08)
	struct FName ChildActorComponentTag; // 0x3b8(0x08)
	bool bIsCombineMoving; // 0x3c0(0x01)
	char pad_3C1[0x3]; // 0x3c1(0x03)
	float CombineDamageAmount; // 0x3c4(0x04)
	struct UGobiDamageType* CombineDamageType; // 0x3c8(0x08)
	struct FName DamageBoneName; // 0x3d0(0x08)
	float CombineBloodDeactiveCountdown; // 0x3d8(0x04)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct AGobiCharacter* HeroBP; // 0x3e0(0x08)
	struct UGobiDamageType* CombinePushbackDamageType; // 0x3e8(0x08)
	enum class EPhysicalSurface PhysicalSurfaceForDamage; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)

	void SetIsGameCoachEnabled(bool bDesiredState); // Function Gobi.CombineComponent.SetIsGameCoachEnabled // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CommonZombieMeshSubsystem
// Size: 0x70 (Inherited: 0x38)
struct UCommonZombieMeshSubsystem : UWorldSubsystem {
	char pad_38[0x8]; // 0x38(0x08)
	struct TArray<struct FMeshMergeConfiguration> MergedMeshes; // 0x40(0x10)
	struct TArray<struct FSkeletalMeshConfigMod> MeshConfigMods; // 0x50(0x10)
	char pad_60[0x10]; // 0x60(0x10)

	void OnZombieMeshRandomSeedSet(); // Function Gobi.CommonZombieMeshSubsystem.OnZombieMeshRandomSeedSet // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.Comms_DialogueSpeaker
// Size: 0x2d8 (Inherited: 0x250)
struct AComms_DialogueSpeaker : AActor {
	char pad_250[0x18]; // 0x250(0x18)
	struct FDataTableRowHandle VoiceRowHandle; // 0x268(0x20)
	struct UAkSimpleComponent* AkComponent; // 0x288(0x08)
	struct UGobiDialogueComponent* DialogueComp; // 0x290(0x08)
	char pad_298[0x18]; // 0x298(0x18)
	struct FString CurrentVoiceLine; // 0x2b0(0x10)
	struct UAkAudioEvent* DialogueStopEvent; // 0x2c0(0x08)
	char pad_2C8[0x10]; // 0x2c8(0x10)

	void VoiceLineFinished(enum class EAkCallbackType CallbackType, struct UAkCallbackInfo* CallbackInfo); // Function Gobi.Comms_DialogueSpeaker.VoiceLineFinished // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CommWheelActionsData
// Size: 0xa8 (Inherited: 0x38)
struct UCommWheelActionsData : UDataAsset {
	struct TMap<enum class ECommWheelAction, struct FCommWheelActionDefinition> ActionDefinitions; // 0x38(0x50)
	struct TArray<struct FCommWheelActionPage> SurvivorActions; // 0x88(0x10)
	struct TArray<struct FCommWheelActionPage> ZombieActions; // 0x98(0x10)
};

// Class Gobi.CommWheelUserWidget
// Size: 0x4b0 (Inherited: 0x450)
struct UCommWheelUserWidget : UGobiUserWidget {
	char pad_450[0x60]; // 0x450(0x60)

	void TriggerSelectedAction(bool bFromButtonReleased); // Function Gobi.CommWheelUserWidget.TriggerSelectedAction // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ConfigSaveGameSubsystem
// Size: 0x38 (Inherited: 0x38)
struct UConfigSaveGameSubsystem : UGameInstanceSubsystem {
};

// Class Gobi.ControlsOptionsPanelUserWidget
// Size: 0x4c0 (Inherited: 0x460)
struct UControlsOptionsPanelUserWidget : UOptionsPanelUserWidget {
	struct UDataTable* CommonActionsTable; // 0x460(0x08)
	struct UDataTable* CommonAxisTable; // 0x468(0x08)
	struct UDataTable* HeroActionsTable; // 0x470(0x08)
	struct UDataTable* HeroAxisTable; // 0x478(0x08)
	struct UDataTable* InfectedActionsTable; // 0x480(0x08)
	struct UDataTable* InfectedAxisTable; // 0x488(0x08)
	struct UDataTable* MovementActionsTable; // 0x490(0x08)
	struct UDataTable* MovementAxisTable; // 0x498(0x08)
	char pad_4A0[0x20]; // 0x4a0(0x20)

	void OnInputUnboundReport(struct FKey Key, struct FText UnboundActionDisplayName, struct FText NewBoundActionDisplayName); // Function Gobi.ControlsOptionsPanelUserWidget.OnInputUnboundReport // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ConversationTrigger
// Size: 0x340 (Inherited: 0x250)
struct AConversationTrigger : AActor {
	struct USceneComponent* InternalRootComponent; // 0x250(0x08)
	bool bTriggersOnFullPartyEnter; // 0x258(0x01)
	bool bTriggerOnce; // 0x259(0x01)
	bool bUseDirectional; // 0x25a(0x01)
	char pad_25B[0x1]; // 0x25b(0x01)
	float MinDirectionalAmount; // 0x25c(0x04)
	bool bUseLookAt; // 0x260(0x01)
	char pad_261[0x3]; // 0x261(0x03)
	float MinLookAtAngle; // 0x264(0x04)
	bool bActivated; // 0x268(0x01)
	bool bDequeueConversationOnPlayerExitTrigger; // 0x269(0x01)
	enum class EInstigatorRule InstigatorRule; // 0x26a(0x01)
	char pad_26B[0x5]; // 0x26b(0x05)
	struct TArray<struct FName> NeededHeroNames; // 0x270(0x10)
	bool bQueueAllChoices; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct TArray<struct FQueuedConversation> ConversationChoices; // 0x288(0x10)
	struct TArray<struct FQueuedConversation> ConversationsToDequeue; // 0x298(0x10)
	struct TArray<struct AConversationTrigger*> ConversationTriggersToDisable; // 0x2a8(0x10)
	char pad_2B8[0x88]; // 0x2b8(0x88)

	void OnHeroExited(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComponent, int32_t OtherBodyIndex); // Function Gobi.ConversationTrigger.OnHeroExited // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CorpseManager
// Size: 0x58 (Inherited: 0x30)
struct UCorpseManager : UObject {
	char pad_30[0x28]; // 0x30(0x28)

	void RegisterCorpse(struct AActor* CorpseActor); // Function Gobi.CorpseManager.RegisterCorpse // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CreditsScreen
// Size: 0x530 (Inherited: 0x530)
struct UCreditsScreen : UUIScreen {
};

// Class Gobi.CreditsUserWidget
// Size: 0x460 (Inherited: 0x460)
struct UCreditsUserWidget : UOptionsPanelUserWidget {

	void SetCreditsText(struct FText InText); // Function Gobi.CreditsUserWidget.SetCreditsText // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CrosshairContainerUserWidget
// Size: 0x458 (Inherited: 0x450)
struct UCrosshairContainerUserWidget : UGobiUserWidget {
	char pad_450[0x8]; // 0x450(0x08)

	void OnLifeStateChanged(struct FGameplayTag NewStateTag, struct FGameplayTag PreviousStateTag); // Function Gobi.CrosshairContainerUserWidget.OnLifeStateChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CrossplayStateUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UCrossplayStateUserWidget : UGobiUserWidget {
	char pad_450[0x10]; // 0x450(0x10)

	void OnSettingsChanged(); // Function Gobi.CrossplayStateUserWidget.OnSettingsChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CustomCollisionChannelMap
// Size: 0x58 (Inherited: 0x38)
struct UCustomCollisionChannelMap : UDataAsset {
	struct FName CustomCollisionChannelNames[0x4]; // 0x38(0x20)
};

// Class Gobi.CustomizationMannequin
// Size: 0x368 (Inherited: 0x250)
struct ACustomizationMannequin : AActor {
	char pad_250[0x38]; // 0x250(0x38)
	struct FCharacterCustomizationSet DesiredCustomizationSet; // 0x288(0x88)
	struct TSoftObjectPtr<UAnimMontage> DesiredIdleAnimation; // 0x310(0x28)
	struct FDataTableRowHandle SecondaryWeaponRow; // 0x338(0x20)
	struct UStaticMeshComponent* WeaponMeshComponent; // 0x358(0x08)
	enum class EHeroMannequinType MannequinType; // 0x360(0x01)
	char pad_361[0x7]; // 0x361(0x07)

	void K2_OnGenderSet(bool bIsMale); // Function Gobi.CustomizationMannequin.K2_OnGenderSet // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CustomProjectionInterface
// Size: 0x30 (Inherited: 0x30)
struct UCustomProjectionInterface : UInterface {

	void SetCustomFOV(float InCustomFoV); // Function Gobi.CustomProjectionInterface.SetCustomFOV // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.AudioSinkSystem
// Size: 0xf0 (Inherited: 0x88)
struct UAudioSinkSystem : UAkAudioInputObject {
	struct UMediaPlayer* MediaPlayer; // 0x88(0x08)
	char pad_90[0x60]; // 0x90(0x60)
};

// Class Gobi.CutsceneAudioSinkSubsystem
// Size: 0xa8 (Inherited: 0x38)
struct UCutsceneAudioSinkSubsystem : UGameInstanceSubsystem {
	char pad_38[0x10]; // 0x38(0x10)
	struct TMap<struct TWeakObjectPtr<struct UMediaPlayer>, struct UAudioSinkSystem*> MediaPlayerPairs; // 0x48(0x50)
	char pad_98[0x10]; // 0x98(0x10)

	void UnregisterMediaPlayer(struct UMediaPlayer* Player); // Function Gobi.CutsceneAudioSinkSubsystem.UnregisterMediaPlayer // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CutsceneCoordinator
// Size: 0x340 (Inherited: 0x250)
struct ACutsceneCoordinator : AInfo {
	struct FDataTableRowHandle CutsceneDefinitionRowHandle; // 0x250(0x20)
	struct FMulticastInlineDelegate OnIntroFadeOut; // 0x270(0x10)
	struct FMulticastInlineDelegate OnCutsceneSetup; // 0x280(0x10)
	struct FMulticastInlineDelegate OnPlaySequence; // 0x290(0x10)
	struct FMulticastInlineDelegate OnCutsceneCleanup; // 0x2a0(0x10)
	struct FMulticastInlineDelegate OnPhaseChanged; // 0x2b0(0x10)
	enum class ECutsceneControl ControlState; // 0x2c0(0x01)
	char pad_2C1[0x7]; // 0x2c1(0x07)
	struct ULevelSequence* LevelSequence; // 0x2c8(0x08)
	struct ALevelSequenceActor* LevelSequenceActor; // 0x2d0(0x08)
	struct ULevelSequencePlayer* LevelSequencePlayer; // 0x2d8(0x08)
	struct UPlayerCutsceneSynchronizationComponent* LocalSynchronizationComponent; // 0x2e0(0x08)
	struct TArray<struct UObject*> PreloadedAssets; // 0x2e8(0x10)
	char pad_2F8[0x48]; // 0x2f8(0x48)

	void UpdateLevelStreamingStatus(); // Function Gobi.CutsceneCoordinator.UpdateLevelStreamingStatus // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.CutsceneFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UCutsceneFunctionLibrary : UBlueprintFunctionLibrary {

	struct ACutsceneCoordinator* GetCutsceneCoordinator(struct UObject* WorldContextObject); // Function Gobi.CutsceneFunctionLibrary.GetCutsceneCoordinator // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.StumbleDamageAccumulatorComponent
// Size: 0x1a8 (Inherited: 0xd8)
struct UStumbleDamageAccumulatorComponent : UActorComponent {
	struct FDamageAccumulationConfig Config; // 0xd8(0x58)
	char pad_130[0x78]; // 0x130(0x78)
};

// Class Gobi.DamageCameraShakeComponent
// Size: 0xf0 (Inherited: 0xd8)
struct UDamageCameraShakeComponent : UActorComponent {
	struct TArray<struct FDamageCameraShake> CameraShakes; // 0xd8(0x10)
	char pad_E8[0x8]; // 0xe8(0x08)

	void OnHealthChanged(float NewHealth, float DeltaHealth); // Function Gobi.DamageCameraShakeComponent.OnHealthChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DamageFilterComponent
// Size: 0x160 (Inherited: 0xd8)
struct UDamageFilterComponent : UActorComponent {
	struct UDamageFilter* InitialOutgoingDamageFilterClass; // 0xd8(0x08)
	char pad_E0[0x80]; // 0xe0(0x80)
};

// Class Gobi.DamageIndicatorPipUserWidget
// Size: 0x4b0 (Inherited: 0x450)
struct UDamageIndicatorPipUserWidget : UGobiUserWidget {
	struct UTexture2D* SmallDamage; // 0x450(0x08)
	struct UTexture2D* MediumDamage; // 0x458(0x08)
	struct UTexture2D* LargeDamage; // 0x460(0x08)
	char pad_468[0x48]; // 0x468(0x48)

	void StartSmallFadeAnim(); // Function Gobi.DamageIndicatorPipUserWidget.StartSmallFadeAnim // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DamageIndicatorUserWidget
// Size: 0x488 (Inherited: 0x450)
struct UDamageIndicatorUserWidget : UGobiUserWidget {
	struct UGobiUserWidget* DamageIndicatorClass; // 0x450(0x08)
	char pad_458[0x30]; // 0x458(0x30)

	void OnRecentDamageInfoChanged(); // Function Gobi.DamageIndicatorUserWidget.OnRecentDamageInfoChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.StatTrackerBase
// Size: 0x40 (Inherited: 0x30)
struct UStatTrackerBase : UGobiObject {
	struct AController* OwningController; // 0x30(0x08)
	struct UPlayerStatsComponent* StatsComponent; // 0x38(0x08)

	void OnInit(); // Function Gobi.StatTrackerBase.OnInit // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DamageStatTracker
// Size: 0x90 (Inherited: 0x40)
struct UDamageStatTracker : UStatTrackerBase {
	struct FGameplayTagQuery SnitcherTagsQuery; // 0x40(0x48)
	struct AGobiCharacter* CurrentCharacter; // 0x88(0x08)

	void HandleInflictDamage(struct FDamageInfo DamageInfo); // Function Gobi.DamageStatTracker.HandleInflictDamage // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DeathGasActor
// Size: 0x2f0 (Inherited: 0x250)
struct ADeathGasActor : AActor {
	struct UCapsuleComponent* SafeZone_Volume; // 0x250(0x08)
	float OriginalMeshRadius; // 0x258(0x04)
	float StartingRadius; // 0x25c(0x04)
	float EndingRadius; // 0x260(0x04)
	float TransitionTime; // 0x264(0x04)
	float WarmupTime; // 0x268(0x04)
	float Duration; // 0x26c(0x04)
	struct TArray<struct UGameplayEffect*> AppliedGameplayEffects; // 0x270(0x10)
	bool bStartImmediately; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	float CurrentEffectRadius; // 0x284(0x04)
	char pad_288[0x10]; // 0x288(0x10)
	struct TMap<struct AGobiCharacter*, struct FDeathGasAppliedEffects> AppliedEffectsMap; // 0x298(0x50)
	enum class EDeathGasState CurrentState; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)

	void OnRep_CurrentState(enum class EDeathGasState OldState); // Function Gobi.DeathGasActor.OnRep_CurrentState // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DeathGasSpawnComponent
// Size: 0x2b8 (Inherited: 0x1c8)
struct UDeathGasSpawnComponent : UAbilityComponent {
	char pad_1C8[0x8]; // 0x1c8(0x08)
	struct FMulticastInlineDelegate OnDeathGasSpawnEnded; // 0x1d0(0x10)
	struct FName SpawnMontagesName; // 0x1e0(0x08)
	struct TArray<struct UAnimMontage*> SpawnMontages; // 0x1e8(0x10)
	struct FGameplayTagContainer AppliedTags; // 0x1f8(0x20)
	struct FGameplayTagQuery ActivatingActorTagRequirements; // 0x218(0x48)
	struct FDeathGasSpawnTuning DeathGasSpawnTuning; // 0x260(0x20)
	struct ADeathGasActor* DeathGasClass; // 0x280(0x08)
	struct TArray<struct UGameplayEffect*> AppliedGameplayEffects; // 0x288(0x10)
	char pad_298[0x18]; // 0x298(0x18)
	struct FDeathGasSpawnMoveTickData MoveTickData; // 0x2b0(0x08)

	void StopDeathGasSpawn(); // Function Gobi.DeathGasSpawnComponent.StopDeathGasSpawn // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DecalAnalyticsComponent
// Size: 0x188 (Inherited: 0xd8)
struct UDecalAnalyticsComponent : UActorComponent {
	char pad_D8[0xa8]; // 0xd8(0xa8)
	struct AGameplayAnalyticsManager* AnalyticsManager; // 0x180(0x08)

	void RecordDecalCreation(struct FName DecalName, int32_t DecalPriority, struct FName DecalCategory, bool bHitBucketLimit, bool bHitOverallLimit, bool bHitBucketFadeLimit); // Function Gobi.DecalAnalyticsComponent.RecordDecalCreation // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DecalDefinition
// Size: 0x100 (Inherited: 0x38)
struct UDecalDefinition : UDataAsset {
	struct FDataTableRowHandle CategoryRowRef; // 0x38(0x20)
	struct UMaterialInstance* Decal; // 0x58(0x08)
	struct FVector2D RotationMinMax; // 0x60(0x08)
	struct FVector2D LifetimeMinMax; // 0x68(0x08)
	struct TArray<struct FDecalDefLifetimeQuality> LifetimePerQuality; // 0x70(0x10)
	struct FVector2D FadeDurationMinMax; // 0x80(0x08)
	struct FVector2D FadeInDelayMinMax; // 0x88(0x08)
	struct FVector2D FadeInDurationMinMax; // 0x90(0x08)
	float FadeScreenSize; // 0x98(0x04)
	float ProjectionDepth; // 0x9c(0x04)
	struct FVector2D ScaleMinMax; // 0xa0(0x08)
	bool ScaleNonUniform; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	struct FVector2D ScaleNonUniformMin; // 0xac(0x08)
	struct FVector2D ScaleNonUniformMax; // 0xb4(0x08)
	bool DirectionStretchEnable; // 0xbc(0x01)
	char pad_BD[0x3]; // 0xbd(0x03)
	struct FVector2D DirectionStretchMinMax; // 0xc0(0x08)
	float DirectionStretchSpawnPercent; // 0xc8(0x04)
	bool bNormal; // 0xcc(0x01)
	bool bLifetimeParams; // 0xcd(0x01)
	bool SoftnessOverride; // 0xce(0x01)
	char pad_CF[0x1]; // 0xcf(0x01)
	float Softness; // 0xd0(0x04)
	bool SubUVOverride; // 0xd4(0x01)
	char pad_D5[0x3]; // 0xd5(0x03)
	int32_t SubUVFrameMin; // 0xd8(0x04)
	int32_t SubUVFrameMax; // 0xdc(0x04)
	bool CurveOverride; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
	struct UCurveLinearColorAtlas* CurveAtlas; // 0xe8(0x08)
	struct UCurveLinearColor* Curve; // 0xf0(0x08)
	int32_t SortOrder; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
};

// Class Gobi.DecalManager
// Size: 0x158 (Inherited: 0x30)
struct UDecalManager : UObject {
	char pad_30[0x128]; // 0x30(0x128)
};

// Class Gobi.DecalSubsystem
// Size: 0x40 (Inherited: 0x38)
struct UDecalSubsystem : UWorldSubsystem {
	struct UDecalManager* DecalManager; // 0x38(0x08)

	void OnResetMission(); // Function Gobi.DecalSubsystem.OnResetMission // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DeckEditPanelUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UDeckEditPanelUserWidget : UGobiUserWidget {
	enum class EGameplayCardDeckType DeckType; // 0x450(0x01)
	char pad_451[0xf]; // 0x451(0x0f)

	void SetupDeckNavigation(struct UVerticalBox* VBox, struct UCardPaginatorUserWidget* Paginator, struct UUserWidget* FallbackTarget); // Function Gobi.DeckEditPanelUserWidget.SetupDeckNavigation // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DeckEditScreen
// Size: 0x540 (Inherited: 0x530)
struct UDeckEditScreen : UUIScreen {
	char pad_530[0x10]; // 0x530(0x10)

	void OpenSmallDeckFailedSavePopup(); // Function Gobi.DeckEditScreen.OpenSmallDeckFailedSavePopup // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DeckManagerScreen
// Size: 0x560 (Inherited: 0x560)
struct UDeckManagerScreen : UHubChildScreen {

	void SetDeckType(enum class EGameplayCardDeckType DeckType); // Function Gobi.DeckManagerScreen.SetDeckType // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DeckSelectScreen
// Size: 0x530 (Inherited: 0x530)
struct UDeckSelectScreen : UUIScreen {

	void OpenDeletePopup(struct FString DeckName); // Function Gobi.DeckSelectScreen.OpenDeletePopup // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DedicatedServerConsole
// Size: 0x118 (Inherited: 0x30)
struct UDedicatedServerConsole : UObject {
	char pad_30[0xe8]; // 0x30(0xe8)
};

// Class Gobi.DedicatedServerManager
// Size: 0xdb8 (Inherited: 0x30)
struct UDedicatedServerManager : UObject {
	char pad_30[0xc0]; // 0x30(0xc0)
	double NoMatchmakingTimingOutDelay; // 0xf0(0x08)
	struct UWebServiceFortDediAPI* FortDediAPI; // 0xf8(0x08)
	struct UGobiWebServices* GobiWebServices; // 0x100(0x08)
	struct UMatchmakingPoolManager* MatchmakingPoolManager; // 0x108(0x08)
	char pad_110[0x40]; // 0x110(0x40)
	struct TArray<struct FTaskTimerConfig> TimerConfigs; // 0x150(0x10)
	char pad_160[0x878]; // 0x160(0x878)
	double WaitForConnectionsTime; // 0x9d8(0x08)
	double UnloadDelay; // 0x9e0(0x08)
	char pad_9E8[0xc8]; // 0x9e8(0xc8)
	double ReconnectGracePeriod; // 0xab0(0x08)
	double WaitForPendingSessionParticipantsDuration; // 0xab8(0x08)
	char pad_AC0[0x2f8]; // 0xac0(0x2f8)
};

// Class Gobi.DefibrillatorComponent
// Size: 0x2f0 (Inherited: 0x150)
struct UDefibrillatorComponent : UItemBaseComponent {
	struct FMulticastInlineDelegate OnDefibSucceeded; // 0x150(0x10)
	struct FMulticastInlineDelegate OnDefibFailed; // 0x160(0x10)
	char pad_170[0x58]; // 0x170(0x58)
	struct FDefibillatorMoveTickData MoveTickData; // 0x1c8(0x10)
	float MaxTargetDistance; // 0x1d8(0x04)
	float MinAngleToTarget; // 0x1dc(0x04)
	struct FGameplayTagContainer OwningPlayerBlockingTags; // 0x1e0(0x20)
	struct FGameplayTagContainer OwningPlayerAppliedTags; // 0x200(0x20)
	struct FGameplayTagQuery DefibTargetTagQuery; // 0x220(0x48)
	float RequiredUseTime; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct UAnimMontage* FirstPersonMontage; // 0x270(0x08)
	struct UAnimMontage* ThirdPersonMontage; // 0x278(0x08)
	struct TArray<struct UMontageSet*> TargetMontageSets; // 0x280(0x10)
	float TargetAnimationTime; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct FText OwningPlayerProgressBarText; // 0x298(0x18)
	struct FText TargetProgressBarText; // 0x2b0(0x18)
	struct TArray<struct UGameplayEffect*> ReviveEffects; // 0x2c8(0x10)
	struct UAkAudioEvent* AKEOnBeginUse; // 0x2d8(0x08)
	struct UAkAudioEvent* AKEOnEndUse; // 0x2e0(0x08)
	struct UAkAudioEvent* AKEOnSuccessfulUse; // 0x2e8(0x08)

	void OnRep_MoveTickData(struct FDefibillatorMoveTickData PreviousTargetInfo); // Function Gobi.DefibrillatorComponent.OnRep_MoveTickData // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DemoDeveloperSettings
// Size: 0x78 (Inherited: 0x40)
struct UDemoDeveloperSettings : UDeveloperSettings {
	struct TSoftClassPtr<UObject> DemoHUDWidget; // 0x40(0x28)
	float PlaybackSpeedStep; // 0x68(0x04)
	float PlaybackSpeedMin; // 0x6c(0x04)
	float PlaybackSpeedMax; // 0x70(0x04)
	float PlaybackJumpStep; // 0x74(0x04)
};

// Class Gobi.DemoHUDUserWidget
// Size: 0x450 (Inherited: 0x450)
struct UDemoHUDUserWidget : UGobiUserWidget {

	struct FText GetTotalReplayTime(); // Function Gobi.DemoHUDUserWidget.GetTotalReplayTime // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DemoTimeline
// Size: 0x298 (Inherited: 0x148)
struct UDemoTimeline : UWidget {
	struct FSlateBrush BackgroundBrush; // 0x148(0x90)
	struct FDelegate BackgroundBrushDelegate; // 0x1d8(0x10)
	struct FSlateBrush IndicatorBrush; // 0x1e8(0x90)
	struct FDelegate IndicatorBrushDelegate; // 0x278(0x10)
	char pad_288[0x10]; // 0x288(0x10)
};

// Class Gobi.DevOptionsPanelUserWidget
// Size: 0x4f8 (Inherited: 0x460)
struct UDevOptionsPanelUserWidget : UOptionsPanelUserWidget {
	struct TSoftObjectPtr<UAssetTable> SoundbanksTable; // 0x460(0x28)
	char pad_488[0x70]; // 0x488(0x70)

	void ResetFTUESettings(); // Function Gobi.DevOptionsPanelUserWidget.ResetFTUESettings // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DifficultyManager
// Size: 0x40 (Inherited: 0x30)
struct UDifficultyManager : UObject {
	struct TArray<struct FDifficultyRow> DifficultyData; // 0x30(0x10)
};

// Class Gobi.DifficultyHelper
// Size: 0x30 (Inherited: 0x30)
struct UDifficultyHelper : UBlueprintFunctionLibrary {

	struct FVector2D GetDifficultyVector2D(struct FDifficultyInt Value); // Function Gobi.DifficultyHelper.GetDifficultyVector2D // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DirectorAnalyticsComponent
// Size: 0x1d8 (Inherited: 0xd8)
struct UDirectorAnalyticsComponent : UActorComponent {
	char pad_D8[0x100]; // 0xd8(0x100)

	void ReceiveSpawningCardFinishedSpawning(struct FSpawningCard SpawningCard, struct UAISpawnDeck* SpawnDeck); // Function Gobi.DirectorAnalyticsComponent.ReceiveSpawningCardFinishedSpawning // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DirectorCardsPanelUserWidget
// Size: 0x450 (Inherited: 0x450)
struct UDirectorCardsPanelUserWidget : UGobiUserWidget {

	void PlayLoadoutCardsTTSMessage(); // Function Gobi.DirectorCardsPanelUserWidget.PlayLoadoutCardsTTSMessage // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DirectorCardWeightsConverter
// Size: 0x40 (Inherited: 0x38)
struct UDirectorCardWeightsConverter : UDataAsset {
	bool bUpdate; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Gobi.DismembermentAnimInstance
// Size: 0x2f0 (Inherited: 0x2c0)
struct UDismembermentAnimInstance : UAnimInstance {
	struct FPoseSnapshot PoseSnapshot; // 0x2b8(0x38)
};

// Class Gobi.DistanceMapManager
// Size: 0x90 (Inherited: 0x30)
struct UDistanceMapManager : UObject {
	char pad_30[0x60]; // 0x30(0x60)

	void OnNavDataRegistered(struct ANavigationData* NavData); // Function Gobi.DistanceMapManager.OnNavDataRegistered // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DistanceMapNavQueryFilter
// Size: 0x50 (Inherited: 0x50)
struct UDistanceMapNavQueryFilter : UNavigationQueryFilter {
};

// Class Gobi.DistanceMapSourceComponent
// Size: 0x4e0 (Inherited: 0x4a0)
struct UDistanceMapSourceComponent : UPrimitiveComponent {
	bool bShouldEnableOnBegin; // 0x4a0(0x01)
	char pad_4A1[0x3]; // 0x4a1(0x03)
	int32_t DebugMapIdx; // 0x4a4(0x04)
	char pad_4A8[0x18]; // 0x4a8(0x18)
	float DistanceThresholdForRegen; // 0x4c0(0x04)
	float SearchDistance; // 0x4c4(0x04)
	bool bRequiresDeltas; // 0x4c8(0x01)
	char pad_4C9[0x3]; // 0x4c9(0x03)
	struct FNavAgentSelector SupportedAgents; // 0x4cc(0x04)
	bool bAllowMultipleSupportedAgents; // 0x4d0(0x01)
	char pad_4D1[0xf]; // 0x4d1(0x0f)

	void OnNavigationGenerationFinished(struct ANavigationData* NavData); // Function Gobi.DistanceMapSourceComponent.OnNavigationGenerationFinished // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DistanceMapTestActor
// Size: 0x280 (Inherited: 0x250)
struct ADistanceMapTestActor : AActor {
	char pad_250[0x8]; // 0x250(0x08)
	bool bShouldDrawMap; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)
	struct ADistanceMapTestActor* TestA; // 0x260(0x08)
	struct ADistanceMapTestActor* TestB; // 0x268(0x08)
	struct FNavAgentSelector SupportedAgents; // 0x270(0x04)
	float SearchDistance; // 0x274(0x04)
	char pad_278[0x8]; // 0x278(0x08)
};

// Class Gobi.Door
// Size: 0x528 (Inherited: 0x250)
struct ADoor : AActor {
	struct USceneComponent* InternalRootComponent; // 0x250(0x08)
	struct USceneComponent* DoorHingeComponent; // 0x258(0x08)
	struct UStaticMeshComponent* DoorMeshComponent; // 0x260(0x08)
	struct UBoxComponent* UseTriggerVolumeComponent; // 0x268(0x08)
	struct UPingableComponent* PingableComponent; // 0x270(0x08)
	struct UAkAcousticPortalComponent* AkAcousticPortalComponent; // 0x278(0x08)
	struct UGobiNavModifierComponent* NavModifierComponent; // 0x280(0x08)
	struct UGobiNavLinkComponent* NavLinkComponent; // 0x288(0x08)
	char pad_290[0x8]; // 0x290(0x08)
	struct UNavRedirectorComponent* NavRedirector; // 0x298(0x08)
	bool bTriggerHorde; // 0x2a0(0x01)
	bool bAffectAISteeringSeparation; // 0x2a1(0x01)
	char pad_2A2[0x6]; // 0x2a2(0x06)
	struct FDoorNavArea DoorNavModifiers; // 0x2a8(0x10)
	struct FDoorNavArea DoorNavLinkAreas; // 0x2b8(0x10)
	bool bShouldStumbleWhenMoving; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	struct UGobiDamageType* StumbleDamageType; // 0x2d0(0x08)
	struct UAkAudioEvent* SingleOpenStartSound; // 0x2d8(0x08)
	struct UAkAudioEvent* SingleOpenEndSound; // 0x2e0(0x08)
	struct UAkAudioEvent* SingleCloseStartSound; // 0x2e8(0x08)
	struct UAkAudioEvent* SingleCloseEndSound; // 0x2f0(0x08)
	struct UAkAudioEvent* DoubleOpenStartSound; // 0x2f8(0x08)
	struct UAkAudioEvent* DoubleOpenEndSound; // 0x300(0x08)
	struct UAkAudioEvent* DoubleCloseStartSound; // 0x308(0x08)
	struct UAkAudioEvent* DoubleCloseEndSound; // 0x310(0x08)
	struct FMulticastInlineDelegate OnDoorActionBegin; // 0x318(0x10)
	struct FMulticastInlineDelegate OnDoorActionComplete; // 0x328(0x10)
	struct FMulticastInlineDelegate OnDoorInitialized; // 0x338(0x10)
	struct ADoor* SyncedDoor; // 0x348(0x08)
	struct UAnimMontage* OpenAnimation; // 0x350(0x08)
	struct UAnimMontage* AlreadyOpenedAnimation; // 0x358(0x08)
	struct UAnimMontage* CloseAnimation; // 0x360(0x08)
	struct UAnimMontage* ClosedAnimation; // 0x368(0x08)
	struct UCurveFloat* DoorOpenCurve; // 0x370(0x08)
	struct UCurveFloat* DoorCloseCurve; // 0x378(0x08)
	struct FCollisionProfileName DamageVolumeOpenDoorCollision; // 0x380(0x08)
	struct FCollisionProfileName DamageVolumeClosedDoorCollision; // 0x388(0x08)
	char pad_390[0x3c]; // 0x390(0x3c)
	float MovementTime; // 0x3cc(0x04)
	float OpenDelay; // 0x3d0(0x04)
	float AnimationLengthOverride; // 0x3d4(0x04)
	float OpenYawRotation; // 0x3d8(0x04)
	struct FVector OpenLocation; // 0x3dc(0x0c)
	bool bCanOpenReversed; // 0x3e8(0x01)
	bool bStartLocked; // 0x3e9(0x01)
	bool bSingleUse; // 0x3ea(0x01)
	bool bHasCollisionWhenOpen; // 0x3eb(0x01)
	bool bHasCollisionWhenMoving; // 0x3ec(0x01)
	char pad_3ED[0x3]; // 0x3ed(0x03)
	float RequiredUnlockTime; // 0x3f0(0x04)
	bool bAutoClose; // 0x3f4(0x01)
	char pad_3F5[0x3]; // 0x3f5(0x03)
	float AutoCloseTime; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	float NavOpenThreshold; // 0x400(0x04)
	struct FGameplayTag DoorStartOpeningCue; // 0x404(0x08)
	struct FGameplayTag DoorStartClosingCue; // 0x40c(0x08)
	struct FGameplayTag DoorFinishClosingCue; // 0x414(0x08)
	struct FGameplayTag DoorFinishOpeningCue; // 0x41c(0x08)
	struct FGameplayTag HordeStartCue; // 0x424(0x08)
	char pad_42C[0x2c]; // 0x42c(0x2c)
	enum class EDoorState DesiredDoorState; // 0x458(0x01)
	bool bRequestLocked; // 0x459(0x01)
	enum class EAlarmMode AlarmMode; // 0x45a(0x01)
	char pad_45B[0x1]; // 0x45b(0x01)
	float AlarmChance; // 0x45c(0x04)
	float AlarmDuration; // 0x460(0x04)
	float AlarmDamageActivationRange; // 0x464(0x04)
	int32_t HitsToTriggerAlarm; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct FGameplayTagContainer AlarmOmenTags; // 0x470(0x20)
	struct TArray<struct FDoorAlarmAudio> AlarmAudioEvents; // 0x490(0x10)
	struct TArray<struct AActor*> AlarmActors; // 0x4a0(0x10)
	struct UAkComponent* AlarmAkComponent; // 0x4b0(0x08)
	char pad_4B8[0x20]; // 0x4b8(0x20)
	struct TArray<struct USceneComponent*> AlarmSceneComponents; // 0x4d8(0x10)
	char pad_4E8[0x18]; // 0x4e8(0x18)
	struct UAkAudioEvent* AlarmLoop; // 0x500(0x08)
	struct UAkAudioEvent* AlarmLoopStop; // 0x508(0x08)
	struct UAkAudioEvent* AlarmBeepSound; // 0x510(0x08)
	float AlarmBeepRate; // 0x518(0x04)
	enum class EAlarmState AlarmState; // 0x51c(0x01)
	char pad_51D[0xb]; // 0x51d(0x0b)

	void SetEnabled(bool bEnabled); // Function Gobi.Door.SetEnabled // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DoorAlarmGameCoachLesson
// Size: 0x4c0 (Inherited: 0x488)
struct UDoorAlarmGameCoachLesson : UGobiGameCoachLesson {
	float AlarmTeachDuration; // 0x488(0x04)
	char pad_48C[0x34]; // 0x48c(0x34)
};

// Class Gobi.DoorAlarmGameCoachLessonComponent
// Size: 0x108 (Inherited: 0x108)
struct UDoorAlarmGameCoachLessonComponent : UGameCoachLessonsComponent {
};

// Class Gobi.Drawbridge
// Size: 0x460 (Inherited: 0x250)
struct ADrawbridge : AActor {
	struct USceneComponent* InternalRootComponent; // 0x250(0x08)
	struct UStaticMeshComponent* BridgeStaticMeshComp; // 0x258(0x08)
	struct UStaticMeshComponent* PulleyStaticMeshComp; // 0x260(0x08)
	struct UStaticMeshComponent* PulleyRopeStaticMeshComp; // 0x268(0x08)
	struct USkeletalMeshComponent* CrankSkeletalMeshComp; // 0x270(0x08)
	struct UCableComponent* CrankPulleyCableComp; // 0x278(0x08)
	struct UCableComponent* CrankBridgeCableComp; // 0x280(0x08)
	struct USceneComponent* CableBridgeAttachPoint; // 0x288(0x08)
	struct USceneComponent* CableCrankAttachPoint; // 0x290(0x08)
	struct USceneComponent* CrankLocation; // 0x298(0x08)
	struct UParticleSystemComponent* RopeParticleSystemComp; // 0x2a0(0x08)
	struct UParticleSystemComponent* BridgeImpactParticleSystemComp; // 0x2a8(0x08)
	struct UUsableComponent* UsableComponent; // 0x2b0(0x08)
	struct UBoxComponent* UsableTriggerComponent; // 0x2b8(0x08)
	struct UUsableHighlightComponent* UsableHighlightComp; // 0x2c0(0x08)
	struct UGameplayEffectsComponent* GameplayEffectsComp; // 0x2c8(0x08)
	struct UItemAkBankComponent* ItemAkBankComponent; // 0x2d0(0x08)
	struct UAkComponent* PulleyAKComponent; // 0x2d8(0x08)
	struct UAkComponent* CrankAKComponent; // 0x2e0(0x08)
	struct UAkComponent* BridgeAKComponent; // 0x2e8(0x08)
	struct UBoxComponent* StartLessonTriggerBox; // 0x2f0(0x08)
	struct UGameCoachLessonsComponent* GameCoachLessonsComponent; // 0x2f8(0x08)
	struct FMulticastInlineDelegate OnBridgeFullyLowered; // 0x300(0x10)
	struct UAnimMontage* UseMontage3P; // 0x310(0x08)
	struct FString TriggerHordeReason; // 0x318(0x10)
	struct AActor* GobiNavModifierActor; // 0x328(0x08)
	struct AAISpawnActorVolume* SpawnActorVolume; // 0x330(0x08)
	struct FGameplayTag HordeBlockingTag; // 0x338(0x08)
	float StartingBridgePitch; // 0x340(0x04)
	float EndingBridgePitch; // 0x344(0x04)
	float RopeBreakPct; // 0x348(0x04)
	float RotationProgressMultiplier; // 0x34c(0x04)
	float PulleyMultiplier; // 0x350(0x04)
	float BridgeFallSpeedIncrease; // 0x354(0x04)
	float MaxBridgeFallSpeed; // 0x358(0x04)
	float MaxBridgeToolkitFallSpeed; // 0x35c(0x04)
	struct FWalkableSlopeOverride BridgeLoweredWalkableSlopeOverride; // 0x360(0x10)
	struct TSet<struct TWeakObjectPtr<struct AActor>> ActorsToDestroyWhenLowered; // 0x370(0x50)
	struct TArray<struct UMaterialInterface*> LoweredCrankMaterials; // 0x3c0(0x10)
	float LessonDelay; // 0x3d0(0x04)
	struct FName CableScalarParameterName; // 0x3d4(0x08)
	float CrankBridgeCableMultiplier; // 0x3dc(0x04)
	float CrankPulleyCableMultiplier; // 0x3e0(0x04)
	char pad_3E4[0x4]; // 0x3e4(0x04)
	struct UAkAudioEvent* AKEPulleyLoop; // 0x3e8(0x08)
	struct UAkAudioEvent* AKEPulleyLoopStop; // 0x3f0(0x08)
	struct UAkAudioEvent* AKEHandleLoop; // 0x3f8(0x08)
	struct UAkAudioEvent* AKEHandleLoopStop; // 0x400(0x08)
	struct UAkAudioEvent* AKEBridgeCreakLoop; // 0x408(0x08)
	struct UAkAudioEvent* AKEBridgeCreakLoopStop; // 0x410(0x08)
	struct UAkAudioEvent* AKEBridgeSquealLoop; // 0x418(0x08)
	struct UAkAudioEvent* AKEBridgeSquealLoopStop; // 0x420(0x08)
	struct UAkAudioEvent* AKEBridgeSquealFall; // 0x428(0x08)
	struct UAkAudioEvent* AKEBridgeImpact; // 0x430(0x08)
	struct UAkAudioEvent* AKEToolkitBridgeImpact; // 0x438(0x08)
	struct FGameplayTag TriggerHordeCue; // 0x440(0x08)
	float BridgeMovementPct; // 0x448(0x04)
	char pad_44C[0x14]; // 0x44c(0x14)

	void PlayerEnteredArea(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Gobi.Drawbridge.PlayerEnteredArea // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DrenchComponent
// Size: 0x270 (Inherited: 0xd8)
struct UDrenchComponent : UActorComponent {
	char pad_D8[0x114]; // 0xd8(0x114)
	bool bEnabled; // 0x1ec(0x01)
	char pad_1ED[0x3]; // 0x1ed(0x03)
	float FadeTime; // 0x1f0(0x04)
	float HalfLife; // 0x1f4(0x04)
	float MaxStrength; // 0x1f8(0x04)
	float ScaleStrength; // 0x1fc(0x04)
	float MinDecayStrength; // 0x200(0x04)
	float ReplacePct; // 0x204(0x04)
	float DecayDelay; // 0x208(0x04)
	float UpdateDelta; // 0x20c(0x04)
	struct TMap<struct FGameplayTag, struct UMeshMaterialParamSet*> DrenchParams; // 0x210(0x50)
	struct FDrenchReplicatedData IncomingDrench; // 0x260(0x0c)
	char pad_26C[0x4]; // 0x26c(0x04)

	void OnRep_IncomingDrench(); // Function Gobi.DrenchComponent.OnRep_IncomingDrench // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.DrenchAssetUserData
// Size: 0x80 (Inherited: 0x30)
struct UDrenchAssetUserData : UAssetUserData {
	struct TMap<struct FGameplayTag, struct UTexture*> DrenchMaskTextures; // 0x30(0x50)
};

// Class Gobi.DrenchInterface
// Size: 0x30 (Inherited: 0x30)
struct UDrenchInterface : UInterface {
};

// Class Gobi.DynamicSequenceBindingComponent
// Size: 0x150 (Inherited: 0xd8)
struct UDynamicSequenceBindingComponent : UActorComponent {
	struct ALevelSequenceActor* LevelSequenceActor; // 0xd8(0x08)
	struct FGameplayTagContainer BoundActorAppliedTags; // 0xe0(0x20)
	char pad_100[0x50]; // 0x100(0x50)

	bool SetLevelSequenceActor(struct ALevelSequenceActor* NewLevelSequenceActor); // Function Gobi.DynamicSequenceBindingComponent.SetLevelSequenceActor // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.EconomyAnalyticsComponent
// Size: 0x150 (Inherited: 0xd8)
struct UEconomyAnalyticsComponent : UActorComponent {
	char pad_D8[0x68]; // 0xd8(0x68)
	struct UDataTable* EntitlementsTable; // 0x140(0x08)
	char pad_148[0x8]; // 0x148(0x08)

	void TryHandleEntitlements(); // Function Gobi.EconomyAnalyticsComponent.TryHandleEntitlements // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.EffectActor
// Size: 0x2e8 (Inherited: 0x250)
struct AEffectActor : AActor {
	struct UAkComponent* AkComponent; // 0x250(0x08)
	struct TArray<struct FImpactDecalDefinition> Decals; // 0x258(0x10)
	struct TArray<struct UParticleSystem*> BaseEmitters; // 0x268(0x10)
	struct FVector2D LifetimeMinMax; // 0x278(0x08)
	float EmitterFadeOutTime; // 0x280(0x04)
	float DestroyDelay; // 0x284(0x04)
	char pad_288[0x8]; // 0x288(0x08)
	struct UAkAudioEvent* AudioAOELoop; // 0x290(0x08)
	struct UAkAudioEvent* AudioAOELoopStop; // 0x298(0x08)
	float AudioCheckRadius; // 0x2a0(0x04)
	int8_t AudioCheckCountThreshold; // 0x2a4(0x01)
	char pad_2A5[0x37]; // 0x2a5(0x37)
	struct FReplicatedEffectActorInfo ReplicatedEffectActorInfo; // 0x2dc(0x0c)

	void OnRep_ReplicatedEffectActorInfo(); // Function Gobi.EffectActor.OnRep_ReplicatedEffectActorInfo // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.EffectActorSubsystem
// Size: 0x88 (Inherited: 0x38)
struct UEffectActorSubsystem : UWorldSubsystem {
	char pad_38[0x50]; // 0x38(0x50)
};

// Class Gobi.EmissiveScalingComponent
// Size: 0x120 (Inherited: 0xd8)
struct UEmissiveScalingComponent : UActorComponent {
	struct FName EmissiveScalarParamName; // 0xd8(0x08)
	struct FName MaterialSlotName; // 0xe0(0x08)
	struct FGameplayTagContainer SkelMeshComponentTags; // 0xe8(0x20)
	char pad_108[0x18]; // 0x108(0x18)
};

// Class Gobi.EnemyAudioComponent
// Size: 0x5d0 (Inherited: 0x2d8)
struct UEnemyAudioComponent : UCharacterAudioComponent {
	bool bVocalFreeze; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)
	struct TArray<struct USoundCollectionAsset*> PossibleSoundCollectionsMale; // 0x2e0(0x10)
	struct TArray<struct USoundCollectionAsset*> PossibleSoundCollectionsFemale; // 0x2f0(0x10)
	struct TArray<struct FName> VocalizationList; // 0x300(0x10)
	char pad_310[0x10]; // 0x310(0x10)
	struct FName IdleName; // 0x320(0x08)
	struct FName BlightedIdleName; // 0x328(0x08)
	struct FVector2D IdleTimerMinMax; // 0x330(0x08)
	struct FVector2D AggroTimerMinMax; // 0x338(0x08)
	struct FVector2D BlightedIdleTimerMinMax; // 0x340(0x08)
	struct FGameplayTag BlightedTag; // 0x348(0x08)
	char pad_350[0x20]; // 0x350(0x20)
	float ChanceToPlayGoreSoundWhenHit; // 0x370(0x04)
	char pad_374[0x4]; // 0x374(0x04)
	struct UAkAudioEvent* BloodSprayAudioEvent; // 0x378(0x08)
	struct UAkAudioEvent* UtilityStopAllAudioEvent; // 0x380(0x08)
	struct TArray<struct FAudioDamageTypeEvent> LocalAudioDamageTypeEvents; // 0x388(0x10)
	struct FGameplayTag DefaultLocalDamageType; // 0x398(0x08)
	struct TArray<struct FAudioDamageTypeEvent> RemoteAudioDamageTypeEvents; // 0x3a0(0x10)
	struct FGameplayTag DefaultRemoteDamageType; // 0x3b0(0x08)
	struct FName HurtName; // 0x3b8(0x08)
	struct FName HurtCriticalName; // 0x3c0(0x08)
	struct TArray<struct UAkAudioEvent*> LocalAttackerHitWeakSpotAudioEvents; // 0x3c8(0x10)
	struct UAkAudioEvent* LocalAttackerGunHitWeakSpotAudioEvents; // 0x3d8(0x08)
	struct UAkAudioEvent* RemoteAttackerHitWeakSpotAudioEvent; // 0x3e0(0x08)
	struct FName DeathName; // 0x3e8(0x08)
	float DelayBeforeOnDeath; // 0x3f0(0x04)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	struct UAkAudioEvent* ShotgunKillAudioEvent; // 0x3f8(0x08)
	char pad_400[0x10]; // 0x400(0x10)
	struct UAkAudioEvent* DebrisDropLightAudioEvent; // 0x410(0x08)
	float ChanceToPlayDebrisDropLight; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct UAkAudioEvent* GibBloodLimbAudioEvent; // 0x420(0x08)
	struct UAkAudioEvent* GibBloodHeadAudioEvent; // 0x428(0x08)
	struct UAkAudioEvent* GibHeadAudioEvent; // 0x430(0x08)
	struct UAkAudioEvent* GibLimbAudioEvent; // 0x438(0x08)
	bool bCountTorsoAsHeadless; // 0x440(0x01)
	char pad_441[0x3]; // 0x441(0x03)
	struct FName BodyfallBoneName; // 0x444(0x08)
	struct FName BodyfallName; // 0x44c(0x08)
	bool bUseOnHitDuringRagDoll; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
	float CenterToOuterThickness; // 0x458(0x04)
	float BodyfallTimerRate; // 0x45c(0x04)
	char pad_460[0x18]; // 0x460(0x18)
	struct FName EnemyChangedLocalPlayerName; // 0x478(0x08)
	struct FName EnemyChangedName; // 0x480(0x08)
	struct UAkAudioEvent* ArmorHitAudioEvent; // 0x488(0x08)
	struct UAkAudioEvent* ArmorBreakAudioEvent; // 0x490(0x08)
	struct UAkAudioEvent* WallPounceTell; // 0x498(0x08)
	float WallPounceTellRate; // 0x4a0(0x04)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct UAkAudioBank* AudioBank; // 0x4a8(0x08)
	struct UAkAudioEvent* BeginPreSpawnAudioEvent; // 0x4b0(0x08)
	struct FDataTableRowHandle BeginPreSpawnMusicEvent; // 0x4b8(0x20)
	struct UAkAudioEvent* EndPreSpawnAudioEvent; // 0x4d8(0x08)
	struct FDataTableRowHandle EndPreSpawnMusicEvent; // 0x4e0(0x20)
	float PreSpawnRattleTimerRate; // 0x500(0x04)
	float PreSpawnRattleRadius; // 0x504(0x04)
	struct FVector2D PreSpawnRattleLocationOffsetRange; // 0x508(0x08)
	char pad_510[0x30]; // 0x510(0x30)
	float RadiusBarkNearCooldown; // 0x540(0x04)
	float DelayBetweenBehindTellAndAggro; // 0x544(0x04)
	float RadiusBarkFarCooldown; // 0x548(0x04)
	float ChanceToPlayIdleOnEnter; // 0x54c(0x04)
	bool bIgnoreIfNotTargetRadius; // 0x550(0x01)
	bool bEntersFrayDebug; // 0x551(0x01)
	char pad_552[0x2e]; // 0x552(0x2e)
	struct FGameplayTag DespawnTag; // 0x580(0x08)
	char pad_588[0x8]; // 0x588(0x08)
	struct FGameplayTagContainer HitMarkerSlimeTagContainer; // 0x590(0x20)
	struct UAkAudioEvent* HitMarkerSlimeAudioEvent; // 0x5b0(0x08)
	struct UAkAudioEvent* HitMarkerGoreAudioEvent; // 0x5b8(0x08)
	struct UAkAudioEvent* HitMarkerMeleeSwtAudioEvent; // 0x5c0(0x08)
	char pad_5C8[0x8]; // 0x5c8(0x08)

	void StartAfterDeathTimers(); // Function Gobi.EnemyAudioComponent.StartAfterDeathTimers // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.EnvQueryContext_AIActorsInRange
// Size: 0x38 (Inherited: 0x30)
struct UEnvQueryContext_AIActorsInRange : UEnvQueryContext {
	struct FAISenseAffiliationFilter Affiliation; // 0x30(0x04)
	float Radius; // 0x34(0x04)
};

// Class Gobi.EnvQueryContext_Blackboard
// Size: 0x60 (Inherited: 0x30)
struct UEnvQueryContext_Blackboard : UEnvQueryContext {
	struct UBlackboardData* BlackboardAsset; // 0x30(0x08)
	struct FBlackboardKeySelector BlackboardKey; // 0x38(0x28)
};

// Class Gobi.EnvQueryContext_Character
// Size: 0x38 (Inherited: 0x30)
struct UEnvQueryContext_Character : UEnvQueryContext {
	struct AGobiCharacter* CharacterClass; // 0x30(0x08)
};

// Class Gobi.EnvQueryContext_ClosestToObjective
// Size: 0x30 (Inherited: 0x30)
struct UEnvQueryContext_ClosestToObjective : UEnvQueryContext {
};

// Class Gobi.EnvQueryContext_CurrentSafeRoom
// Size: 0x30 (Inherited: 0x30)
struct UEnvQueryContext_CurrentSafeRoom : UEnvQueryContext {
};

// Class Gobi.EnvQueryContext_NavFloorBase
// Size: 0x38 (Inherited: 0x30)
struct UEnvQueryContext_NavFloorBase : UEnvQueryContext {
	bool bUseAgentRadius; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float SearchRadius; // 0x34(0x04)
};

// Class Gobi.EnvQueryContext_Objective
// Size: 0x68 (Inherited: 0x30)
struct UEnvQueryContext_Objective : UEnvQueryContext {
	struct FAIDataProviderUObjectValue GameplayObjectiveClass; // 0x30(0x38)
};

// Class Gobi.EnvQueryContext_ObjectivePathPointOfScrimmage
// Size: 0x30 (Inherited: 0x30)
struct UEnvQueryContext_ObjectivePathPointOfScrimmage : UEnvQueryContext {
};

// Class Gobi.EnvQueryContext_PerceivedActors
// Size: 0x80 (Inherited: 0x30)
struct UEnvQueryContext_PerceivedActors : UEnvQueryContext {
	struct FAISenseAffiliationFilter Affiliation; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FGameplayTagQuery TagQueryToMatch; // 0x38(0x48)
};

// Class Gobi.EnvQueryContext_Player
// Size: 0x78 (Inherited: 0x30)
struct UEnvQueryContext_Player : UEnvQueryContext {
	struct FGameplayTagQuery GameplayTagsQuery; // 0x30(0x48)
};

// Class Gobi.EnvQueryContext_PVPHoldout
// Size: 0x30 (Inherited: 0x30)
struct UEnvQueryContext_PVPHoldout : UEnvQueryContext {
};

// Class Gobi.EnvQueryContext_QuerierNavFloor
// Size: 0x40 (Inherited: 0x38)
struct UEnvQueryContext_QuerierNavFloor : UEnvQueryContext_NavFloorBase {
	float SearchHeight; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Gobi.EnvQueryContext_ScenarioData
// Size: 0x38 (Inherited: 0x30)
struct UEnvQueryContext_ScenarioData : UEnvQueryContext {
	struct FGameplayTag ScenarioTag; // 0x30(0x08)
};

// Class Gobi.EnvQueryContext_SpawnContextHero
// Size: 0x38 (Inherited: 0x30)
struct UEnvQueryContext_SpawnContextHero : UEnvQueryContext {
	bool bCurrentHeroOnly; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Gobi.EnvQueryGenerator_ActorsOfTypes
// Size: 0xe0 (Inherited: 0x58)
struct UEnvQueryGenerator_ActorsOfTypes : UEnvQueryGenerator {
	struct TArray<struct FAIDataProviderUObjectValue> ActorTypes; // 0x58(0x10)
	struct FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x68(0x38)
	struct FAIDataProviderFloatValue SearchRadius; // 0xa0(0x38)
	struct UEnvQueryContext* SearchCenter; // 0xd8(0x08)
};

// Class Gobi.EnvQueryGenerator_AICharacters
// Size: 0x1c0 (Inherited: 0x58)
struct UEnvQueryGenerator_AICharacters : UEnvQueryGenerator {
	struct FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58(0x38)
	struct UEnvQueryContext* SearchCenter; // 0x90(0x08)
	struct FAIDataProviderFloatValue SearchRadius; // 0x98(0x38)
	struct FAIDataProviderGameplayTagQueryContainerValue TagQuery; // 0xd0(0x78)
	struct FAIDataProviderGameplayTagQueryContainerValue SecondaryTagQuery; // 0x148(0x78)
};

// Class Gobi.EnvQueryGenerator_AISpawners
// Size: 0x188 (Inherited: 0x58)
struct UEnvQueryGenerator_AISpawners : UEnvQueryGenerator {
	struct UEnvQueryContext* SearchCenter; // 0x58(0x08)
	struct FAIDataProviderFloatValue SearchRadius; // 0x60(0x38)
	struct FAIDataProviderGameplayTagQueryContainerValue TagQuery; // 0x98(0x78)
	struct FAIDataProviderGameplayTagQueryContainerValue SecondaryTagQuery; // 0x110(0x78)
};

// Class Gobi.EnvQueryGenerator_ItemPickups
// Size: 0x98 (Inherited: 0x58)
struct UEnvQueryGenerator_ItemPickups : UEnvQueryGenerator {
	struct UEnvQueryContext* SearchCenter; // 0x58(0x08)
	struct FAIDataProviderFloatValue SearchRadius; // 0x60(0x38)
};

// Class Gobi.EnvQueryGenerator_NavmeshBordersCentroids
// Size: 0xf0 (Inherited: 0x58)
struct UEnvQueryGenerator_NavmeshBordersCentroids : UEnvQueryGenerator {
	struct UNavigationQueryFilter* NavigationFilter; // 0x58(0x08)
	struct FAIDataProviderFloatValue SearchRadius; // 0x60(0x38)
	struct FAIDataProviderFloatValue SpaceBetween; // 0x98(0x38)
	bool bPlaceOnBorders; // 0xd0(0x01)
	bool bPlaceCentroids; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)
	struct UEnvQueryContext* Querier; // 0xd8(0x08)
	bool bPlaceAtQuerierLocation; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
	struct UEnvQueryContext* GenerateAround; // 0xe8(0x08)
};

// Class Gobi.EnvQueryGenerator_PathingSpline
// Size: 0x70 (Inherited: 0x58)
struct UEnvQueryGenerator_PathingSpline : UEnvQueryGenerator {
	int32_t NumPointsToConsiderAlongSpline; // 0x58(0x04)
	float DistanceInterval; // 0x5c(0x04)
	int32_t NumPointsToConsiderWide; // 0x60(0x04)
	float WidthInterval; // 0x64(0x04)
	float NavRaycastLength; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class Gobi.EnvQueryGenerator_Perception
// Size: 0x60 (Inherited: 0x58)
struct UEnvQueryGenerator_Perception : UEnvQueryGenerator {
	struct UEnvQueryContext* SearchCenter; // 0x58(0x08)
};

// Class Gobi.EnvQueryGenerator_SingleActor
// Size: 0x60 (Inherited: 0x58)
struct UEnvQueryGenerator_SingleActor : UEnvQueryGenerator {
	struct UEnvQueryContext* ActorContext; // 0x58(0x08)
};

// Class Gobi.EnvQueryGenerator_SmartActorGrid
// Size: 0x70 (Inherited: 0x58)
struct UEnvQueryGenerator_SmartActorGrid : UEnvQueryGenerator {
	struct AAISmartActorBase* SmartActorClass; // 0x58(0x08)
	float SearchRadius; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct UEnvQueryContext* SearchCenter; // 0x68(0x08)
};

// Class Gobi.EnvQueryGenerator_Spiral
// Size: 0x1a8 (Inherited: 0x88)
struct UEnvQueryGenerator_Spiral : UEnvQueryGenerator_ProjectedPoints {
	struct FAIDataProviderFloatValue InnerRadius; // 0x88(0x38)
	struct FAIDataProviderFloatValue OuterRadius; // 0xc0(0x38)
	struct FAIDataProviderIntValue NumberOfLoops; // 0xf8(0x38)
	struct FAIDataProviderFloatValue SpaceBetweenLoops; // 0x130(0x38)
	struct FAIDataProviderFloatValue SpaceBetweenPoints; // 0x168(0x38)
	struct UEnvQueryContext* Center; // 0x1a0(0x08)
};

// Class Gobi.EnvQueryGenerator_Teammates
// Size: 0xd8 (Inherited: 0x58)
struct UEnvQueryGenerator_Teammates : UEnvQueryGenerator {
	bool bPlayersOnly; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct FAIDataProviderGameplayTagQueryContainerValue TagQuery; // 0x60(0x78)
};

// Class Gobi.EnvQueryGenerator_TRSPathingGrid
// Size: 0x130 (Inherited: 0x58)
struct UEnvQueryGenerator_TRSPathingGrid : UEnvQueryGenerator {
	struct UNavigationQueryFilter* NavigationFilter; // 0x58(0x08)
	struct FAIDataProviderFloatValue GridHalSize; // 0x60(0x38)
	struct FAIDataProviderFloatValue SpaceBetween; // 0x98(0x38)
	bool bPlaceCentroids; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
	struct FAIDataProviderFloatValue CentroidCullDistance; // 0xd8(0x38)
	struct UEnvQueryContext* GenerateAround; // 0x110(0x08)
	struct UEnvQueryContext* Querier; // 0x118(0x08)
	bool bPlaceAtQuerierLocation; // 0x120(0x01)
	bool bSearchNearbyContextOnFail; // 0x121(0x01)
	char pad_122[0x2]; // 0x122(0x02)
	int32_t MinPolysToConsiderAFail; // 0x124(0x04)
	float NearbyContextSearchRange; // 0x128(0x04)
	char pad_12C[0x4]; // 0x12c(0x04)
};

// Class Gobi.EnvQueryGenerator_Usables
// Size: 0x98 (Inherited: 0x58)
struct UEnvQueryGenerator_Usables : UEnvQueryGenerator {
	struct UEnvQueryContext* SearchCenter; // 0x58(0x08)
	struct FAIDataProviderFloatValue SearchRadius; // 0x60(0x38)
};

// Class Gobi.EnvQueryGenerator_WallClingLocations
// Size: 0xa0 (Inherited: 0x58)
struct UEnvQueryGenerator_WallClingLocations : UEnvQueryGenerator {
	struct UEnvQueryContext* SearchCenter; // 0x58(0x08)
	struct FAIDataProviderFloatValue SearchRadius; // 0x60(0x38)
	bool bExcludeClaimed; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Gobi.EnvQueryItemType_ActorComponentBase
// Size: 0x38 (Inherited: 0x38)
struct UEnvQueryItemType_ActorComponentBase : UEnvQueryItemType_VectorBase {
};

// Class Gobi.EnvQueryItemType_ActorComponent
// Size: 0x38 (Inherited: 0x38)
struct UEnvQueryItemType_ActorComponent : UEnvQueryItemType_ActorComponentBase {
};

// Class Gobi.EnvQueryItemType_ItemPickup
// Size: 0x38 (Inherited: 0x38)
struct UEnvQueryItemType_ItemPickup : UEnvQueryItemType_Actor {
};

// Class Gobi.EnvQueryItemType_PerceivedActor
// Size: 0x38 (Inherited: 0x38)
struct UEnvQueryItemType_PerceivedActor : UEnvQueryItemType_Actor {
};

// Class Gobi.EnvQueryTest_ActiveAreaSetVisibility
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_ActiveAreaSetVisibility : UEnvQueryTest {
	int32_t Visibility; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class Gobi.EnvQueryTest_ActiveAreaSetVisibilityCount
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_ActiveAreaSetVisibilityCount : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_CanHearSpawnActor
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_CanHearSpawnActor : UEnvQueryTest {
	struct UEnvQueryContext* ListenerContext; // 0x208(0x08)
	float ListenerZOffset; // 0x210(0x04)
	char pad_214[0x4]; // 0x214(0x04)
};

// Class Gobi.EnvQueryTest_CanSeeSpawnActor
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_CanSeeSpawnActor : UEnvQueryTest {
	struct UEnvQueryContext* LookerContext; // 0x208(0x08)
	float LookerZOffset; // 0x210(0x04)
	char pad_214[0x4]; // 0x214(0x04)
};

// Class Gobi.EnvQueryTest_CheckGameplayTags
// Size: 0x318 (Inherited: 0x208)
struct UEnvQueryTest_CheckGameplayTags : UEnvQueryTest {
	struct FAIDataProviderGameplayTagQueryContainerValue TagQuery; // 0x208(0x78)
	bool bUseTagQuery; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct FAIDataProviderGameplayTagContainerValue TagsToCheck; // 0x288(0x50)
	enum class EGameplayContainerMatchType DefaultCheckOption; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)
	struct FAIDataProviderIntValue CheckOption; // 0x2e0(0x38)
};

// Class Gobi.EnvQueryTest_CreationTime
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_CreationTime : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_DeltaMap
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_DeltaMap : UEnvQueryTest {
	struct UEnvQueryContext* DeltaMapSource; // 0x208(0x08)
	struct FNavAgentSelector DeltaMapNavMesh; // 0x210(0x04)
	enum class EEnvItemStatus ItemsWithNoDeltaShould; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
};

// Class Gobi.EnvQueryTest_Directness
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_Directness : UEnvQueryTest {
	struct UEnvQueryContext* DirectnessTo; // 0x208(0x08)
	struct UEnvQueryContext* DirectnessFrom; // 0x210(0x08)
};

// Class Gobi.EnvQueryTest_DirectnessDistance
// Size: 0x220 (Inherited: 0x208)
struct UEnvQueryTest_DirectnessDistance : UEnvQueryTest {
	struct UEnvQueryContext* DirectnessTo; // 0x208(0x08)
	struct UEnvQueryContext* DirectnessFrom; // 0x210(0x08)
	float DistanceRadius; // 0x218(0x04)
	char pad_21C[0x4]; // 0x21c(0x04)
};

// Class Gobi.EnvQueryTest_DistanceAlongGoldenPathDelta
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_DistanceAlongGoldenPathDelta : UEnvQueryTest {
	struct UEnvQueryContext* HeroContext; // 0x208(0x08)
};

// Class Gobi.EnvQueryTest_DistanceMapBase
// Size: 0x2a8 (Inherited: 0x208)
struct UEnvQueryTest_DistanceMapBase : UEnvQueryTest {
	enum class EDMapDirectionMode DirectionMode; // 0x208(0x01)
	bool bUseDirectionModeDataProvider; // 0x209(0x01)
	char pad_20A[0x6]; // 0x20a(0x06)
	struct FAIDataProviderIntValue DirectionModeDataProvider; // 0x210(0x38)
	enum class ERelativeDistanceMode RelativeDistanceMode; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
	struct FAIDataProviderFloatValue RelativeDistancePadding; // 0x250(0x38)
	struct UEnvQueryContext* RelativeDistanceSources; // 0x288(0x08)
	enum class EEnvItemStatus ItemResultWhenNoRelativeSourcesOnMap; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	struct FNavAgentSelector DistanceMapNavMesh; // 0x294(0x04)
	struct UEnvQueryContext* DistanceMapSource; // 0x298(0x08)
	enum class EEnvItemStatus ItemsNotOnMapShould; // 0x2a0(0x01)
	bool bInvertScore; // 0x2a1(0x01)
	char pad_2A2[0x6]; // 0x2a2(0x06)
};

// Class Gobi.EnvQueryTest_DistanceMap
// Size: 0x2a8 (Inherited: 0x2a8)
struct UEnvQueryTest_DistanceMap : UEnvQueryTest_DistanceMapBase {
};

// Class Gobi.EnvQueryTest_DistanceMapBasic
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_DistanceMapBasic : UEnvQueryTest {
	struct UEnvQueryContext* DistanceMapSource; // 0x208(0x08)
	struct FNavAgentSelector DistanceMapNavMesh; // 0x210(0x04)
	enum class EEnvItemStatus ItemsWithNoDistanceShould; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
};

// Class Gobi.EnvQueryTest_DistanceMapItem
// Size: 0x2a8 (Inherited: 0x2a8)
struct UEnvQueryTest_DistanceMapItem : UEnvQueryTest_DistanceMapBase {
};

// Class Gobi.EnvQueryTest_EnemyClaim
// Size: 0x278 (Inherited: 0x208)
struct UEnvQueryTest_EnemyClaim : UEnvQueryTest {
	struct FAIDataProviderIntValue InitialEnemyMaxDP; // 0x208(0x38)
	struct FAIDataProviderFloatValue ClaimRadiusDP; // 0x240(0x38)
};

// Class Gobi.EnvQueryTest_EnemyDamageBase
// Size: 0x2a0 (Inherited: 0x208)
struct UEnvQueryTest_EnemyDamageBase : UEnvQueryTest {
	struct FGameplayTagQuery TagRequirements; // 0x208(0x48)
	struct FGameplayTagQuery FilterTagRequirements; // 0x250(0x48)
	bool bOwnerDamageOnly; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
};

// Class Gobi.EnvQueryTest_EnemyDamageAmount
// Size: 0x2a8 (Inherited: 0x2a0)
struct UEnvQueryTest_EnemyDamageAmount : UEnvQueryTest_EnemyDamageBase {
	bool bUseDamagePrecent; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
};

// Class Gobi.EnvQueryTest_EnemyDamageAttackable
// Size: 0x3c8 (Inherited: 0x2a0)
struct UEnvQueryTest_EnemyDamageAttackable : UEnvQueryTest_EnemyDamageBase {
	struct FAIDataProviderIntValue MaxAttackFailures; // 0x2a0(0x38)
	bool bUseAttackTime; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)
	struct FAIDataProviderFloatValue MaxTimeSinceAttackFailure; // 0x2e0(0x38)
	bool bUseAttackDistance; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct FAIDataProviderBoolValue UseAttackLocation; // 0x320(0x38)
	struct FAIDataProviderFloatValue MinDistanceSinceAttackFailure; // 0x358(0x38)
	struct FAIDataProviderFloatValue MaxDistance; // 0x390(0x38)
};

// Class Gobi.EnvQueryTest_EnemyDamageLocation
// Size: 0x2a8 (Inherited: 0x2a0)
struct UEnvQueryTest_EnemyDamageLocation : UEnvQueryTest_EnemyDamageBase {
	bool bUseAttackLocation; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
};

// Class Gobi.EnvQueryTest_EnemyDamageTime
// Size: 0x2a8 (Inherited: 0x2a0)
struct UEnvQueryTest_EnemyDamageTime : UEnvQueryTest_EnemyDamageBase {
	enum class EEnemyDaamgeTimeSpan Timespan; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
};

// Class Gobi.EnvQueryTest_GoldenPathDistance
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_GoldenPathDistance : UEnvQueryTest {
	enum class EGoldenPathDistanceMode Mode; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class Gobi.EnvQueryTest_HasPathedToRecently
// Size: 0x240 (Inherited: 0x208)
struct UEnvQueryTest_HasPathedToRecently : UEnvQueryTest {
	float TimeSinceLastPathfind; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
	struct UBlackboardData* BlackboardAsset; // 0x210(0x08)
	struct FBlackboardKeySelector PathFollowInfoBBKey; // 0x218(0x28)
};

// Class Gobi.EnvQueryTest_HasTakenDamage
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_HasTakenDamage : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_HealthPercentage
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_HealthPercentage : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_HeroHasEverSeen
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_HeroHasEverSeen : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_HeroLOS
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_HeroLOS : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_HoldoutPlayAreaBox
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_HoldoutPlayAreaBox : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_HoldoutSafeZone
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_HoldoutSafeZone : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_InActiveAreaSet
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_InActiveAreaSet : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_InOrder
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_InOrder : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_InSafeRoom
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_InSafeRoom : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_InSneakVolume
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_InSneakVolume : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_IsAggro
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_IsAggro : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_IsBotAggro
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_IsBotAggro : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_IsClaimed
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_IsClaimed : UEnvQueryTest {
	struct UEnvQueryContext* Querier; // 0x208(0x08)
	float ClaimRadius; // 0x210(0x04)
	enum class ERadiusOperation RadiusOperation; // 0x214(0x01)
	enum class EEnvItemStatus ItemsClaimingTheirPositionShould; // 0x215(0x01)
	char pad_216[0x2]; // 0x216(0x02)
};

// Class Gobi.EnvQueryTest_IsCurrentEnemy
// Size: 0x240 (Inherited: 0x208)
struct UEnvQueryTest_IsCurrentEnemy : UEnvQueryTest {
	struct FAIDataProviderFloatValue StickyTimeDP; // 0x208(0x38)
};

// Class Gobi.EnvQueryTest_IsHostile
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_IsHostile : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_IsInTeamRange
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_IsInTeamRange : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_IsLocInTeamRange
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_IsLocInTeamRange : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_IsPerceived
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_IsPerceived : UEnvQueryTest {
	float MaxStimulusAge; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class Gobi.EnvQueryTest_IsSmartActorEnabledForAI
// Size: 0x248 (Inherited: 0x208)
struct UEnvQueryTest_IsSmartActorEnabledForAI : UEnvQueryTest {
	bool bUseQueryOwner; // 0x208(0x01)
	char pad_209[0x7]; // 0x209(0x07)
	struct FAIDataProviderUObjectValue AIClass; // 0x210(0x38)
};

// Class Gobi.EnvQueryTest_IsWallClingLocation
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_IsWallClingLocation : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_ItemPickupScore
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_ItemPickupScore : UEnvQueryTest {
	bool bForTeammates; // 0x208(0x01)
	char pad_209[0x7]; // 0x209(0x07)
};

// Class Gobi.EnvQueryTest_MapSpatialInfoCellSize
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_MapSpatialInfoCellSize : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_NotAggroOrOld
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_NotAggroOrOld : UEnvQueryTest {
	float OldThreshold; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class Gobi.EnvQueryTest_PlayerSpawnInfluence
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_PlayerSpawnInfluence : UEnvQueryTest {
	float DefaultScore; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class Gobi.EnvQueryTest_RescuePointOccupied
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_RescuePointOccupied : UEnvQueryTest {
	enum class ERescueOccupiedMatchType MatchType; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// Class Gobi.EnvQueryTest_ThreatLevel
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_ThreatLevel : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_TimeInActiveAreaSet
// Size: 0x210 (Inherited: 0x208)
struct UEnvQueryTest_TimeInActiveAreaSet : UEnvQueryTest {
	bool bZeroIfNotVisible; // 0x208(0x01)
	char pad_209[0x7]; // 0x209(0x07)
};

// Class Gobi.EnvQueryTest_TRSTrace
// Size: 0x338 (Inherited: 0x208)
struct UEnvQueryTest_TRSTrace : UEnvQueryTest {
	struct FEnvTraceData TraceData; // 0x208(0x30)
	enum class ETRSTraceType Type; // 0x238(0x01)
	char pad_239[0x3]; // 0x239(0x03)
	float ArcParam; // 0x23c(0x04)
	float ArcSimFrequency; // 0x240(0x04)
	float ArcMaxSimTime; // 0x244(0x04)
	struct FAIDataProviderBoolValue TraceFromContext; // 0x248(0x38)
	struct FAIDataProviderFloatValue ItemHeightOffset; // 0x280(0x38)
	struct FAIDataProviderFloatValue ItemDirectionOffset; // 0x2b8(0x38)
	struct FAIDataProviderFloatValue ContextHeightOffset; // 0x2f0(0x38)
	struct UEnvQueryContext* Context; // 0x328(0x08)
	bool bVLOGTrace; // 0x330(0x01)
	char pad_331[0x7]; // 0x331(0x07)
};

// Class Gobi.EnvQueryTest_UsableScore
// Size: 0x208 (Inherited: 0x208)
struct UEnvQueryTest_UsableScore : UEnvQueryTest {
};

// Class Gobi.EnvQueryTest_Voronoi
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_Voronoi : UEnvQueryTest {
	struct UEnvQueryContext* RegionSource; // 0x208(0x08)
	struct UEnvQueryContext* SampleSources; // 0x210(0x08)
};

// Class Gobi.EnvQueryTest_VoronoiDepth
// Size: 0x218 (Inherited: 0x208)
struct UEnvQueryTest_VoronoiDepth : UEnvQueryTest {
	struct UEnvQueryContext* RegionSource; // 0x208(0x08)
	struct UEnvQueryContext* SampleSources; // 0x210(0x08)
};

// Class Gobi.EnvQueryContext_FurthestCapableHero
// Size: 0x48 (Inherited: 0x30)
struct UEnvQueryContext_FurthestCapableHero : UEnvQueryContext {
	enum class ECapablePlayerDistanceMode DistanceMode; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UEnvQueryContext* DistanceMapSource; // 0x38(0x08)
	struct FNavAgentSelector DistanceMapNavMesh; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Gobi.EQTest_IsSmartActorAvailable
// Size: 0x208 (Inherited: 0x208)
struct UEQTest_IsSmartActorAvailable : UEnvQueryTest {
};

// Class Gobi.EQTest_VoronoiDistanceMapCell
// Size: 0x218 (Inherited: 0x208)
struct UEQTest_VoronoiDistanceMapCell : UEnvQueryTest {
	struct UEnvQueryContext* CellSource; // 0x208(0x08)
	struct FNavAgentSelector DistanceMapNavMesh; // 0x210(0x04)
	enum class EEnvItemStatus ItemsWithNoCellShould; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
};

// Class Gobi.ExplodingBarrel
// Size: 0x2e0 (Inherited: 0x250)
struct AExplodingBarrel : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x250(0x08)
	struct UExplosionComponent* ExplosionComponent; // 0x258(0x08)
	struct UParticleSystemComponent* BurnSmoke; // 0x260(0x08)
	struct UBoxComponent* NavModifierVolume; // 0x268(0x08)
	struct UPingableComponent* PingableComponent; // 0x270(0x08)
	struct UBoxComponent* PingableVolume; // 0x278(0x08)
	struct UHealthComponent* HealthComponent; // 0x280(0x08)
	struct UGobiNavModifierComponent* GobiNavModifierComponent; // 0x288(0x08)
	struct UHighlightComponent* HighlightComponent; // 0x290(0x08)
	struct UGameplayEffectsComponent* GameplayEffectsComponent; // 0x298(0x08)
	float SmokeEmitterDuration; // 0x2a0(0x04)
	float RandomHealthMin; // 0x2a4(0x04)
	float RandomHealthMax; // 0x2a8(0x04)
	struct FCollisionProfileName AfterExplosionCollision; // 0x2ac(0x08)
	float XYImpulseMin; // 0x2b4(0x04)
	float XYImpulseMax; // 0x2b8(0x04)
	float ZImpulseMin; // 0x2bc(0x04)
	float ZImpulseMax; // 0x2c0(0x04)
	float LocalRotationXYMin; // 0x2c4(0x04)
	float LocalRotationXYMax; // 0x2c8(0x04)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	struct UObject* InitialFlame; // 0x2d0(0x08)
	struct UStaticMesh* ExplodedStaticMesh; // 0x2d8(0x08)

	void BarrelExploded(struct UHealthComponent* InHealthComponent); // Function Gobi.ExplodingBarrel.BarrelExploded // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ExplosionComponent
// Size: 0x390 (Inherited: 0x220)
struct UExplosionComponent : USceneComponent {
	struct FExplosionConfig Config; // 0x220(0x100)
	char pad_320[0x8]; // 0x320(0x08)
	struct FMulticastInlineDelegate OnDebugVisualizeAddSplineComponent; // 0x328(0x10)
	struct FMulticastInlineDelegate OnExploded; // 0x338(0x10)
	float InRangeReticleRadius; // 0x348(0x04)
	char pad_34C[0x44]; // 0x34c(0x44)

	void SetLastHitPhysMat(struct UPhysicalMaterial* PhysMat); // Function Gobi.ExplosionComponent.SetLastHitPhysMat // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.ExplosionTrait
// Size: 0x140 (Inherited: 0x30)
struct UExplosionTrait : UTrait {
	struct FExplosionConfig Config; // 0x30(0x100)
	struct FGameplayTag ComponentTag; // 0x130(0x08)
	struct UExplosionComponent* ExplosionComponentClass; // 0x138(0x08)
};

// Class Gobi.FallingRockComponent
// Size: 0x120 (Inherited: 0xd8)
struct UFallingRockComponent : UActorComponent {
	enum class EFallingRockState State; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
	struct TArray<struct FFallingRockTell> FallTells; // 0xe0(0x10)
	float ExplodeDuration; // 0xf0(0x04)
	struct FGameplayTag ImpactEffectParticleSystemTag; // 0xf4(0x08)
	char pad_FC[0x24]; // 0xfc(0x24)

	void OnRep_State(enum class EFallingRockState OldState); // Function Gobi.FallingRockComponent.OnRep_State // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FireModeBaseComponent
// Size: 0x788 (Inherited: 0x150)
struct UFireModeBaseComponent : UItemBaseComponent {
	char pad_150[0x2cc]; // 0x150(0x2cc)
	char RemoteClientFireParity; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	struct UAnimMontage* LastKnownFirstPersonMontage; // 0x420(0x08)
	enum class EWeaponFireBehavior WeaponFireBehavior; // 0x428(0x01)
	bool bWantsRechamber; // 0x429(0x01)
	bool bAllowInputBuffering; // 0x42a(0x01)
	int8_t ShotsPerBurst; // 0x42b(0x01)
	int8_t AmmoRequiredPerShot; // 0x42c(0x01)
	bool bIsMountedWeapon; // 0x42d(0x01)
	char pad_42E[0x2]; // 0x42e(0x02)
	struct FGameplayTag MountedWeaponMeshTag; // 0x430(0x08)
	struct UGobiDamageType* DamageType; // 0x438(0x08)
	struct FAssetLookupWeaponTracerContainer WeaponTracer; // 0x440(0x18)
	uint32_t TracerRate; // 0x458(0x04)
	struct FVector2D TracerForwardVelocityMinMax; // 0x45c(0x08)
	struct FVector2D Tracer3PForwardVelocityMinMax; // 0x464(0x08)
	float TracerRibbonWidthFP; // 0x46c(0x04)
	float TracerRibbonWidth3P; // 0x470(0x04)
	char pad_474[0x4]; // 0x474(0x04)
	struct UParticleSystem* MuzzleFlashParticleFP; // 0x478(0x08)
	struct UParticleSystem* MuzzleFlashLoopingParticleFP; // 0x480(0x08)
	struct UParticleSystem* MuzzleFlashParticle3P; // 0x488(0x08)
	struct UParticleSystem* MuzzleFlashLoopingParticle3P; // 0x490(0x08)
	float LoopingShellEjectRate; // 0x498(0x04)
	struct FVector ShellEjectVelocity; // 0x49c(0x0c)
	struct UParticleSystem* ShellEjectParticleFP; // 0x4a8(0x08)
	struct UParticleSystem* ShellEjectLoopingParticleFP; // 0x4b0(0x08)
	struct UParticleSystem* ShellEjectParticle3P; // 0x4b8(0x08)
	struct UParticleSystem* ShellEjectLoopingParticle3P; // 0x4c0(0x08)
	struct FGameplayTag ImpactCue; // 0x4c8(0x08)
	struct FGameplayTag ShotFiredCue; // 0x4d0(0x08)
	struct FAssetLookupName MuzzleSocketName; // 0x4d8(0x18)
	struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x4f0(0x08)
	bool bForceFeedbackIsLooping; // 0x4f8(0x01)
	char pad_4F9[0x3]; // 0x4f9(0x03)
	struct FTriggerEffectsDefinition TriggerEffects; // 0x4fc(0x0c)
	struct FGameplayTagContainer BlockingTags; // 0x508(0x20)
	struct FGameplayTagContainer FiringStateAppliedTags; // 0x528(0x20)
	struct FGameplayTagContainer RechamberStateAppliedTags; // 0x548(0x20)
	struct FGameplayTagContainer AnimationCancellingTags; // 0x568(0x20)
	int32_t MinShotsBeforeAkLoop; // 0x588(0x04)
	struct FName FireRateRTPC; // 0x58c(0x08)
	char pad_594[0x4]; // 0x594(0x04)
	struct FAssetLookupAkAudioEventArray FirstPersonFireSingleEvents; // 0x598(0x20)
	struct FAssetLookupAkAudioEventArray FirstPersonFireSingleUnderBurstEvents; // 0x5b8(0x20)
	struct FAssetLookupAkAudioEventArray FirstPersonFireLoopEvents; // 0x5d8(0x20)
	struct FAssetLookupAkAudioEventArray FirstPersonFireLoopStopEvents; // 0x5f8(0x20)
	struct FAssetLookupAkAudioEvent ThirdPersonFireSingleEvent; // 0x618(0x18)
	struct FAssetLookupAkAudioEvent ThirdPersonFireLoopEvent; // 0x630(0x18)
	struct FAssetLookupAkAudioEvent ThirdPersonFireLoopStopEvent; // 0x648(0x18)
	struct FAssetLookupAkAudioEvent LastShotFireEvent; // 0x660(0x18)
	struct FAssetLookupAkAudioEvent DryFireEvent; // 0x678(0x18)
	struct FAssetLookupAkAudioEvent WhizByEvent; // 0x690(0x18)
	struct UAkAudioEvent* WindupLoopAudio; // 0x6a8(0x08)
	struct UAkAudioEvent* WindupLoopStopAudio; // 0x6b0(0x08)
	bool bFireNotPressedForThirdPersonSingle; // 0x6b8(0x01)
	char pad_6B9[0x3]; // 0x6b9(0x03)
	float WhizByMaxDistance; // 0x6bc(0x04)
	struct FAssetLookupMontageArray FireMontagesFP; // 0x6c0(0x20)
	struct FAssetLookupMontageArray FireMontages3P; // 0x6e0(0x20)
	struct FAssetLookupMontageArray RechamberMontagesFP; // 0x700(0x20)
	struct FAssetLookupMontageArray RechamberMontages3P; // 0x720(0x20)
	struct TArray<struct UGameplayEffect*> AppliedEffects; // 0x740(0x10)
	struct FFireModeBaseTuning FireModeBaseTuning; // 0x750(0x34)
	float DelayBetweenAlerts; // 0x784(0x04)

	void OnRep_RemoteClientFireParity(char OldValue); // Function Gobi.FireModeBaseComponent.OnRep_RemoteClientFireParity // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FireModeMachineGunComponent
// Size: 0x228 (Inherited: 0x150)
struct UFireModeMachineGunComponent : UItemBaseComponent {
	char pad_150[0x2c]; // 0x150(0x2c)
	float WindUpTime; // 0x17c(0x04)
	float MaxDamageDistance; // 0x180(0x04)
	float DelayBetweenDamageTicks; // 0x184(0x04)
	struct UGobiDamageType* DamageType; // 0x188(0x08)
	struct FCollisionProfileName ImpactTraceProfile; // 0x190(0x08)
	struct FCollisionProfileName ImpactEffectOverlapProfile; // 0x198(0x08)
	float ImpactEffectRadius; // 0x1a0(0x04)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct TArray<struct UGameplayEffect*> ImpactLocationGameplayEffects; // 0x1a8(0x10)
	struct FGameplayTag GunMeshTag; // 0x1b8(0x08)
	float MaxVisualTraceLength; // 0x1c0(0x04)
	float DelayBetweenVisualTraces; // 0x1c4(0x04)
	struct UAkAudioEvent* WindupLoopAudio; // 0x1c8(0x08)
	struct UAkAudioEvent* WindupLoopStopAudio; // 0x1d0(0x08)
	struct UAkAudioEvent* FireLoopAudio; // 0x1d8(0x08)
	struct UAkAudioEvent* FireLoopStopAudio; // 0x1e0(0x08)
	struct FName MuzzleFlashBoneName; // 0x1e8(0x08)
	struct FName TracerSpawnLocationBoneName; // 0x1f0(0x08)
	struct UParticleSystem* FirstPersonMuzzleFlash; // 0x1f8(0x08)
	struct UParticleSystem* ThirdPersonMuzzleFlash; // 0x200(0x08)
	struct FVector2D TracerVelocityMinMax; // 0x208(0x08)
	struct UImpactEffectConfig* ImpactEffectConfig; // 0x210(0x08)
	struct UWeaponTracer* WeaponTracer; // 0x218(0x08)
	char TracerFrequency; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)
};

// Class Gobi.FireModeShotgunComponent
// Size: 0x820 (Inherited: 0x788)
struct UFireModeShotgunComponent : UFireModeBaseComponent {
	char pad_788[0x70]; // 0x788(0x70)
	struct FFireModeShotgunTuning FireModeShotgunTuning; // 0x7f8(0x28)
};

// Class Gobi.FireModeSingleTraceComponent
// Size: 0x7b0 (Inherited: 0x788)
struct UFireModeSingleTraceComponent : UFireModeBaseComponent {
	struct FFireModeSingleTraceTuning FireModeSingleTraceTuning; // 0x788(0x18)
	char pad_7A0[0x10]; // 0x7a0(0x10)
};

// Class Gobi.FirstPartyAccountUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UFirstPartyAccountUserWidget : UGobiUserWidget {
	char pad_450[0x10]; // 0x450(0x10)
};

// Class Gobi.FPAssetSlot
// Size: 0x78 (Inherited: 0x30)
struct UFPAssetSlot : UObject {
	char pad_30[0x28]; // 0x30(0x28)
	struct TArray<struct UObject*> LoadedAssets; // 0x58(0x10)
	char pad_68[0x10]; // 0x68(0x10)
};

// Class Gobi.FirstPersonAssetLoader
// Size: 0x70 (Inherited: 0x38)
struct UFirstPersonAssetLoader : UWorldSubsystem {
	char pad_38[0x8]; // 0x38(0x08)
	struct TArray<struct UFPAssetSlot*> AssetSlots; // 0x40(0x10)
	struct UAsyncAssetSet* NearbyItemAssetSet; // 0x50(0x08)
	struct UAsyncAssetSet* AllPickupItemsAssetSet; // 0x58(0x08)
	char pad_60[0x10]; // 0x60(0x10)
};

// Class Gobi.FlashBangReceiverComponent
// Size: 0x148 (Inherited: 0xd8)
struct UFlashBangReceiverComponent : UActorComponent {
	char pad_D8[0x4]; // 0xd8(0x04)
	struct TWeakObjectPtr<struct APlayerCharacter> OwnerPlayer; // 0xdc(0x08)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct FGameplayTag FlashbangGameplayTag; // 0xe8(0x08)
	struct TWeakObjectPtr<struct UGameplayTagsComponent> GameplayTagsComponent; // 0xf0(0x08)
	char pad_F8[0x10]; // 0xf8(0x10)
	struct UMaterialInterface* FlashbangMaterial; // 0x108(0x08)
	struct FLinearColor FlashColor; // 0x110(0x10)
	struct UCurveFloat* FlashIntensityCurve; // 0x120(0x08)
	struct UCurveFloat* AfterImageIntensityCurve; // 0x128(0x08)
	float AfterImageScalePerSec; // 0x130(0x04)
	struct TWeakObjectPtr<struct UMaterialInstanceDynamic> PostProcessMaterialInstance; // 0x134(0x08)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct UFramebufferCopy* FramebufferCopy; // 0x140(0x08)

	void HandlePossessedBy(struct AController* Controller); // Function Gobi.FlashBangReceiverComponent.HandlePossessedBy // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FlashlightPoseComponent
// Size: 0x240 (Inherited: 0x220)
struct UFlashlightPoseComponent : USceneComponent {
	float SmoothAlpha; // 0x220(0x04)
	float FlashlightLeadStrength; // 0x224(0x04)
	char pad_228[0x18]; // 0x228(0x18)
};

// Class Gobi.FlashlightVolume
// Size: 0x298 (Inherited: 0x288)
struct AFlashlightVolume : ATriggerVolume {
	bool bDisableFlashlightDialogue; // 0x288(0x01)
	char pad_289[0x3]; // 0x289(0x03)
	float TimeBetweenOnOffDialogue; // 0x28c(0x04)
	char pad_290[0x8]; // 0x290(0x08)

	void OnOverlapEnd(struct AActor* Self, struct AActor* Other); // Function Gobi.FlashlightVolume.OnOverlapEnd // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FleeComponent
// Size: 0x150 (Inherited: 0xd8)
struct UFleeComponent : UActorComponent {
	struct FMulticastInlineDelegate OnDistanceConditionMet; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnHealthConditionMet; // 0xe8(0x10)
	bool bDistanceCondition; // 0xf8(0x01)
	char pad_F9[0x3]; // 0xf9(0x03)
	float FleeObjectiveDeltaDistance; // 0xfc(0x04)
	float FleeDeltaDistance; // 0x100(0x04)
	bool bHealthCondition; // 0x104(0x01)
	char pad_105[0x3]; // 0x105(0x03)
	float FleeHealthPercentDelta; // 0x108(0x04)
	bool bChanceCondition; // 0x10c(0x01)
	char pad_10D[0x3]; // 0x10d(0x03)
	float FleeChancePercent; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct FString FleeStatSpecifier; // 0x118(0x10)
	struct AGobiCharacter* CharacterOwner; // 0x128(0x08)
	char pad_130[0x20]; // 0x130(0x20)

	bool HasMetFleeConditions(); // Function Gobi.FleeComponent.HasMetFleeConditions // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FleeStatTracker
// Size: 0x40 (Inherited: 0x40)
struct UFleeStatTracker : UStatTrackerBase {
};

// Class Gobi.FloatingCrosshairUserWidget
// Size: 0x450 (Inherited: 0x450)
struct UFloatingCrosshairUserWidget : UGobiUserWidget {
};

// Class Gobi.FogMod
// Size: 0xf0 (Inherited: 0x88)
struct UFogMod : UGameplayMod {
	char bOverride_HeightFogStartDistance : 1; // 0x88(0x01)
	char bOverride_HeightFogInscatteringColor : 1; // 0x88(0x01)
	char bOverride_VolumeFogAlbedo : 1; // 0x88(0x01)
	char bOverride_MinVolumeFog : 1; // 0x88(0x01)
	char bOverride_VolumeFogNoiseScale : 1; // 0x88(0x01)
	char bOverride_VolumeFogNoisePan : 1; // 0x88(0x01)
	char bOverride_VolumeFogNoisePanSpeed : 1; // 0x88(0x01)
	char bOverride_VolumeGroundFogHeight : 1; // 0x88(0x01)
	char bOverride_VolumeGroundFogAO : 1; // 0x89(0x01)
	char pad_89_1 : 7; // 0x89(0x01)
	char pad_8A[0x2]; // 0x8a(0x02)
	float HeightFogStartDistance; // 0x8c(0x04)
	struct FLinearColor HeightFogInscatteringColor; // 0x90(0x10)
	char bUseSecondFog : 1; // 0xa0(0x01)
	char pad_A0_1 : 7; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float SecondFogDensity; // 0xa4(0x04)
	float SecondFogHeightFalloff; // 0xa8(0x04)
	float SecondFogHeightOffset; // 0xac(0x04)
	struct FLinearColor VolumeFogAlbedo; // 0xb0(0x10)
	float MinVolumeFog; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct UCurveFloat* MinVolumeFogOverTime; // 0xc8(0x08)
	float VolumeFogNoiseScale; // 0xd0(0x04)
	struct FVector VolumeFogNoisePan; // 0xd4(0x0c)
	float VolumeFogNoisePanSpeed; // 0xe0(0x04)
	float VolumeGroundFogHeight; // 0xe4(0x04)
	float VolumeGroundFogAO; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// Class Gobi.FogSubsystem
// Size: 0x80 (Inherited: 0x38)
struct UFogSubsystem : UWorldSubsystem {
	char pad_38[0x30]; // 0x38(0x30)
	struct UFogMod* BaseMod; // 0x68(0x08)
	char pad_70[0x10]; // 0x70(0x10)
};

// Class Gobi.FogVolume
// Size: 0x2a0 (Inherited: 0x250)
struct AFogVolume : AActor {
	struct FLinearColor FogColor; // 0x250(0x10)
	float MinVolumeFog; // 0x260(0x04)
	float FogNoiseScale; // 0x264(0x04)
	struct FVector FogNoisePan; // 0x268(0x0c)
	float FogNoisePanSpeed; // 0x274(0x04)
	bool bGenerateGroundFog; // 0x278(0x01)
	char pad_279[0x3]; // 0x279(0x03)
	float GroundFogHeight; // 0x27c(0x04)
	float GroundFogAO; // 0x280(0x04)
	float HeightmapPixelDistance; // 0x284(0x04)
	char pad_288[0x8]; // 0x288(0x08)
	struct UMaterialInstanceDynamic* DynamicFogMaterial; // 0x290(0x08)
	struct UTexture2D* GroundHeightmap; // 0x298(0x08)
};

// Class Gobi.FoliageDensitySubsystem
// Size: 0x48 (Inherited: 0x38)
struct UFoliageDensitySubsystem : UWorldSubsystem {
	char pad_38[0x10]; // 0x38(0x10)
};

// Class Gobi.FoliageDensityVolume
// Size: 0x330 (Inherited: 0x288)
struct AFoliageDensityVolume : AVolume {
	struct TMap<enum class EQualitySettings, float> DensityScale; // 0x288(0x50)
	struct TMap<enum class EQualitySettings, float> LODDistanceScale; // 0x2d8(0x50)
	char pad_328[0x8]; // 0x328(0x08)
};

// Class Gobi.FortificationActor
// Size: 0x418 (Inherited: 0x250)
struct AFortificationActor : AActor {
	struct UAlertComponent* AlertComponent; // 0x250(0x08)
	struct UNotificationBoxComponent* NotificationBoxComponent; // 0x258(0x08)
	struct UBoxComponent* UsableTriggerComponent; // 0x260(0x08)
	struct UUsableComponent* UsableComponent; // 0x268(0x08)
	struct USceneComponent* InternalRootComponent; // 0x270(0x08)
	struct UHealthComponent* HealthComponent; // 0x278(0x08)
	struct UStaticMeshComponent* FortificationMeshComponent; // 0x280(0x08)
	struct USkeletalMeshComponent* FortificationSkelMeshComponent; // 0x288(0x08)
	struct UDecalComponent* DecalComponent; // 0x290(0x08)
	struct UGobiNavLinkComponent* FortifiedNavLinkComponent; // 0x298(0x08)
	struct UGobiNavLinkComponent* DestroyedNavLinkComponent; // 0x2a0(0x08)
	struct UGobiNavModifierComponent* NavModifierComponent; // 0x2a8(0x08)
	struct UAkAcousticPortalComponent* AkAcousticPortalComponent; // 0x2b0(0x08)
	bool bUseSkeletalMesh; // 0x2b8(0x01)
	char pad_2B9[0x7]; // 0x2b9(0x07)
	struct TArray<struct FFortificationMeshInfo> FortificationMeshes; // 0x2c0(0x10)
	struct FFortificationSkelMeshInfo FortificationSkelMeshInfo; // 0x2d0(0x30)
	float ImpulseMagnitude; // 0x300(0x04)
	float ChanceToBeginDestroyed; // 0x304(0x04)
	bool bShowDecal; // 0x308(0x01)
	char pad_309[0x7]; // 0x309(0x07)
	struct UNavArea* DestroyedNavAreaClass; // 0x310(0x08)
	float BrokenPieceLifetime; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct UStaticMesh* BrokenFortificationMesh; // 0x320(0x08)
	struct UMaterialInterface* BrokenFortificationMaterialOverride; // 0x328(0x08)
	struct UParticleSystem* BrokenFortificationParticleEffect; // 0x330(0x08)
	bool bCanUpgradeFromBroken; // 0x338(0x01)
	char pad_339[0x7]; // 0x339(0x07)
	struct TArray<struct FUsableInventoryCondition> RequiredMaterialsForBrokenUpgrade; // 0x340(0x10)
	char pad_350[0x10]; // 0x350(0x10)
	struct UParticleSystem* DamageParticleEffect; // 0x360(0x08)
	struct UGobiDamageType* OverlapDamageType; // 0x368(0x08)
	float OverlapDamage; // 0x370(0x04)
	struct FGameplayTag OnFortificationBreakTag; // 0x374(0x08)
	char pad_37C[0x18]; // 0x37c(0x18)
	float PercentageBrokenToOpenAKPortal; // 0x394(0x04)
	char pad_398[0x80]; // 0x398(0x80)

	void OnSuccessfullyUsed(struct AActor* UsingActor); // Function Gobi.FortificationActor.OnSuccessfullyUsed // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FortificationNotificationUserWidget
// Size: 0x450 (Inherited: 0x450)
struct UFortificationNotificationUserWidget : UGobiUserWidget {
};

// Class Gobi.FOVManager
// Size: 0x2c8 (Inherited: 0x250)
struct AFOVManager : AInfo {
	char pad_250[0x8]; // 0x250(0x08)
	struct TMap<struct ULocalPlayer*, struct FPlayerFOVState> PlayerFOVStates; // 0x258(0x50)
	char pad_2A8[0x8]; // 0x2a8(0x08)
	struct TArray<struct TScriptInterface<ICustomProjectionInterface>> ActiveFirstPersonMeshes; // 0x2b0(0x10)
	char pad_2C0[0x8]; // 0x2c0(0x08)

	struct AFOVManager* GetFOVManager(struct UObject* WorldContextObject, bool bCanCreate); // Function Gobi.FOVManager.GetFOVManager // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FPRigParticleSystemComponent
// Size: 0x740 (Inherited: 0x730)
struct UFPRigParticleSystemComponent : UParticleSystemComponent {
	char pad_730[0x10]; // 0x730(0x10)
};

// Class Gobi.FPRigSkeletalMeshComponent
// Size: 0xbb0 (Inherited: 0xba0)
struct UFPRigSkeletalMeshComponent : USkeletalMeshComponent {
	char pad_BA0[0x10]; // 0xba0(0x10)
};

// Class Gobi.FPRigStaticMeshComponent
// Size: 0x5d0 (Inherited: 0x5b0)
struct UFPRigStaticMeshComponent : UStaticMeshComponent {
	char pad_5B0[0x20]; // 0x5b0(0x20)
};

// Class Gobi.FriendlyFireGameCoachLesson
// Size: 0x498 (Inherited: 0x488)
struct UFriendlyFireGameCoachLesson : UGobiGameCoachLesson {
	char pad_488[0x10]; // 0x488(0x10)
};

// Class Gobi.FriendlyFireMod
// Size: 0x90 (Inherited: 0x88)
struct UFriendlyFireMod : UGameplayMod {
	float FriendlyFireAdjustment; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// Class Gobi.FriendRequestsButtonUserWidget
// Size: 0x460 (Inherited: 0x450)
struct UFriendRequestsButtonUserWidget : UGobiUserWidget {
	char pad_450[0x10]; // 0x450(0x10)
};

// Class Gobi.FriendRequestsPopupUserWidget
// Size: 0x608 (Inherited: 0x470)
struct UFriendRequestsPopupUserWidget : UPopupUserWidget {
	char pad_470[0xe8]; // 0x470(0xe8)
	int32_t NumRequestsPerPage; // 0x558(0x04)
	int32_t NumRequestsToSearch; // 0x55c(0x04)
	char pad_560[0xa8]; // 0x560(0xa8)

	void UpdateRequestsList(struct TArray<struct FGobiOnlineUser> InRequests); // Function Gobi.FriendRequestsPopupUserWidget.UpdateRequestsList // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FriendsManager
// Size: 0x1d0 (Inherited: 0x30)
struct UFriendsManager : UObject {
	char pad_30[0x20]; // 0x30(0x20)
	struct UMatchmaking* Matchmaking; // 0x50(0x08)
	char pad_58[0x8]; // 0x58(0x08)
	struct FTaskTimerConfig TimerConfig; // 0x60(0x70)
	char pad_D0[0x100]; // 0xd0(0x100)
};

// Class Gobi.FTUEAnalyticsComponent
// Size: 0x108 (Inherited: 0xd8)
struct UFTUEAnalyticsComponent : UActorComponent {
	char pad_D8[0x30]; // 0xd8(0x30)

	void RegisterDelegate(); // Function Gobi.FTUEAnalyticsComponent.RegisterDelegate // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.PlayerSettingsBase
// Size: 0x88 (Inherited: 0x30)
struct UPlayerSettingsBase : UObject {
	struct FMulticastInlineDelegate OnApplySettings; // 0x30(0x10)
	char pad_40[0x18]; // 0x40(0x18)
	uint32_t Version; // 0x58(0x04)
	char pad_5C[0x2c]; // 0x5c(0x2c)

	void ValidateSettings(); // Function Gobi.PlayerSettingsBase.ValidateSettings // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FTUESettings
// Size: 0xf8 (Inherited: 0x88)
struct UFTUESettings : UPlayerSettingsBase {
	struct FMulticastInlineDelegate OnTutorialChanged; // 0x88(0x10)
	char pad_98[0x10]; // 0x98(0x10)
	struct TArray<struct FName> TutorialPopups; // 0xa8(0x10)
	struct TArray<struct FName> BakedMessageSlugs; // 0xb8(0x10)
	struct TArray<struct FName> DynamicMessageSlugs; // 0xc8(0x10)
	bool bHasAcceptedEULA; // 0xd8(0x01)
	bool bHasSetStartupOptions; // 0xd9(0x01)
	bool bHasCompletedTutorialLevels; // 0xda(0x01)
	bool bHasSeenCrossplayWarning; // 0xdb(0x01)
	bool bHasSeenHardwareToast; // 0xdc(0x01)
	char CompletedTutorials[0x17]; // 0xdd(0x17)
	char pad_F4[0x4]; // 0xf4(0x04)

	void SetTutorialCompleted(enum class EFTUETutorial Tutorial); // Function Gobi.FTUESettings.SetTutorialCompleted // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.FTUETutorialScreen
// Size: 0x5d8 (Inherited: 0x530)
struct UFTUETutorialScreen : UUIScreen {
	char pad_530[0x68]; // 0x530(0x68)
	struct TSoftObjectPtr<UTexture2D> BGTexture; // 0x598(0x28)
	char pad_5C0[0x18]; // 0x5c0(0x18)

	void UpdateTeamSize(int32_t NumTeams, int32_t TeamSize); // Function Gobi.FTUETutorialScreen.UpdateTeamSize // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameCoachAnalyticsComponent
// Size: 0xf0 (Inherited: 0xd8)
struct UGameCoachAnalyticsComponent : UActorComponent {
	char pad_D8[0x18]; // 0xd8(0x18)

	void HandleGameCoachSucceeded(struct UGameCoachLesson* Lesson, struct APlayerController* LocalPlayerController, struct AActor* Target); // Function Gobi.GameCoachAnalyticsComponent.HandleGameCoachSucceeded // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameCoachListUserWidget
// Size: 0x4f0 (Inherited: 0x450)
struct UGameCoachListUserWidget : UGobiUserWidget {
	struct TMap<struct TWeakObjectPtr<struct UGameCoachLesson>, struct AWaypoint*> GameCoachWaypoints; // 0x450(0x50)
	struct TMap<struct UGameCoachLesson*, struct FLessonNotificationData> NotificationLessons; // 0x4a0(0x50)

	void RemoveNotification(struct UGobiGameCoachLesson* Lesson); // Function Gobi.GameCoachListUserWidget.RemoveNotification // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameCoachNotificationUserWidget
// Size: 0x450 (Inherited: 0x450)
struct UGameCoachNotificationUserWidget : UGobiUserWidget {

	void GenerateTTSOutput(struct FText InNotificationText); // Function Gobi.GameCoachNotificationUserWidget.GenerateTTSOutput // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameCoachSettings
// Size: 0xb0 (Inherited: 0x88)
struct UGameCoachSettings : UPlayerSettingsBase {
	char pad_88[0x10]; // 0x88(0x10)
	struct TArray<struct FGameCoachLessonSettings> Lessons; // 0x98(0x10)
	int32_t TipIndex; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Gobi.GameDirectorSeamlessTravelData
// Size: 0x38 (Inherited: 0x30)
struct UGameDirectorSeamlessTravelData : UObject {
	float TimeSinceLastHorde; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class Gobi.GameDirector
// Size: 0x410 (Inherited: 0x30)
struct UGameDirector : UObject {
	struct FMulticastInlineDelegate OnHordeEvent; // 0x30(0x10)
	struct UAITypePointCosts* AITypePointCosts; // 0x40(0x08)
	char pad_48[0xa0]; // 0x48(0xa0)
	struct FPacingConfigBase PacingConfigBase; // 0xe8(0x48)
	struct TArray<struct FPacingConfigOverride> PacingConfigOverride; // 0x130(0x10)
	char pad_140[0x88]; // 0x140(0x88)
	struct UAISpawnPointBudgets* AISpawnPointBudgets; // 0x1c8(0x08)
	struct FNavAgentSelector HeroNavmeshSelector; // 0x1d0(0x04)
	char pad_1D4[0xc]; // 0x1d4(0x0c)
	struct FGameplayTagQuery ValidHeroSpawnQuery; // 0x1e0(0x48)
	struct FGameplayTagQuery ValidHeroLOSQuery; // 0x228(0x48)
	int32_t MaxAICount; // 0x270(0x04)
	char pad_274[0xc]; // 0x274(0x0c)
	struct TSoftClassPtr<UObject> TestSpawningScenarioClass; // 0x280(0x28)
	char pad_2A8[0x8]; // 0x2a8(0x08)
	float HeroDistanceScoreWeight; // 0x2b0(0x04)
	float HeroPopulationScoreWeight; // 0x2b4(0x04)
	float HeroSeparationScoreWeight; // 0x2b8(0x04)
	float HeroBudgetScoreWeight; // 0x2bc(0x04)
	float HeroLifeStateScoreWeight; // 0x2c0(0x04)
	char pad_2C4[0x2c]; // 0x2c4(0x2c)
	struct UGameIntensitySystem* IntensitySystemClass; // 0x2f0(0x08)
	struct UGameIntensitySystem* IntensitySystem; // 0x2f8(0x08)
	char pad_300[0x8]; // 0x300(0x08)
	struct FRecycleConfig RecycleConfig; // 0x308(0x18)
	struct FRecycleConfig ResolvedRecycleConfig; // 0x320(0x18)
	char pad_338[0x20]; // 0x338(0x20)
	bool bDisableHorde; // 0x358(0x01)
	bool bDebugShowStats; // 0x359(0x01)
	char pad_35A[0x18]; // 0x35a(0x18)
	enum class ECollisionChannel LOSChannel; // 0x372(0x01)
	char pad_373[0x15]; // 0x373(0x15)
	struct UAISpawnDeckGenerator* OverrideAISpawnDeckGenerator; // 0x388(0x08)
	char pad_390[0x20]; // 0x390(0x20)
	struct UAISpawnDeckGenerator* AISpawnDeckGeneratorForGobiSpawnAIFromClass; // 0x3b0(0x08)
	struct UAISpawnDeck* AISpawnDeckForGobiSpawnAIFromClass; // 0x3b8(0x08)
	struct AGameDirectorDebugger* GameDirectorDebugger; // 0x3c0(0x08)
	struct FDirectorStateSummary DirectorStateSummary; // 0x3c8(0x1c)
	char pad_3E4[0x4]; // 0x3e4(0x04)
	struct FClearAfterHordeConfig ClearAfterHordeConfig; // 0x3e8(0x10)
	char pad_3F8[0x18]; // 0x3f8(0x18)

	bool TriggerPhaseIfAllowedOnDirector(struct UObject* WorldContextObject, enum class EPacingPhase Phase, struct FString Reason); // Function Gobi.GameDirector.TriggerPhaseIfAllowedOnDirector // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameDirectorDebugger
// Size: 0x390 (Inherited: 0x250)
struct AGameDirectorDebugger : AActor {
	struct TArray<struct FHeroContext> HeroSpawnContexts; // 0x250(0x10)
	bool bAllHerosPreparing; // 0x260(0x01)
	char pad_261[0x3]; // 0x261(0x03)
	float GameIntensity; // 0x264(0x04)
	float GameIntensityRate; // 0x268(0x04)
	uint32_t GameThreatLevel; // 0x26c(0x04)
	int32_t TotalAICount; // 0x270(0x04)
	int32_t TotalAggroAICount; // 0x274(0x04)
	int32_t TotalPointBudget; // 0x278(0x04)
	int32_t NumPlayersOnNav; // 0x27c(0x04)
	int32_t NumNavmeshes; // 0x280(0x04)
	int32_t NumPlayersOnObjectiveDMap; // 0x284(0x04)
	bool bHasValidObjective; // 0x288(0x01)
	char pad_289[0x3]; // 0x289(0x03)
	int32_t NumSpawnersByPlayers; // 0x28c(0x04)
	struct TArray<struct FName> ActiveScenarios; // 0x290(0x10)
	struct TArray<struct FString> ActiveScenarioDetails; // 0x2a0(0x10)
	struct TArray<float> ActiveScenarioSpawnerSuccessRate; // 0x2b0(0x10)
	struct TArray<struct FName> DormantScenarios; // 0x2c0(0x10)
	struct TArray<struct FAISpawnActorDebugInfo> SpawnActorDebug; // 0x2d0(0x10)
	float RecycleDistance; // 0x2e0(0x04)
	float DistanceAdvancedAfterHorde; // 0x2e4(0x04)
	float CurrentObjectiveDistance; // 0x2e8(0x04)
	float ObjectiveSearchDistance; // 0x2ec(0x04)
	struct FVector ObjectiveLocation; // 0x2f0(0x0c)
	enum class EPacingPhase PacingPhase; // 0x2fc(0x01)
	char pad_2FD[0x3]; // 0x2fd(0x03)
	struct FName PhaseHolder; // 0x300(0x08)
	float RemainingPhaseTime; // 0x308(0x04)
	uint32_t HeroSpawnIdx; // 0x30c(0x04)
	struct TArray<struct FVector> GreySpawners; // 0x310(0x10)
	struct TArray<struct FVector> RedSpawners; // 0x320(0x10)
	struct TArray<struct FVector> GreenSpawners; // 0x330(0x10)
	struct TArray<struct FVector> CyanSpawners; // 0x340(0x10)
	struct TArray<struct FVector> OrangeSpawners; // 0x350(0x10)
	struct TArray<struct FVector> YellowSpawners; // 0x360(0x10)
	char pad_370[0x20]; // 0x370(0x20)
};

// Class Gobi.GameIntensitySystem
// Size: 0xb8 (Inherited: 0x30)
struct UGameIntensitySystem : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	float CombatDecayRate; // 0x40(0x04)
	float NonCombatDecayRate; // 0x44(0x04)
	float AdvancingDecayRate; // 0x48(0x04)
	int32_t NumPlayersToAverage; // 0x4c(0x04)
	struct FHeroIntensityEventData AggroEnemiesNear; // 0x50(0x14)
	struct FHeroIntensityEventData SelfDamaged; // 0x64(0x14)
	struct FHeroIntensityEventData TeammateDamaged; // 0x78(0x14)
	struct FHeroIntensityEventData TeammateIncapped; // 0x8c(0x14)
	struct FHeroIntensityEventData TeammateDied; // 0xa0(0x14)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// Class Gobi.GamepadConfigPanelUserWidget
// Size: 0x558 (Inherited: 0x4c0)
struct UGamepadConfigPanelUserWidget : UControlsOptionsPanelUserWidget {
	bool bIsZombieMode; // 0x4c0(0x01)
	char pad_4C1[0x7]; // 0x4c1(0x07)
	struct FMulticastInlineDelegate OnButtonConfigPreviewed; // 0x4c8(0x10)
	struct TArray<struct FGamepadConfigButtonData> GamepadHumanButtons; // 0x4d8(0x10)
	struct TArray<struct FGamepadConfigButtonData> GamepadZombieButtons; // 0x4e8(0x10)
	char pad_4F8[0x60]; // 0x4f8(0x60)

	void UpdateVisibilityOfCustomBindings(bool bVisible); // Function Gobi.GamepadConfigPanelUserWidget.UpdateVisibilityOfCustomBindings // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GamepadOptionsPanelUserWidget
// Size: 0x4d0 (Inherited: 0x460)
struct UGamepadOptionsPanelUserWidget : UOptionsPanelUserWidget {
	char pad_460[0x40]; // 0x460(0x40)
	struct TArray<struct UDataTable*> GamepadStickBindingData; // 0x4a0(0x10)
	char pad_4B0[0x20]; // 0x4b0(0x20)

	void UpdateGamepadLayoutImage(enum class EGamepadImage GamepadImage); // Function Gobi.GamepadOptionsPanelUserWidget.UpdateGamepadLayoutImage // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction
// Size: 0x210 (Inherited: 0x30)
struct UGameplayAction : UGobiObject {
	struct FGameplayTagContainer ActionTags; // 0x30(0x20)
	struct FGameplayTagContainer CancelActionsWithTag; // 0x50(0x20)
	struct FGameplayTagContainer BlockActionsWithTag; // 0x70(0x20)
	struct FGameplayTagQuery BlockActionsThatMatch; // 0x90(0x48)
	struct FGameplayTagQuery RunningActionTagRequirements; // 0xd8(0x48)
	struct FGameplayTagContainer ActivationOwnedTags; // 0x120(0x20)
	struct FGameplayTagQuery ActivatingActorTagRequirements; // 0x140(0x48)
	struct UGameplayEffect* CooldownEffect; // 0x188(0x08)
	struct UGameplayEffect* CooldownEffectOnSuccess; // 0x190(0x08)
	struct UGameplayEffect* CooldownEffectOnFailed; // 0x198(0x08)
	struct TArray<struct UGameplayEffect*> ActivationEffects; // 0x1a0(0x10)
	char Priority; // 0x1b0(0x01)
	bool bDisableSteeringBehavior; // 0x1b1(0x01)
	char pad_1B2[0x6]; // 0x1b2(0x06)
	struct USteeringBehavior* SteeringBehaviorOverride; // 0x1b8(0x08)
	struct USteeringControl* SteeringControlOverride; // 0x1c0(0x08)
	char pad_1C8[0x18]; // 0x1c8(0x18)
	struct AActor* ActivatingActor; // 0x1e0(0x08)
	struct AGobiCharacter* ActivatingCharacter; // 0x1e8(0x08)
	char pad_1F0[0x20]; // 0x1f0(0x20)

	bool IsInProgress(); // Function Gobi.GameplayAction.IsInProgress // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction_Ambush
// Size: 0x220 (Inherited: 0x210)
struct UGameplayAction_Ambush : UGameplayAction {
	float AmbushOnHeroLOSMinDistance; // 0x210(0x04)
	char pad_214[0x4]; // 0x214(0x04)
	float AmbushOnHeroMinDistance; // 0x218(0x04)
	char pad_21C[0x4]; // 0x21c(0x04)
};

// Class Gobi.GameplayAction_PlayMontage
// Size: 0x2e0 (Inherited: 0x210)
struct UGameplayAction_PlayMontage : UGameplayAction {
	bool bSortMontagesAlphabetically; // 0x210(0x01)
	char pad_211[0x7]; // 0x211(0x07)
	struct TArray<struct UAnimMontage*> Montages; // 0x218(0x10)
	struct TArray<struct UMontageSet*> MontageSets; // 0x228(0x10)
	struct TArray<struct UAnimMontage*> ExitMontages; // 0x238(0x10)
	struct TArray<struct UMontageSet*> ExitMontageSets; // 0x248(0x10)
	struct FGameplayTagContainer TriggerExitTags; // 0x258(0x20)
	bool bExitOnEnemyChanged; // 0x278(0x01)
	bool bExitOnAlerted; // 0x279(0x01)
	bool bAutoRepickOnBlendout; // 0x27a(0x01)
	bool bAllowExternalMontages; // 0x27b(0x01)
	struct FVector2D PlayRateRange; // 0x27c(0x08)
	struct FName TraversalCollisionProfileName; // 0x284(0x08)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct TArray<struct UAnimSequenceBase*> TraversalFlyRequesters; // 0x290(0x10)
	char pad_2A0[0x40]; // 0x2a0(0x40)

	void OnNotifyEndReceived(struct FName NotifyName, struct FBranchingPointNotifyPayload BranchingPointNotifyPayload); // Function Gobi.GameplayAction_PlayMontage.OnNotifyEndReceived // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction_AmbushHide
// Size: 0x310 (Inherited: 0x2e0)
struct UGameplayAction_AmbushHide : UGameplayAction_PlayMontage {
	struct FVector2D StayInCoverDuration; // 0x2e0(0x08)
	bool bRepositionOnHeroLOS; // 0x2e8(0x01)
	char pad_2E9[0x3]; // 0x2e9(0x03)
	float RepositionOnHeroDistanceMapDistance; // 0x2ec(0x04)
	struct FGameplayTag SneakAdvanceTag; // 0x2f0(0x08)
	struct FNavAgentSelector DistanceMapNavMesh; // 0x2f8(0x04)
	char pad_2FC[0x14]; // 0x2fc(0x14)
};

// Class Gobi.GameplayAction_AOEAttack
// Size: 0x218 (Inherited: 0x210)
struct UGameplayAction_AOEAttack : UGameplayAction {
	char pad_210[0x8]; // 0x210(0x08)

	void OnStopAttack(struct UAOEAttackComponent* AOEAttackComponent); // Function Gobi.GameplayAction_AOEAttack.OnStopAttack // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction_BotAttack
// Size: 0x258 (Inherited: 0x210)
struct UGameplayAction_BotAttack : UGameplayAction {
	struct UAnimContext_Actor* EnemyContext; // 0x210(0x08)
	struct UGameplayEvaluatorSet* FilterSet; // 0x218(0x08)
	char pad_220[0x38]; // 0x220(0x38)

	void OnSelectedItemChanged(struct AItem* OldItem, struct AItem* NewItem); // Function Gobi.GameplayAction_BotAttack.OnSelectedItemChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction_BotAttackMelee
// Size: 0x268 (Inherited: 0x258)
struct UGameplayAction_BotAttackMelee : UGameplayAction_BotAttack {
	char pad_258[0x10]; // 0x258(0x10)

	void OnMeleeStateChanged(enum class EHeroMeleeState NewMeleeState); // Function Gobi.GameplayAction_BotAttackMelee.OnMeleeStateChanged // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction_BotAttackRanged
// Size: 0x270 (Inherited: 0x258)
struct UGameplayAction_BotAttackRanged : UGameplayAction_BotAttack {
	float FullAutoTimeMult; // 0x258(0x04)
	char pad_25C[0x14]; // 0x25c(0x14)

	void OnShootEvent(); // Function Gobi.GameplayAction_BotAttackRanged.OnShootEvent // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction_BotFallTraversal
// Size: 0x220 (Inherited: 0x210)
struct UGameplayAction_BotFallTraversal : UGameplayAction {
	struct UGameplayEvaluatorSet* FilterSet; // 0x210(0x08)
	bool bDisabled; // 0x218(0x01)
	char pad_219[0x7]; // 0x219(0x07)
};

// Class Gobi.GameplayAction_BotIdle
// Size: 0x2a0 (Inherited: 0x210)
struct UGameplayAction_BotIdle : UGameplayAction {
	struct UGameplayEvaluatorSet* FilterSet; // 0x210(0x08)
	float MaxIdleTime; // 0x218(0x04)
	float MaxIdleTimeNoPlayers; // 0x21c(0x04)
	bool bFocusWatch; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	struct FFocusWatch FocusWatch; // 0x224(0x44)
	float TeammateObjectiveDistThreshold; // 0x268(0x04)
	float TeammateObjectiveUpdateFreq; // 0x26c(0x04)
	char pad_270[0x30]; // 0x270(0x30)

	void OnTetherRemoved(struct AActor* TetherActor); // Function Gobi.GameplayAction_BotIdle.OnTetherRemoved // (None) // @ game+0xfffffffec0000000
};

// Class Gobi.GameplayAction_BotInteractUse
