// WidgetBlueprintGeneratedClass GraphicsOptionsPanel_WBP.GraphicsOptionsPanel_WBP_C
// Size: 0x720 (Inherited: 0x608)
struct UGraphicsOptionsPanel_WBP_C : UGraphicsOptionsPanelUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x608(0x08)
	struct UOptionsTextSpinner_WBP_C* AASpinner; // 0x610(0x08)
	struct UOptionsTextSpinner_WBP_C* AdaptiveFXQualitySpinner; // 0x618(0x08)
	struct UOptionsAccordion_WBP_C* AdvancedAccordion; // 0x620(0x08)
	struct UOptionsTextSpinner_WBP_C* AntiAliasingQuality; // 0x628(0x08)
	struct UScrollBox* BindingsScrollBox; // 0x630(0x08)
	struct UBrightnessOptions_WBP_C* BrightnessOptions; // 0x638(0x08)
	struct UOptionsTextSpinner_WBP_C* ChromaticAberrationSpinner; // 0x640(0x08)
	struct UOptionsTextSpinner_WBP_C* DLSSSpinner; // 0x648(0x08)
	struct UOptionsTextSpinner_WBP_C* EffectsQuality; // 0x650(0x08)
	struct UOptionsTextSpinner_WBP_C* FoliageQuality; // 0x658(0x08)
	struct UOptionsSlider_WBP_C* FOVSlider; // 0x660(0x08)
	struct UOptionsTextSpinner_WBP_C* FramerateCapEnabledSpinner; // 0x668(0x08)
	struct UOptionsSlider_WBP_C* FramerateCapSlider; // 0x670(0x08)
	struct UOptionsTextSpinner_WBP_C* GraphicsAPISpinner; // 0x678(0x08)
	struct UOptionSectionHeader_WBP_C* GraphicsHeader; // 0x680(0x08)
	struct UOptionsTextSpinner_WBP_C* MotionBlurSpinner; // 0x688(0x08)
	struct UOptionsTextSpinner_WBP_C* PostProcessingQuality; // 0x690(0x08)
	struct UOptionsAccordion_WBP_C* QualityAccordion; // 0x698(0x08)
	struct UOptionsTextSpinner_WBP_C* QualitySpinner; // 0x6a0(0x08)
	struct UVerticalBox* ResolutionPanel; // 0x6a8(0x08)
	struct UOptionsTextSpinner_WBP_C* ResolutionScalingModeSpinner; // 0x6b0(0x08)
	struct UGenericComboBox_C* ResolutionsComboBox; // 0x6b8(0x08)
	struct UOptionsTextComboBox_WBP_C* ResolutionsOption; // 0x6c0(0x08)
	struct UTextButton_WBP_C* SafeZoneButton; // 0x6c8(0x08)
	struct UOptionsTextSpinner_WBP_C* ShadowQuality; // 0x6d0(0x08)
	struct UOptionsTextSpinner_WBP_C* SharpeningSpinner; // 0x6d8(0x08)
	struct UOptionsSlider_WBP_C* StaticResolutionScaleSlider; // 0x6e0(0x08)
	struct UOptionsTextComboBox_WBP_C* TargetDisplayOption; // 0x6e8(0x08)
	struct UOptionsSlider_WBP_C* TargetFramerateSlider; // 0x6f0(0x08)
	struct UOptionsTextComboBox_WBP_C* TargetGPUOption; // 0x6f8(0x08)
	struct UOptionsTextSpinner_WBP_C* TextureQuality; // 0x700(0x08)
	struct UOptionsTextSpinner_WBP_C* VSyncSpinner; // 0x708(0x08)
	struct UOptionsTextSpinner_WBP_C* WIndowModeSpinner; // 0x710(0x08)
	struct UPlatformCallouts_WBP_C* Callouts; // 0x718(0x08)

	void OnSettingsReloaded(); // Function GraphicsOptionsPanel_WBP.GraphicsOptionsPanel_WBP_C.OnSettingsReloaded // (None) // @ game+0xfffffffec0000000
};

