// AnimBlueprintGeneratedClass Hag_ABP.Hag_ABP_C
// Size: 0x1a5c (Inherited: 0x800)
struct UHag_ABP_C : UHagAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x800(0x08)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x808(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x8c8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x980(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x9a8(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xa60(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xb18(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xb40(0xb8)
	struct FAnimNode_FocusTrackingSlot AnimGraphNode_FocusTrackingSlot; // 0xbf8(0x108)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xd00(0x30)
	struct FAnimNode_SlopeWarping AnimGraphNode_SlopeWarping; // 0xd30(0x1a0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0xed0(0xf8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xfc8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xfe8(0x20)
	struct FAnimState3P __CustomProperty_AnimState3P_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x1008(0x08)
	float __CustomProperty_LocoSpeedsBlendTime_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x1010(0x04)
	struct FGobiAnimationState __CustomProperty_AnimationState_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x1014(0x58)
	struct FHagAnimState __CustomProperty_HagAnimState_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x106c(0x02)
	char pad_106E[0x2]; // 0x106e(0x02)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x1070(0x40)
	float __CustomProperty_LocoBlendTime_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x10b0(0x04)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x10b4(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x10d0(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x10ec(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x1108(0x1c)
	char pad_1124[0x4]; // 0x1124(0x04)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x1128(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_DFB27D384FA26AEDBDCC9E9321E3BF36; // 0x1190(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1240(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x12e8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1310(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1340(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x13f0(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x14a8(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x1568(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x15b0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1668(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1690(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1730(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x17e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1810(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1838(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1860(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1888(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x18b0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x18d8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x19a0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x19c8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1a10(0x48)
	float AdditiveBlendWeight; // 0x1a58(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Hag_ABP.Hag_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

