// AnimBlueprintGeneratedClass Hag_Loco_Base_ABP.Hag_Loco_Base_ABP_C
// Size: 0x5fe8 (Inherited: 0x2c0)
struct UHag_Loco_Base_ABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x370(0x28)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_3; // 0x398(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x460(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x548(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x630(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x718(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x800(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x8e8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x9d0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0xab8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0xba0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0xc88(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xd70(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xe58(0xe8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_19; // 0xf40(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_18; // 0x10d0(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_17; // 0x1260(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_16; // 0x13f0(0x190)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x1580(0xb0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_19; // 0x1630(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_18; // 0x16d0(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_17; // 0x1770(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_16; // 0x1810(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_15; // 0x18b0(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_14; // 0x1a40(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_13; // 0x1bd0(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_12; // 0x1d60(0x190)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x1ef0(0xb0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_15; // 0x1fa0(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_14; // 0x2040(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_13; // 0x20e0(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_12; // 0x2180(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_11; // 0x2220(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_10; // 0x23b0(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x2540(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x26d0(0x190)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x2860(0xb0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_11; // 0x2910(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_10; // 0x29b0(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_9; // 0x2a50(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_8; // 0x2af0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x2b90(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x2bc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x2be8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2c10(0x78)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x2c88(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_7; // 0x2e18(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x2eb8(0x30)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_2; // 0x2ee8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2fb0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x3028(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x30a0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x3118(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x3190(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x3208(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x3280(0x78)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x32f8(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0x3488(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x3528(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x3558(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x3608(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x3638(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x36e8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x3718(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x3740(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x3768(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x3790(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x37b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x37e0(0x28)
	struct FAnimNode_BlendListByGameplayTagQuery AnimGraphNode_BlendListByGameplayTagQuery_2; // 0x3808(0xc8)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_6; // 0x38d0(0x88)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_5; // 0x3958(0x88)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_4; // 0x39e0(0x88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x3a68(0x30)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_3; // 0x3a98(0x88)
	struct FAnimNode_BlendListByGameplayTagQuery AnimGraphNode_BlendListByGameplayTagQuery; // 0x3b20(0xc8)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_2; // 0x3be8(0x88)
	struct FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching; // 0x3c70(0x88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x3cf8(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3d28(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x3dd8(0xe8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x3ec0(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x4050(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x40f0(0xe8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x41d8(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x4368(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x4408(0xe8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x44f0(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x4680(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x4720(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x4750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x4778(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x47a0(0x78)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x4818(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x49a8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x4a48(0x30)
	struct FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag; // 0x4a78(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x4b40(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x4bb8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x4c30(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x4ca8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x4d20(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x4d98(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x4e10(0x78)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x4e88(0x190)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x5018(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x50b8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x50e8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x5198(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x51c8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x5278(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x52a8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5358(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x5410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x5438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x5460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x5488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x54b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x54d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x5500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x5528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x5550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x5578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x55a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x55c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x55f0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x5618(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x5690(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x56c0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x5738(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x5768(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x57e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x5810(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x5888(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x58b8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x58e0(0x78)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5958(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x5a20(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5a50(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x5a78(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x5af0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5b20(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x5b98(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x5bc8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x5c78(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5ca8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5cd0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5d00(0xb0)
	struct FLocoTurnInPlace TurnInPlaceState; // 0x5db0(0xb0)
	struct FLocomotionPrediction LocoPredict; // 0x5e60(0x68)
	struct FAnimDirectionRange ForwardDirection; // 0x5ec8(0x1c)
	struct FAnimDirectionRange RightDirection; // 0x5ee4(0x1c)
	struct FAnimDirectionRange LeftDirection; // 0x5f00(0x1c)
	struct FAnimDirectionRange BackwardDirection; // 0x5f1c(0x1c)
	float LocoBlendTime; // 0x5f38(0x04)
	char pad_5F3C[0x4]; // 0x5f3c(0x04)
	struct FAnimLocomotionData LocomotionData; // 0x5f40(0x40)
	struct FHagAnimState HagAnimState; // 0x5f80(0x02)
	char pad_5F82[0x2]; // 0x5f82(0x02)
	struct FGobiAnimationState AnimationState; // 0x5f84(0x58)
	float LocoSpeedsBlendTime; // 0x5fdc(0x04)
	struct FAnimState3P AnimState3P; // 0x5fe0(0x08)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Hag_Loco_Base_ABP.Hag_Loco_Base_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

