// BlueprintGeneratedClass Hag_AICharacterBP.Hag_AICharacterBP_C
// Size: 0x1050 (Inherited: 0xff8)
struct AHag_AICharacterBP_C : AZombieMelee_AICharacterBP_C {
	struct UArrowComponent* Debug Forward Arrow; // 0xff8(0x08)
	struct UHealthBarComponent* HealthBar; // 0x1000(0x08)
	struct UWeakSpotsComponent* WeakSpots; // 0x1008(0x08)
	struct UGameCoachLessonsComponent* GameCoachLessons; // 0x1010(0x08)
	struct UFleeComponent* Flee; // 0x1018(0x08)
	struct UStumbleDamageAccumulatorComponent* DamageAccumulator; // 0x1020(0x08)
	struct UHagComponent* Hag; // 0x1028(0x08)
	struct USphereComponent* LineOfSight; // 0x1030(0x08)
	struct UEnemyAudioComponent_BP_C* EnemyAudioComponent_BP; // 0x1038(0x08)
	struct UPingableComponent* Pingable; // 0x1040(0x08)
	struct UCapsuleComponent* Melee; // 0x1048(0x08)
};

