// UserDefinedStruct HG_Tuning_Struct.HG_Tuning_Struct
// Size: 0x2b8 (Inherited: 0x00)
struct FHG_Tuning_Struct {
	struct FFireModeBaseTuning FireModeBase_37_229A905E462D253EDF35E8A33D2167F3; // 0x00(0x34)
	char pad_34[0x4]; // 0x34(0x04)
	struct FFireModeSingleTraceTuning FireModeSingleTrace_31_A07A58F74806572C177B918212D6EF38; // 0x38(0x18)
	struct FSpreadTuning Spread_9_A10B47714F0C1FDBBA45D0A99B81AA19; // 0x50(0x60)
	struct FClipAmmoTuning ClipAmmo_28_013A08DE4619C88B3A73D486D4657A27; // 0xb0(0x04)
	struct FClipReloadTuning ClipReload_3_FD477EAF4A650B258356838D708AAE34; // 0xb4(0x0c)
	struct FRecoilTuning Recoil_12_A18A88534DE26D77FA6388A15DD59BCD; // 0xc0(0x140)
	struct FBulletPenetrationTuning BulletPenetration_25_8138B02C4259BC87BD1EDA8F00756FB7; // 0x200(0x04)
	struct FWeaponMoveSpeedTuning WeaponMoveSpeed_15_89A1EE1B4AD84CB38B06648DB292A25E; // 0x204(0x6c)
	struct FItemCycleTuning ItemCycle_20_1E1B5C1D4893AC229FEAB0BC9EF6621E; // 0x270(0x14)
	struct FADSTuning ADS_34_A01755BC4C71B67B74CD80BC0E5FF41E; // 0x284(0x08)
	struct FItemAnimationDataTuning ItemAnimationData_22_0A58A0174E2F06B0B275218B8470A058; // 0x28c(0x2c)
};

