// WidgetBlueprintGeneratedClass HUDEquipmentEntry_WBP.HUDEquipmentEntry_WBP_C
// Size: 0x5b6 (Inherited: 0x4b0)
struct UHUDEquipmentEntry_WBP_C : UHUDEquipmentEntryUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4b0(0x08)
	struct UWidgetAnimation* PickupPulseLoop; // 0x4b8(0x08)
	struct UWidgetAnimation* PickupPulseStart; // 0x4c0(0x08)
	struct UWidgetAnimation* Equip; // 0x4c8(0x08)
	struct UWidgetAnimation* LowAmmoStatic; // 0x4d0(0x08)
	struct UWidgetAnimation* LowAmmoLoop; // 0x4d8(0x08)
	struct UTextBlock* AmmoClipText; // 0x4e0(0x08)
	struct UHorizontalBox* AmmoHB; // 0x4e8(0x08)
	struct UCanvasPanel* AmmoReservePanel; // 0x4f0(0x08)
	struct UTextBlock* AmmoReserveText; // 0x4f8(0x08)
	struct UImage* AmmoType; // 0x500(0x08)
	struct UHorizontalBox* Attachments; // 0x508(0x08)
	struct UImage* BG_Gradient; // 0x510(0x08)
	struct UOverlay* BGContainer; // 0x518(0x08)
	struct UPlatformCalloutImage_WBP_C* Callout; // 0x520(0x08)
	struct UOverlay* Frame; // 0x528(0x08)
	struct UPlatformCalloutImage_WBP_C* GamepadCallout; // 0x530(0x08)
	struct UImage* InfinityIcon; // 0x538(0x08)
	struct UImage* InfinityIconMelee; // 0x540(0x08)
	struct UImage* ItemIcon; // 0x548(0x08)
	struct UTextBlock* ItemName; // 0x550(0x08)
	struct UScaleBox* ItemNameScaleBox; // 0x558(0x08)
	struct UHorizontalBox* MainContainer; // 0x560(0x08)
	struct UImage* QualityBar; // 0x568(0x08)
	struct UOverlay* QualityContainer; // 0x570(0x08)
	struct UImage* QualityTint; // 0x578(0x08)
	struct UScaleBox* ScaleboxItemIcon; // 0x580(0x08)
	struct UCanvasPanel* StarsPanel; // 0x588(0x08)
	struct UTierStars_WBP_C* TierStars; // 0x590(0x08)
	struct UOverlay* VendorBorder; // 0x598(0x08)
	struct FVector2D AttachmentSlotSize; // 0x5a0(0x08)
	enum class EEquipmentSlot WatchedSlot; // 0x5a8(0x01)
	char pad_5A9[0x3]; // 0x5a9(0x03)
	struct FName InputAction; // 0x5ac(0x08)
	bool bIsSelected; // 0x5b4(0x01)
	bool bIsVendor; // 0x5b5(0x01)

	void IsVendor(bool bIsVendor); // Function HUDEquipmentEntry_WBP.HUDEquipmentEntry_WBP_C.IsVendor // (None) // @ game+0xfffffffec0000000
};

