// WidgetBlueprintGeneratedClass ItemPickupToolTip_WBP.ItemPickupToolTip_WBP_C
// Size: 0x738 (Inherited: 0x5c0)
struct UItemPickupToolTip_WBP_C : UItemPickupToolTipUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5c0(0x08)
	struct UWidgetAnimation* TransferArrow; // 0x5c8(0x08)
	struct UImage* AffinityTint; // 0x5d0(0x08)
	struct UHorizontalBox* AttachmentContainer; // 0x5d8(0x08)
	struct URichTextBlock* AttachmentDesc; // 0x5e0(0x08)
	struct UImage* AttachmentHeaderBG; // 0x5e8(0x08)
	struct UImage* AttachmentHeaderBGFILL; // 0x5f0(0x08)
	struct UImage* AttachmentIcon; // 0x5f8(0x08)
	struct UTextBlock* AttachmentName; // 0x600(0x08)
	struct UOverlay* AttachmentPanel; // 0x608(0x08)
	struct UTextBlock* AttachmentQualityText; // 0x610(0x08)
	struct UHorizontalBox* AttachmentsHBox; // 0x618(0x08)
	struct UTierStars_WBP_C* AttachmentTierStars; // 0x620(0x08)
	struct UTextBlock* AttachmentType; // 0x628(0x08)
	struct UOverlay* BGPanel; // 0x630(0x08)
	struct UOverlay* CalloutOverlay; // 0x638(0x08)
	struct UAnotherGameplayCard_WBP_C* Card; // 0x640(0x08)
	struct UOverlay* Currency; // 0x648(0x08)
	struct UTextBlock* CurrencyCost; // 0x650(0x08)
	struct UImage* CurrencyIcon; // 0x658(0x08)
	struct UOverlay* DescCenterPanel; // 0x660(0x08)
	struct UImage* DescriptionBG; // 0x668(0x08)
	struct UOverlay* DetailsPanel; // 0x670(0x08)
	struct UTextBlock* ErrorText; // 0x678(0x08)
	struct UImage* HeaderBG; // 0x680(0x08)
	struct UImage* HeaderBGFILL; // 0x688(0x08)
	struct UImage* ItemAmmoType; // 0x690(0x08)
	struct UTextBlock* ItemCategory; // 0x698(0x08)
	struct URichTextBlock* ItemDescription; // 0x6a0(0x08)
	struct UImage* ItemIcon; // 0x6a8(0x08)
	struct UTextBlock* ItemNameText; // 0x6b0(0x08)
	struct UTextBlock* ItemSlotText; // 0x6b8(0x08)
	struct UVerticalBox* PerksPanel; // 0x6c0(0x08)
	struct URichTextBlock* PressCallout; // 0x6c8(0x08)
	struct UTextBlock* QualityText; // 0x6d0(0x08)
	struct UOverlay* RootPanel; // 0x6d8(0x08)
	struct UVerticalBox* StatsPanel; // 0x6e0(0x08)
	struct UTierStars_WBP_C* TierStars; // 0x6e8(0x08)
	struct UVerticalBox* WeaponPanel; // 0x6f0(0x08)
	struct FVector2D AttachmentSlotSize; // 0x6f8(0x08)
	float ADSOpacity; // 0x700(0x04)
	enum class ItemTooltipType TooltipType; // 0x704(0x01)
	bool bHideCurrency; // 0x705(0x01)
	char pad_706[0x2]; // 0x706(0x02)
	struct FText ItemName; // 0x708(0x18)
	struct UTweenContainer* TweenContainer; // 0x720(0x08)
	int32_t LayoutWidth; // 0x728(0x04)
	float FadeInDuration; // 0x72c(0x04)
	enum class ETweenEaseType FadeInEasing; // 0x730(0x01)
	char pad_731[0x3]; // 0x731(0x03)
	int32_t StatMinWidth; // 0x734(0x04)

	bool IsInventoryTooltip(); // Function ItemPickupToolTip_WBP.ItemPickupToolTip_WBP_C.IsInventoryTooltip // (None) // @ game+0xfffffffec0000000
};

