// BlueprintGeneratedClass JukeBox_SocialSpace_BP.JukeBox_SocialSpace_BP_C
// Size: 0x3c8 (Inherited: 0x2e0)
struct AJukeBox_SocialSpace_BP_C : AJukebox {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct URectLightComponent* RectLight; // 0x2e8(0x08)
	struct UItemAkBankComponent* ItemAkBank; // 0x2f0(0x08)
	struct FLinearColor Timeline_ColorPattern_RedTeal_F4A98A8748ED8A4196421497B04D777A; // 0x2f8(0x10)
	struct FLinearColor Timeline_ColorPattern_GreenPurple_F4A98A8748ED8A4196421497B04D777A; // 0x308(0x10)
	struct FLinearColor Timeline_ColorPattern_SpectrumSwitch_F4A98A8748ED8A4196421497B04D777A; // 0x318(0x10)
	struct FLinearColor Timeline_ColorPattern_90s_F4A98A8748ED8A4196421497B04D777A; // 0x328(0x10)
	struct FLinearColor Timeline_ColorPattern_PurplePink_F4A98A8748ED8A4196421497B04D777A; // 0x338(0x10)
	struct FLinearColor Timeline_ColorPattern_BlueGreen_F4A98A8748ED8A4196421497B04D777A; // 0x348(0x10)
	struct FLinearColor Timeline_ColorPattern_RedOrange_F4A98A8748ED8A4196421497B04D777A; // 0x358(0x10)
	enum class ETimelineDirection Timeline_ColorPattern__Direction_F4A98A8748ED8A4196421497B04D777A; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	struct UTimelineComponent* Timeline_ColorPattern; // 0x370(0x08)
	float Timeline_FlickerPattern_5_068B560045038C8B147470801A076EBB; // 0x378(0x04)
	float Timeline_FlickerPattern_4_068B560045038C8B147470801A076EBB; // 0x37c(0x04)
	float Timeline_FlickerPattern_3_068B560045038C8B147470801A076EBB; // 0x380(0x04)
	float Timeline_FlickerPattern_2_068B560045038C8B147470801A076EBB; // 0x384(0x04)
	float Timeline_FlickerPattern_1_068B560045038C8B147470801A076EBB; // 0x388(0x04)
	float Timeline_FlickerPattern_0_068B560045038C8B147470801A076EBB; // 0x38c(0x04)
	enum class ETimelineDirection Timeline_FlickerPattern__Direction_068B560045038C8B147470801A076EBB; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)
	struct UTimelineComponent* Timeline_FlickerPattern; // 0x398(0x08)
	float Timeline_FlickerOn_NewTrack_0_F64562784A342D83AAA33BB57EFECD4B; // 0x3a0(0x04)
	enum class ETimelineDirection Timeline_FlickerOn__Direction_F64562784A342D83AAA33BB57EFECD4B; // 0x3a4(0x01)
	char pad_3A5[0x3]; // 0x3a5(0x03)
	struct UTimelineComponent* Timeline_FlickerOn; // 0x3a8(0x08)
	float Timeline_DestroyedFlickerOff_NewTrack_0_B7D385DE4ED55BF85560D7803B87F970; // 0x3b0(0x04)
	enum class ETimelineDirection Timeline_DestroyedFlickerOff__Direction_B7D385DE4ED55BF85560D7803B87F970; // 0x3b4(0x01)
	char pad_3B5[0x3]; // 0x3b5(0x03)
	struct UTimelineComponent* Timeline_DestroyedFlickerOff; // 0x3b8(0x08)
	int32_t CurrentColorPattern; // 0x3c0(0x04)
	int32_t CurrentFlickerPattern; // 0x3c4(0x04)

	void RandomizeLightsAndRate(); // Function JukeBox_SocialSpace_BP.JukeBox_SocialSpace_BP_C.RandomizeLightsAndRate // (None) // @ game+0xfffffffec0000000
};

