// UserDefinedStruct LMG_Tuning_Struct.LMG_Tuning_Struct
// Size: 0x2b8 (Inherited: 0x00)
struct FLMG_Tuning_Struct {
	struct FFireModeBaseTuning FireModeBase_43_B53CDCEB42184F6257DCCB90CDCADFC7; // 0x00(0x34)
	char pad_34[0x4]; // 0x34(0x04)
	struct FFireModeSingleTraceTuning FireModeSingleTrace_37_48F8AE844F7C10C1FED933B0CE2676AA; // 0x38(0x18)
	struct FSpreadTuning Spread_15_F415F8754C89D8B245443DA492E3C17B; // 0x50(0x60)
	struct FClipAmmoTuning ClipAmmo_34_5258577E4F9D41602545A08A4B3CC310; // 0xb0(0x04)
	struct FClipReloadTuning ClipReload_3_FD477EAF4A650B258356838D708AAE34; // 0xb4(0x0c)
	struct FRecoilTuning Recoil_18_F63F76DB4FC351155AE3518FB90CB2FC; // 0xc0(0x140)
	struct FBulletPenetrationTuning BulletPenetration_31_756CDE1E4D7FA8A988DDF880060E88F7; // 0x200(0x04)
	struct FWeaponMoveSpeedTuning WeaponMoveSpeed_21_F0EB09994D8B23750C4C1AB5BE200924; // 0x204(0x6c)
	struct FItemCycleTuning ItemCycle_27_684E54A44B90AC64A4BC12B09CCC7ABF; // 0x270(0x14)
	struct FADSTuning ADS_40_63BDAFAA42CAF1639C3169A4B10D6548; // 0x284(0x08)
	struct FItemAnimationDataTuning ItemAnimationData_28_60E71D774E2D69E3ABF4D3A65CC146CE; // 0x28c(0x2c)
};

