// WidgetBlueprintGeneratedClass MatchmakingScreen_WBP.MatchmakingScreen_WBP_C
// Size: 0x818 (Inherited: 0x6d8)
struct UMatchmakingScreen_WBP_C : UMatchmakingScreen {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6d8(0x08)
	struct UTextButton_WBP_C* CancelButton; // 0x6e0(0x08)
	struct UPlatformCalloutImage_WBP_C* CancelCallout; // 0x6e8(0x08)
	struct UPlatformCallouts_WBP_C* ContentCallouts; // 0x6f0(0x08)
	struct UOverlay* ContentOverlay; // 0x6f8(0x08)
	struct UWidgetSwitcher* ContentSwitcher; // 0x700(0x08)
	struct UTutorialPip_WBP_C* ContinueRunTutorialPip; // 0x708(0x08)
	struct UTutorialTip_WBP_C* ContinueRunTutorialTip; // 0x710(0x08)
	struct UCrossPlayState_WBP_C* CrossPlayState; // 0x718(0x08)
	struct UVerticalBox* DebugMatchmakingInfo; // 0x720(0x08)
	struct UImage* DevBG; // 0x728(0x08)
	struct UMatchmakingDevOptions_WBP_C* DevOptions; // 0x730(0x08)
	struct UOverlay* DevOptionsPanel; // 0x738(0x08)
	struct UImage* Footer_Underline; // 0x740(0x08)
	struct UFooter_WBP_C* Footer_WBP; // 0x748(0x08)
	struct UImage* MapImage; // 0x750(0x08)
	struct UMatchmakingPlayerList_WBP_C* MatchmakingPlayerList; // 0x758(0x08)
	struct UMatchmakingState_WBP_C* MatchmakingState; // 0x760(0x08)
	struct UMatchmakingBasicButton_WBP_C* ModeCampaignButton; // 0x768(0x08)
	struct UMatchmakingChallengesButton_WBP_C* ModeChallengeButton; // 0x770(0x08)
	struct UVerticalBox* ModeContainer; // 0x778(0x08)
	struct UMatchmakingBasicButton_WBP_C* ModeCustomButton; // 0x780(0x08)
	struct UVerticalBox* ModePicker; // 0x788(0x08)
	struct UMatchmakingBasicButton_WBP_C* ModePvPButton; // 0x790(0x08)
	struct UMatchmakingBasicButton_WBP_C* ModeQuickplayButton; // 0x798(0x08)
	struct UMatchmakingBasicButton_WBP_C* ModeSinglePlayerButton; // 0x7a0(0x08)
	struct UMatchmakingMOTD_WBP_C* MOTDTabs; // 0x7a8(0x08)
	struct UTutorialPip_WBP_C* NewRunTutorialPip; // 0x7b0(0x08)
	struct UTutorialTip_WBP_C* NewRunTutorialTip; // 0x7b8(0x08)
	struct UPartyGroupsTab_WBP_C* PartyGroupsTab; // 0x7c0(0x08)
	struct UTextButton_WBP_C* PrefsButton; // 0x7c8(0x08)
	struct UMatchmakingSettingsPanel_WBP_C* SettingsPanel; // 0x7d0(0x08)
	struct UCanvasPanel* StartPanel; // 0x7d8(0x08)
	struct UWidgetSwitcher* StartPanelSwitcher; // 0x7e0(0x08)
	struct UPlatformCallouts_WBP_C* Callouts; // 0x7e8(0x08)
	bool bJoinInProgress; // 0x7f0(0x01)
	char pad_7F1[0x7]; // 0x7f1(0x07)
	struct UMaterialInstanceDynamic* MapGradientMaterial; // 0x7f8(0x08)
	struct UTweenContainer* MapFadeTweenContainer; // 0x800(0x08)
	struct UTweenContainer* TweenOpenPlayContainer; // 0x808(0x08)
	struct UTweenContainer* TweenOpenMatchamkingContainer; // 0x810(0x08)

	void HandleTutorialCompleted(); // Function MatchmakingScreen_WBP.MatchmakingScreen_WBP_C.HandleTutorialCompleted // (None) // @ game+0xfffffffec0000000
};

