// BlueprintGeneratedClass MiniNest_Screamer_BP.MiniNest_Screamer_BP_C
// Size: 0x660 (Inherited: 0x250)
struct AMiniNest_Screamer_BP_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct UItemAkBankComponent* ItemAkBank; // 0x258(0x08)
	struct FNone* ProceduralSpline_Component7; // 0x260(0x08)
	struct FNone* ProceduralSpline_Component6; // 0x268(0x08)
	struct FNone* ProceduralSpline_Component5; // 0x270(0x08)
	struct FNone* ProceduralSpline_Component4; // 0x278(0x08)
	struct FNone* ProceduralSpline_Component3; // 0x280(0x08)
	struct FNone* ProceduralSpline_Component; // 0x288(0x08)
	struct UNestScenarioGameCoachLessons_BP_C* NestScenarioGameCoachLessons_BP; // 0x290(0x08)
	struct UParticleSystemComponent* ScreamVFX6; // 0x298(0x08)
	struct UParticleSystemComponent* ScreamVFX7; // 0x2a0(0x08)
	struct UParticleSystemComponent* ScreamVFX5; // 0x2a8(0x08)
	struct UParticleSystemComponent* ScreamVFX3; // 0x2b0(0x08)
	struct UParticleSystemComponent* ScreamVFX2; // 0x2b8(0x08)
	struct UParticleSystemComponent* ScreamVFX1; // 0x2c0(0x08)
	struct UParticleSystemComponent* ScreamVFX4; // 0x2c8(0x08)
	struct USkeletalMeshComponent* Snitcher7SKM; // 0x2d0(0x08)
	struct USkeletalMeshComponent* Snitcher6SKM; // 0x2d8(0x08)
	struct USkeletalMeshComponent* Snitcher5SKM; // 0x2e0(0x08)
	struct USkeletalMeshComponent* Snitcher4SKM; // 0x2e8(0x08)
	struct USkeletalMeshComponent* Snitcher3SKM; // 0x2f0(0x08)
	struct USkeletalMeshComponent* Snitcher2SKM; // 0x2f8(0x08)
	struct USkeletalMeshComponent* Snitcher1SKM; // 0x300(0x08)
	struct UParticleSystemComponent* ScreamVFX; // 0x308(0x08)
	struct UHighlightComponent* Highlight; // 0x310(0x08)
	struct UGameplayTagsComponent* GameplayTags; // 0x318(0x08)
	struct UStaticMeshComponent* BasePodBoil; // 0x320(0x08)
	struct UStaticMeshComponent* Boil7_2; // 0x328(0x08)
	struct UStaticMeshComponent* Boil7_4; // 0x330(0x08)
	struct UStaticMeshComponent* Boil7_3; // 0x338(0x08)
	struct USceneComponent* BoilLocation7; // 0x340(0x08)
	struct USplineComponent* ArmConnector7; // 0x348(0x08)
	struct UStaticMeshComponent* NerveCluster_7_mesh; // 0x350(0x08)
	struct UStaticMeshComponent* Boil6_2; // 0x358(0x08)
	struct UStaticMeshComponent* Boil6_4; // 0x360(0x08)
	struct UStaticMeshComponent* Boil6_3; // 0x368(0x08)
	struct USceneComponent* BoilLocation6; // 0x370(0x08)
	struct USplineComponent* ArmConnector6; // 0x378(0x08)
	struct UStaticMeshComponent* NerveCluster_6_mesh; // 0x380(0x08)
	struct USceneComponent* BoilLocation5; // 0x388(0x08)
	struct USceneComponent* BoilLocation4; // 0x390(0x08)
	struct USceneComponent* BoilLocation3; // 0x398(0x08)
	struct USceneComponent* BoilLocation2; // 0x3a0(0x08)
	struct USceneComponent* BoilLocation1; // 0x3a8(0x08)
	struct USplineComponent* ArmConnector5; // 0x3b0(0x08)
	struct USplineComponent* ArmConnector4; // 0x3b8(0x08)
	struct USplineComponent* ArmConnector3; // 0x3c0(0x08)
	struct USplineComponent* ArmConnector2; // 0x3c8(0x08)
	struct USplineComponent* ArmConnector1; // 0x3d0(0x08)
	struct UStaticMeshComponent* NerveCluster_5_mesh; // 0x3d8(0x08)
	struct UStaticMeshComponent* NerveCluster_4_mesh; // 0x3e0(0x08)
	struct UStaticMeshComponent* NerveCluster_3_mesh; // 0x3e8(0x08)
	struct UStaticMeshComponent* NerveCluster_2_mesh; // 0x3f0(0x08)
	struct UStaticMeshComponent* NerveCluster_1_mesh; // 0x3f8(0x08)
	struct USceneComponent* Loot spawn location; // 0x400(0x08)
	struct UStaticMeshComponent* BasePod; // 0x408(0x08)
	struct USceneComponent* TopScene; // 0x410(0x08)
	struct UStaticMeshComponent* Boil5_4; // 0x418(0x08)
	struct UStaticMeshComponent* Boil5_3; // 0x420(0x08)
	struct UStaticMeshComponent* Boil5_2; // 0x428(0x08)
	struct UStaticMeshComponent* Boil4_4; // 0x430(0x08)
	struct UStaticMeshComponent* Boil4_3; // 0x438(0x08)
	struct UStaticMeshComponent* Boil4_2; // 0x440(0x08)
	struct UStaticMeshComponent* Boil3_3; // 0x448(0x08)
	struct UStaticMeshComponent* Boil3_2; // 0x450(0x08)
	struct UStaticMeshComponent* Boil3_4; // 0x458(0x08)
	struct UStaticMeshComponent* Boil2_4; // 0x460(0x08)
	struct UStaticMeshComponent* Boil2_3; // 0x468(0x08)
	struct UStaticMeshComponent* Boil2_2; // 0x470(0x08)
	struct UStaticMeshComponent* Boil1_4; // 0x478(0x08)
	struct UStaticMeshComponent* Boil1_3; // 0x480(0x08)
	struct UStaticMeshComponent* Boil1_2; // 0x488(0x08)
	struct UStaticMeshComponent* MassWeapons; // 0x490(0x08)
	struct UAlertComponent* Alert; // 0x498(0x08)
	struct UGameplayEffectsComponent* GameplayEffects; // 0x4a0(0x08)
	struct UParticleSystemComponent* VFX_Flame_Pipes_01_P; // 0x4a8(0x08)
	float LerpBubbling_Vert_Offset_Distance_9D51E50F4967F423454B5786DF0016CB; // 0x4b0(0x04)
	float LerpBubbling_Time_Scale_9D51E50F4967F423454B5786DF0016CB; // 0x4b4(0x04)
	enum class ETimelineDirection LerpBubbling__Direction_9D51E50F4967F423454B5786DF0016CB; // 0x4b8(0x01)
	char pad_4B9[0x7]; // 0x4b9(0x07)
	struct UTimelineComponent* LerpBubbling; // 0x4c0(0x08)
	struct FMulticastInlineDelegate OnDeathOfScreamerPod; // 0x4c8(0x10)
	bool bIsBurning; // 0x4d8(0x01)
	bool bIsPulsing; // 0x4d9(0x01)
	char pad_4DA[0x6]; // 0x4da(0x06)
	struct FMulticastInlineDelegate ScreamerNerveClusterDestroyed; // 0x4e0(0x10)
	bool bIsSoloPlacedPod; // 0x4f0(0x01)
	char pad_4F1[0x7]; // 0x4f1(0x07)
	struct TArray<struct AItemPickupBase_BP_C*> MeatballLootArray; // 0x4f8(0x10)
	int32_t RandomIndexReturn; // 0x508(0x04)
	int32_t NumNerveClustersKilled; // 0x50c(0x04)
	struct TArray<struct ANest_NerveCluster_Boil_BP_C*> AllNerveBoilsArray; // 0x510(0x10)
	int32_t NumArms; // 0x520(0x04)
	int32_t TotalSpawnedNerveClusters; // 0x524(0x04)
	struct TArray<int32_t> NumBoilsDead; // 0x528(0x10)
	struct TArray<struct UStaticMeshComponent*> NerveClusterArray; // 0x538(0x10)
	bool bIsPoliceStationNest; // 0x548(0x01)
	bool bIsTorsoHolder; // 0x549(0x01)
	char pad_54A[0x6]; // 0x54a(0x06)
	struct TArray<struct UStaticMeshComponent*> EditorNerveArray; // 0x550(0x10)
	bool bShouldPlayIdleSound; // 0x560(0x01)
	bool bHazardCardPlayed; // 0x561(0x01)
	char pad_562[0x6]; // 0x562(0x06)
	struct ANest_PodBoil_BP_C* PodBoil; // 0x568(0x08)
	struct FTransform ExposedBoilTransform; // 0x570(0x30)
	struct TArray<struct UStaticMeshComponent*> DestroyedClusters; // 0x5a0(0x10)
	float LowerPodBoil; // 0x5b0(0x04)
	bool InjuredStateActive; // 0x5b4(0x01)
	char pad_5B5[0x3]; // 0x5b5(0x03)
	struct TArray<struct USkeletalMeshComponent*> SnitcherSKMs; // 0x5b8(0x10)
	struct TArray<struct USkeletalMeshComponent*> WorkingSnitcherSKMs; // 0x5c8(0x10)
	struct AScenarioActor* OwningScenarioActor; // 0x5d8(0x08)
	struct TArray<struct AItemPickupBase_BP_C*> NerveClusterLootArray; // 0x5e0(0x10)
	struct FMulticastInlineDelegate ScreamerNestIsActive; // 0x5f0(0x10)
	bool IsActive; // 0x600(0x01)
	char pad_601[0x7]; // 0x601(0x07)
	struct TMap<struct UStaticMeshComponent*, struct UAkComponent*> NerveClusterAkComps; // 0x608(0x50)
	struct UAkComponent* SpawnedAkMainPod; // 0x658(0x08)

	void StopScreamerAnimation(struct USceneComponent* SceneComponent); // Function MiniNest_Screamer_BP.MiniNest_Screamer_BP_C.StopScreamerAnimation // (None) // @ game+0xfffffffec0000000
};

