// BlueprintGeneratedClass Nest_PodBoil_BP.Nest_PodBoil_BP_C
// Size: 0x298 (Inherited: 0x250)
struct ANest_PodBoil_BP_C : AActor {
	struct UThreatComponent* Threat; // 0x250(0x08)
	struct UPingableComponent* Pingable; // 0x258(0x08)
	struct UNestBoilComponent* NestBoil; // 0x260(0x08)
	struct UHighlightComponent* Highlight; // 0x268(0x08)
	struct UGameplayTagsComponent* GameplayTags; // 0x270(0x08)
	struct UGameplayEffectsComponent* GameplayEffects; // 0x278(0x08)
	struct UHealthComponent* Health; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x288(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x290(0x08)
};

