// BlueprintGeneratedClass Nest_NerveCluster_Boil_BP.Nest_NerveCluster_Boil_BP_C
// Size: 0x2a8 (Inherited: 0x250)
struct ANest_NerveCluster_Boil_BP_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct UPingableComponent* Pingable; // 0x258(0x08)
	struct UClusterBoilComponent* ClusterBoil; // 0x260(0x08)
	struct UAimAssistTargetComponent* AimAssistTarget; // 0x268(0x08)
	struct UGameplayTagsComponent* GameplayTags; // 0x270(0x08)
	struct UGameplayEffectsComponent* GameplayEffects; // 0x278(0x08)
	struct UHealthComponent* Health; // 0x280(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x288(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x290(0x08)
	struct FMulticastInlineDelegate OnBoilDeath; // 0x298(0x10)

	void K2_OnReset(); // Function Nest_NerveCluster_Boil_BP.Nest_NerveCluster_Boil_BP_C.K2_OnReset // (None) // @ game+0xfffffffec0000000
};

