// BlueprintGeneratedClass Nest_Base_BP.Nest_Base_BP_C
// Size: 0x598 (Inherited: 0x250)
struct ANest_Base_BP_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct UNestsComponent* Nests; // 0x258(0x08)
	struct UBoxComponent* NearBasePodBox; // 0x260(0x08)
	struct UStaticMeshComponent* SplineMergeTarget; // 0x268(0x08)
	struct USplineMeshMergeComponent* SplineMeshMerge; // 0x270(0x08)
	struct UStaticMeshComponent* BaseBoilCap; // 0x278(0x08)
	struct UStaticMeshComponent* BoilCap7_2; // 0x280(0x08)
	struct UStaticMeshComponent* BoilCap7_4; // 0x288(0x08)
	struct UStaticMeshComponent* BoilCap7_3; // 0x290(0x08)
	struct UStaticMeshComponent* BoilCap6_2; // 0x298(0x08)
	struct UStaticMeshComponent* BoilCap6_4; // 0x2a0(0x08)
	struct UStaticMeshComponent* BoilCap6_3; // 0x2a8(0x08)
	struct UStaticMeshComponent* BoilCap5_4; // 0x2b0(0x08)
	struct UStaticMeshComponent* BoilCap5_3; // 0x2b8(0x08)
	struct UStaticMeshComponent* BoilCap5_2; // 0x2c0(0x08)
	struct UStaticMeshComponent* BoilCap4_4; // 0x2c8(0x08)
	struct UStaticMeshComponent* BoilCap4_3; // 0x2d0(0x08)
	struct UStaticMeshComponent* BoilCap4_2; // 0x2d8(0x08)
	struct UStaticMeshComponent* BoilCap3_3; // 0x2e0(0x08)
	struct UStaticMeshComponent* BoilCap3_2; // 0x2e8(0x08)
	struct UStaticMeshComponent* BoilCap3_4; // 0x2f0(0x08)
	struct UStaticMeshComponent* BoilCap2_4; // 0x2f8(0x08)
	struct UStaticMeshComponent* BoilCap2_3; // 0x300(0x08)
	struct UStaticMeshComponent* BoilCap2_2; // 0x308(0x08)
	struct UStaticMeshComponent* BoilCap1_4; // 0x310(0x08)
	struct UStaticMeshComponent* BoilCap1_3; // 0x318(0x08)
	struct UStaticMeshComponent* BoilCap1_2; // 0x320(0x08)
	struct UStaticMeshComponent* BasePodBoil; // 0x328(0x08)
	struct UParticleSystemComponent* VFX_BasePodExplosion; // 0x330(0x08)
	struct USceneComponent* BoilLocation1; // 0x338(0x08)
	struct UAkComponent* TentacleAK; // 0x340(0x08)
	struct UAkComponent* NerveCluster2AK; // 0x348(0x08)
	struct UAkComponent* NerveCluster7AK; // 0x350(0x08)
	struct UAkComponent* NerveCluster6AK; // 0x358(0x08)
	struct UAkComponent* NerveCluster5AK; // 0x360(0x08)
	struct UAkComponent* NerveCluster4AK; // 0x368(0x08)
	struct UAkComponent* NerveCluster3AK; // 0x370(0x08)
	struct UAkComponent* NerveCluster1AK; // 0x378(0x08)
	struct USceneComponent* BoilLocation7; // 0x380(0x08)
	struct USceneComponent* BoilLocation6; // 0x388(0x08)
	struct USceneComponent* BoilLocation5; // 0x390(0x08)
	struct USceneComponent* BoilLocation4; // 0x398(0x08)
	struct USceneComponent* BoilLocation3; // 0x3a0(0x08)
	struct USceneComponent* BoilLocation2; // 0x3a8(0x08)
	struct UStaticMeshComponent* NerveCluster_7_mesh (SCALE THIS ONE); // 0x3b0(0x08)
	struct UStaticMeshComponent* NerveCluster_6_mesh (SCALE THIS ONE); // 0x3b8(0x08)
	struct UStaticMeshComponent* NerveCluster_5_mesh (SCALE THIS ONE); // 0x3c0(0x08)
	struct UStaticMeshComponent* NerveCluster_4_mesh (SCALE THIS ONE); // 0x3c8(0x08)
	struct UStaticMeshComponent* NerveCluster_3_mesh (SCALE THIS ONE); // 0x3d0(0x08)
	struct UStaticMeshComponent* NerveCluster_2_mesh (SCALE THIS ONE); // 0x3d8(0x08)
	struct UStaticMeshComponent* NerveCluster_1_mesh (SCALE THIS ONE); // 0x3e0(0x08)
	struct UItemAkBankComponent* ItemAkBank; // 0x3e8(0x08)
	struct UAkComponent* AKBasePod; // 0x3f0(0x08)
	struct UBillboardComponent* HordeRoarLocation; // 0x3f8(0x08)
	struct FNone* ProceduralSpline_Component7; // 0x400(0x08)
	struct FNone* ProceduralSpline_Component6; // 0x408(0x08)
	struct FNone* ProceduralSpline_Component5; // 0x410(0x08)
	struct FNone* ProceduralSpline_Component4; // 0x418(0x08)
	struct FNone* ProceduralSpline_Component3; // 0x420(0x08)
	struct FNone* ProceduralSpline_Component2; // 0x428(0x08)
	struct FNone* ProceduralSpline_Component; // 0x430(0x08)
	struct UNestScenarioGameCoachLessons_BP_C* NestScenarioGameCoachLessons_BP; // 0x438(0x08)
	struct UHighlightComponent* Highlight; // 0x440(0x08)
	struct UGameplayTagsComponent* GameplayTags; // 0x448(0x08)
	struct UStaticMeshComponent* Boil7_2; // 0x450(0x08)
	struct UStaticMeshComponent* Boil7_4; // 0x458(0x08)
	struct UStaticMeshComponent* Boil7_3; // 0x460(0x08)
	struct USplineComponent* ArmConnector7; // 0x468(0x08)
	struct UStaticMeshComponent* NerveCluster_7_mesh; // 0x470(0x08)
	struct UStaticMeshComponent* Boil6_2; // 0x478(0x08)
	struct UStaticMeshComponent* Boil6_4; // 0x480(0x08)
	struct UStaticMeshComponent* Boil6_3; // 0x488(0x08)
	struct USplineComponent* ArmConnector6; // 0x490(0x08)
	struct UStaticMeshComponent* NerveCluster_6_mesh; // 0x498(0x08)
	struct USplineComponent* ArmConnector5; // 0x4a0(0x08)
	struct USplineComponent* ArmConnector4; // 0x4a8(0x08)
	struct USplineComponent* ArmConnector3; // 0x4b0(0x08)
	struct USplineComponent* ArmConnector2; // 0x4b8(0x08)
	struct USplineComponent* ArmConnector1; // 0x4c0(0x08)
	struct UStaticMeshComponent* NerveCluster_5_mesh; // 0x4c8(0x08)
	struct UStaticMeshComponent* NerveCluster_4_mesh; // 0x4d0(0x08)
	struct UStaticMeshComponent* NerveCluster_3_mesh; // 0x4d8(0x08)
	struct UStaticMeshComponent* NerveCluster_2_mesh; // 0x4e0(0x08)
	struct UStaticMeshComponent* NerveCluster_1_mesh; // 0x4e8(0x08)
	struct USceneComponent* Loot spawn location; // 0x4f0(0x08)
	struct UStaticMeshComponent* BasePod; // 0x4f8(0x08)
	struct USceneComponent* TopScene; // 0x500(0x08)
	struct UStaticMeshComponent* Boil5_4; // 0x508(0x08)
	struct UStaticMeshComponent* Boil5_3; // 0x510(0x08)
	struct UStaticMeshComponent* Boil5_2; // 0x518(0x08)
	struct UStaticMeshComponent* Boil4_4; // 0x520(0x08)
	struct UStaticMeshComponent* Boil4_3; // 0x528(0x08)
	struct UStaticMeshComponent* Boil4_2; // 0x530(0x08)
	struct UStaticMeshComponent* Boil3_3; // 0x538(0x08)
	struct UStaticMeshComponent* Boil3_2; // 0x540(0x08)
	struct UStaticMeshComponent* Boil3_4; // 0x548(0x08)
	struct UStaticMeshComponent* Boil2_4; // 0x550(0x08)
	struct UStaticMeshComponent* Boil2_3; // 0x558(0x08)
	struct UStaticMeshComponent* Boil2_2; // 0x560(0x08)
	struct UStaticMeshComponent* Boil1_4; // 0x568(0x08)
	struct UStaticMeshComponent* Boil1_3; // 0x570(0x08)
	struct UStaticMeshComponent* Boil1_2; // 0x578(0x08)
	struct UStaticMeshComponent* MassWeapons; // 0x580(0x08)
	struct UAlertComponent* Alert; // 0x588(0x08)
	struct UGameplayEffectsComponent* GameplayEffects; // 0x590(0x08)

	void UserConstructionScript(); // Function Nest_Base_BP.Nest_Base_BP_C.UserConstructionScript // (None) // @ game+0xfffffffec0000000
};

