// WidgetBlueprintGeneratedClass NotificationShelfEntry_WBP.NotificationShelfEntry_WBP_C
// Size: 0x688 (Inherited: 0x5b0)
struct UNotificationShelfEntry_WBP_C : UHUDNotificationShelfEntryUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5b0(0x08)
	struct UPlatformCalloutImage_WBP_C* AcceptCalloutImage; // 0x5b8(0x08)
	struct UBackgroundBlur_WBP_C* BackgroundBlur_WBP; // 0x5c0(0x08)
	struct UImage* BodyBG; // 0x5c8(0x08)
	struct UOverlay* BodyContainer; // 0x5d0(0x08)
	struct UImage* CalloutBG; // 0x5d8(0x08)
	struct USizeBox* CardContainer; // 0x5e0(0x08)
	struct URichTextBlock* DescriptionText; // 0x5e8(0x08)
	struct UProgressBar* ExpiryProgressBar; // 0x5f0(0x08)
	struct UOverlay* FooterContainer; // 0x5f8(0x08)
	struct UPlatformCalloutButton_WBP_C* FriendRequestAcceptCallout; // 0x600(0x08)
	struct UPlatformCalloutButton_WBP_C* FriendRequestBlockCallout; // 0x608(0x08)
	struct UHorizontalBox* FriendRequestCalloutHBox; // 0x610(0x08)
	struct UPlatformCalloutButton_WBP_C* FriendRequestDeclineCallout; // 0x618(0x08)
	struct UImage* HeaderBG; // 0x620(0x08)
	struct USizeBox* IconContainer; // 0x628(0x08)
	struct UImage* IconImage; // 0x630(0x08)
	struct UPlatformCalloutImage_WBP_C* IgnoreCalloutImage; // 0x638(0x08)
	struct UImage* Image_75; // 0x640(0x08)
	struct UHorizontalBox* InviteCalloutHBox; // 0x648(0x08)
	struct UMiniCard_WBP_C* MiniCard; // 0x650(0x08)
	struct UHorizontalBox* PlatformCalloutHBox; // 0x658(0x08)
	struct UPlatformCalloutImage_WBP_C* PlatformCalloutImage; // 0x660(0x08)
	struct UVerticalBox* PlatformCalloutVBox; // 0x668(0x08)
	struct UOverlay* RootContainer; // 0x670(0x08)
	struct UBaseTextBlock_C* TitleText; // 0x678(0x08)
	struct UTweenContainer* TweenContainer; // 0x680(0x08)

	void InitParams(); // Function NotificationShelfEntry_WBP.NotificationShelfEntry_WBP_C.InitParams // (None) // @ game+0xfffffffec0000000
};

