// BlueprintGeneratedClass Objective_Base_Mod.Objective_Base_Mod_C
// Size: 0x331 (Inherited: 0x88)
struct UObjective_Base_Mod_C : UGameplayMod {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x88(0x08)
	int32_t ReqAlivePlayers; // 0x90(0x04)
	int32_t MaxIncapsAllowed; // 0x94(0x04)
	enum class ObjectiveRewardType SelectedRewardType; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct FDataTableRowHandle RewardCardRowHandle; // 0xa0(0x20)
	int32_t CurrencyRewardValue; // 0xc0(0x04)
	bool GiveCardToEachPlayer; // 0xc4(0x01)
	char pad_C5[0x3]; // 0xc5(0x03)
	struct FString AdjustCurrencyCause; // 0xc8(0x10)
	int32_t NumBonusDraws; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct TMap<enum class ObjectiveRewardType, float> RewardWeights; // 0xe0(0x50)
	int32_t KillCount; // 0x130(0x04)
	int32_t ReqKillCount; // 0x134(0x04)
	struct FGameplayTagQuery KillTargetQuery; // 0x138(0x48)
	struct FGameplayTagQuery RequiredItemTagQuery; // 0x180(0x48)
	bool bEnableTimed; // 0x1c8(0x01)
	char pad_1C9[0x7]; // 0x1c9(0x07)
	struct TArray<struct FTimeDifficultyTuning> TimeByDifficultyForThreat; // 0x1d0(0x10)
	struct FDataTableRowHandle ObjectiveTimerStartHandle; // 0x1e0(0x20)
	struct FDataTableRowHandle ObjectiveTimerActiveHandle; // 0x200(0x20)
	float TimeLimit; // 0x220(0x04)
	char pad_224[0x4]; // 0x224(0x04)
	struct FTimerHandle TimedRunTimerHandle; // 0x228(0x08)
	struct FTimerHandle ObjectiveTimerBuildHandle; // 0x230(0x08)
	bool TimerExpired; // 0x238(0x01)
	char pad_239[0x7]; // 0x239(0x07)
	struct FDataTableRowHandle MissionHandle; // 0x240(0x20)
	int32_t CurrentIncapCount; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct FDataTableRowHandle ItemFindObjectiveHandle; // 0x268(0x20)
	struct FDataTableRowHandle NoIncapsObjectiveHandle; // 0x288(0x20)
	int32_t MaxHordeTriggersAllowed; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct TArray<enum class EPlayerHordeTriggerTypes> EValidHordeTriggerTypes; // 0x2b0(0x10)
	int32_t NumHordesTriggered; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct FDataTableRowHandle KillObjectiveHandle; // 0x2c8(0x20)
	struct FDataTableRowHandle HordeTriggersObjectiveHandle; // 0x2e8(0x20)
	bool InitialTimeObjectiveCountSet; // 0x308(0x01)
	char pad_309[0x7]; // 0x309(0x07)
	struct FDataTableRowHandle Dialogue; // 0x310(0x20)
	bool NotInSaferoom; // 0x330(0x01)

	void GetTimeForThreatByDifficulty(); // Function Objective_Base_Mod.Objective_Base_Mod_C.GetTimeForThreatByDifficulty // (None) // @ game+0xfffffffec0000000
};

