// WidgetBlueprintGeneratedClass OptionsGamepadLayoutXboxOne_WBP.OptionsGamepadLayoutXboxOne_WBP_C
// Size: 0x4d0 (Inherited: 0x488)
struct UOptionsGamepadLayoutXboxOne_WBP_C : UOptionsGamepadLayoutUserWidget {
	struct UCanvasPanel* ButtonArrows; // 0x488(0x08)
	struct UCanvasPanel* ButtonLabels; // 0x490(0x08)
	struct UCanvasPanel* ButtonSection; // 0x498(0x08)
	struct UCanvasPanel* Gamepad_XboxOne; // 0x4a0(0x08)
	struct UImage* GamepadImage_XboxOne_Fullsize; // 0x4a8(0x08)
	struct UImage* GamepadImage_XboxOne_Smaller; // 0x4b0(0x08)
	struct UCanvasPanel* StickArrows; // 0x4b8(0x08)
	struct UCanvasPanel* StickLabels; // 0x4c0(0x08)
	struct UCanvasPanel* StickSection; // 0x4c8(0x08)
};

