// WidgetBlueprintGeneratedClass OptionsGamepadLayoutPS5_WBP.OptionsGamepadLayoutPS5_WBP_C
// Size: 0x4c8 (Inherited: 0x488)
struct UOptionsGamepadLayoutPS5_WBP_C : UOptionsGamepadLayoutUserWidget {
	struct UCanvasPanel* ButtonArrows; // 0x488(0x08)
	struct UCanvasPanel* ButtonLabels; // 0x490(0x08)
	struct UCanvasPanel* ButtonSection; // 0x498(0x08)
	struct UCanvasPanel* Gamepad_PS5; // 0x4a0(0x08)
	struct UImage* GamepadImage_PS5; // 0x4a8(0x08)
	struct UCanvasPanel* StickArrows; // 0x4b0(0x08)
	struct UCanvasPanel* StickLabels; // 0x4b8(0x08)
	struct UCanvasPanel* StickSection; // 0x4c0(0x08)
};

