// WidgetBlueprintGeneratedClass PartyStatusEntry_WBP.PartyStatusEntry_WBP_C
// Size: 0x580 (Inherited: 0x4c8)
struct UPartyStatusEntry_WBP_C : UPartyStatusEntryUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4c8(0x08)
	struct UWidgetAnimation* Dots; // 0x4d0(0x08)
	struct UWidgetAnimation* StatusAlert; // 0x4d8(0x08)
	struct UImage* AbilityCooldown; // 0x4e0(0x08)
	struct UImage* BG_Gradient; // 0x4e8(0x08)
	struct UImage* BG_Incap_Gradient; // 0x4f0(0x08)
	struct UHorizontalBox* ConsumablesList; // 0x4f8(0x08)
	struct UImage* FogDimmer; // 0x500(0x08)
	struct USizeBox* HealthPanel; // 0x508(0x08)
	struct UPlatformIcon_WBP_C* PlatformIcon; // 0x510(0x08)
	struct UPlayerHealth_WBP_C* PlayerHealthBar; // 0x518(0x08)
	struct UPlayerMicIcon_WBP_C* PlayerMicIcon; // 0x520(0x08)
	struct UPlayerName_WBP_C* PlayerName; // 0x528(0x08)
	struct UPlayerStrikes_WBP_C* PlayerStrikes; // 0x530(0x08)
	struct UImage* Portrait; // 0x538(0x08)
	struct UTextBlock* PreRoundDots; // 0x540(0x08)
	struct UCanvasPanel* RootPanel; // 0x548(0x08)
	struct UImage* StatusIcon; // 0x550(0x08)
	struct UImage* StatusIconAnimation; // 0x558(0x08)
	struct UImage* ZombieAbility; // 0x560(0x08)
	struct UOverlay* ZombieAbilityPanel; // 0x568(0x08)
	struct UMaterialInstanceDynamic* CooldownMaterial; // 0x570(0x08)
	struct UTexture2D* DefaultZombiePortrait; // 0x578(0x08)

	void SequenceEvent__ENTRYPOINTPartyStatusEntry_WBP_5(); // Function PartyStatusEntry_WBP.PartyStatusEntry_WBP_C.SequenceEvent__ENTRYPOINTPartyStatusEntry_WBP_5 // (None) // @ game+0xfffffffec0000000
};

