// WidgetBlueprintGeneratedClass PostRoundScreen_WBP.PostRoundScreen_WBP_C
// Size: 0x709 (Inherited: 0x560)
struct UPostRoundScreen_WBP_C : UPostRoundScreen {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x560(0x08)
	struct UHorizontalBox* BasicSkipHbox; // 0x568(0x08)
	struct UOverlay* BGContainer; // 0x570(0x08)
	struct UImage* BGFill; // 0x578(0x08)
	struct UImage* BGImage; // 0x580(0x08)
	struct UTextBlock* ChainNameText; // 0x588(0x08)
	struct UPostRound_ChallengeResultsPanel_WBP_C* ChallengeResultsPanel; // 0x590(0x08)
	struct UPostRound_FinalScoresPanel_WBP_C* FinalScoresPanel; // 0x598(0x08)
	struct UFooter_WBP_C* FooterBG; // 0x5a0(0x08)
	struct UHorizontalBox* FooterContainer; // 0x5a8(0x08)
	struct UCanvasPanel* GlobalPanel; // 0x5b0(0x08)
	struct UHeader_WBP_C* HeaderBG; // 0x5b8(0x08)
	struct UPostRound_HoldoutPanel_WBP_C* HoldoutPanel; // 0x5c0(0x08)
	struct UPostRound_LineupPanel_WBP_C* LineupPanel; // 0x5c8(0x08)
	struct UVerticalBox* MapInfoHeader; // 0x5d0(0x08)
	struct UTextBlock* MapNameText; // 0x5d8(0x08)
	struct UPostRound_MatchStatsPanel_WBP_C* MatchStatsPanel; // 0x5e0(0x08)
	struct UPostRound_TabHeader_WBP_C* PostRound_TabHeader_WBP; // 0x5e8(0x08)
	struct UPostRound_UnlockPreviewPanel_WBP_C* PostRound_UnlockPreviewPanel_WBP; // 0x5f0(0x08)
	struct UPostRound_PvPStatsPanel_WBP_C* PvPStatsPanel; // 0x5f8(0x08)
	struct URating_WBP_C* Rating; // 0x600(0x08)
	struct UPlatformCalloutImage_WBP_C* RatingCallout; // 0x608(0x08)
	struct UHorizontalBox* RatingPanel; // 0x610(0x08)
	struct UPostRoundReadyButton_WBP_C* ReadyButton; // 0x618(0x08)
	struct UPostRound_ResultSplashPanel_WBP_C* ResultSplashPanel; // 0x620(0x08)
	struct UPlatformCalloutButton_WBP_C* SettingsCallout; // 0x628(0x08)
	struct UPlatformCalloutButton_WBP_C* SkipCallout; // 0x630(0x08)
	struct UPostRoundSummary_WBP_C* SummaryPanel; // 0x638(0x08)
	struct UPostRound_SwitchingSidesPanel_WBP_C* SwitchingSidesPanel; // 0x640(0x08)
	struct UHorizontalBox* TimerSkipHBox; // 0x648(0x08)
	struct UBaseTextBlock_C* TimerText; // 0x650(0x08)
	float TransitionDuration; // 0x658(0x04)
	char pad_65C[0x4]; // 0x65c(0x04)
	struct FSlateColor SuccessColor; // 0x660(0x30)
	struct FSlateColor FailureColor; // 0x690(0x30)
	bool bIsLevelReset; // 0x6c0(0x01)
	bool bHasUserSkipped; // 0x6c1(0x01)
	char pad_6C2[0x2]; // 0x6c2(0x02)
	float CurrentScreenDuration; // 0x6c4(0x04)
	bool bIsDebugMode; // 0x6c8(0x01)
	char pad_6C9[0x3]; // 0x6c9(0x03)
	float InitialTransitionDuration; // 0x6cc(0x04)
	int32_t TransitionSecondsRemaining; // 0x6d0(0x04)
	bool bAutoAdvanceStopped; // 0x6d4(0x01)
	char pad_6D5[0x3]; // 0x6d5(0x03)
	struct UTweenContainer* TweenContainer; // 0x6d8(0x08)
	struct TSoftObjectPtr<UTexture2D> BGTexture; // 0x6e0(0x28)
	bool bHasSetReady; // 0x708(0x01)

	void SetMapInfo(); // Function PostRoundScreen_WBP.PostRoundScreen_WBP_C.SetMapInfo // (None) // @ game+0xfffffffec0000000
};

