// WidgetBlueprintGeneratedClass PostRound_HoldoutPanel_WBP.PostRound_HoldoutPanel_WBP_C
// Size: 0x59c (Inherited: 0x450)
struct UPostRound_HoldoutPanel_WBP_C : UGobiUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x450(0x08)
	struct UBackgroundBlur* Blur; // 0x458(0x08)
	struct UHorizontalBox* EnemyTeamContainer; // 0x460(0x08)
	struct UBaseTextBlock_C* EnemyTeamScoreText; // 0x468(0x08)
	struct UBaseTextBlock_C* EnemyTeamText; // 0x470(0x08)
	struct UBaseTextBlock_C* EnemyTimeText; // 0x478(0x08)
	struct UImage* Fader; // 0x480(0x08)
	struct UBaseTextBlock_C* MatchStateMinor; // 0x488(0x08)
	struct UBaseTextBlock_C* ResultText; // 0x490(0x08)
	struct UMissionOverview_PvPRound_WBP_C* RoundInfo; // 0x498(0x08)
	struct UHorizontalBox* ScoreContainer; // 0x4a0(0x08)
	struct UVerticalBox* SwitchingSidesContainer; // 0x4a8(0x08)
	struct UBaseTextBlock_C* SwitchingSidesText; // 0x4b0(0x08)
	struct UImage* Tint; // 0x4b8(0x08)
	struct UHorizontalBox* YourTeamContainer; // 0x4c0(0x08)
	struct UBaseTextBlock_C* YourTeamScoreText; // 0x4c8(0x08)
	struct UBaseTextBlock_C* YourTeamText; // 0x4d0(0x08)
	struct UBaseTextBlock_C* YourTimeText; // 0x4d8(0x08)
	struct TArray<struct UAkAudioEvent*> GameWonDialogue; // 0x4e0(0x10)
	struct TArray<struct UAkAudioEvent*> GameLossDialogue; // 0x4f0(0x10)
	struct TArray<struct UAkAudioEvent*> GameTieDialogue; // 0x500(0x10)
	struct TArray<struct UAkAudioEvent*> SwitchOutDialogue; // 0x510(0x10)
	struct TArray<struct UAkAudioEvent*> SwitchInDialogue; // 0x520(0x10)
	struct TArray<struct UAkAudioEvent*> PostMatchWinning; // 0x530(0x10)
	struct TArray<struct UAkAudioEvent*> PostMatchLosing; // 0x540(0x10)
	struct TArray<struct UAkAudioEvent*> PostMatchNeutral; // 0x550(0x10)
	struct UTweenContainer* TweenContainer; // 0x560(0x08)
	float IntroOutroDuration; // 0x568(0x04)
	int32_t YourTeamScore; // 0x56c(0x04)
	int32_t EnemyTeamScore; // 0x570(0x04)
	char pad_574[0x4]; // 0x574(0x04)
	struct UTextBlock* TimerText; // 0x578(0x08)
	float YourTeamTime; // 0x580(0x04)
	float EnemyTeamTime; // 0x584(0x04)
	float TeamTime; // 0x588(0x04)
	bool bVictory; // 0x58c(0x01)
	char pad_58D[0x3]; // 0x58d(0x03)
	struct UTextBlock* ScoreText; // 0x590(0x08)
	int32_t TeamScore; // 0x598(0x04)

	void InitParams(); // Function PostRound_HoldoutPanel_WBP.PostRound_HoldoutPanel_WBP_C.InitParams // (None) // @ game+0xfffffffec0000000
};

