// WidgetBlueprintGeneratedClass PostRound_ChallengeResultsPanel_WBP.PostRound_ChallengeResultsPanel_WBP_C
// Size: 0x678 (Inherited: 0x5e0)
struct UPostRound_ChallengeResultsPanel_WBP_C : UPostRoundChallengeResultsUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5e0(0x08)
	struct UWidgetAnimation* RankUp; // 0x5e8(0x08)
	struct UWidgetAnimation* FadeInRank; // 0x5f0(0x08)
	struct UTextBlock* BestScore; // 0x5f8(0x08)
	struct UTextBlock* NewScore; // 0x600(0x08)
	struct UTextBlock* NewScoreDiff; // 0x608(0x08)
	struct UVerticalBox* ObjectivesList; // 0x610(0x08)
	struct UHorizontalBox* PointsPanel; // 0x618(0x08)
	struct UTextBlock* RankDiff; // 0x620(0x08)
	struct UImage* RankIcon; // 0x628(0x08)
	struct UTextBlock* RankName; // 0x630(0x08)
	struct UVerticalBox* RankPanel; // 0x638(0x08)
	struct UTextBlock* RankPoints; // 0x640(0x08)
	struct UProgressBar* RankProgress; // 0x648(0x08)
	struct UTextBlock* SupplyPoints; // 0x650(0x08)
	struct UTexture2D* NextRankIcon; // 0x658(0x08)
	struct FText NextRankName; // 0x660(0x18)

	void SequenceEvent__ENTRYPOINTPostRound_ChallengeResultsPanel_WBP_1(); // Function PostRound_ChallengeResultsPanel_WBP.PostRound_ChallengeResultsPanel_WBP_C.SequenceEvent__ENTRYPOINTPostRound_ChallengeResultsPanel_WBP_1 // (None) // @ game+0xfffffffec0000000
};

