// WidgetBlueprintGeneratedClass PostRoundSummary_WBP.PostRoundSummary_WBP_C
// Size: 0x5a5 (Inherited: 0x4b0)
struct UPostRoundSummary_WBP_C : UPostRoundSummaryUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4b0(0x08)
	struct UTextBlock* ActName; // 0x4b8(0x08)
	struct UVerticalBox* BreakdownContainer; // 0x4c0(0x08)
	struct UTextBlock* ContinueCount; // 0x4c8(0x08)
	struct UVerticalBox* ContinuesPanel; // 0x4d0(0x08)
	struct UTextBlock* ContinuesTitleText; // 0x4d8(0x08)
	struct UImage* Fader; // 0x4e0(0x08)
	struct UVerticalBox* HeaderContainer; // 0x4e8(0x08)
	struct UTextBlock* MapName; // 0x4f0(0x08)
	struct UMissionOverview_Footer_WBP_C* MissionOverview_Footer_WBP; // 0x4f8(0x08)
	struct UVerticalBox* MissionProgressContainer; // 0x500(0x08)
	struct UPlayerStrikes_WBP_C* PlayerStrikes; // 0x508(0x08)
	struct UPostRound_UnlocksInsert_WBP_C* PostRound_UnlocksInsert_WBP; // 0x510(0x08)
	struct UVerticalBox* ProgressionContainer; // 0x518(0x08)
	struct UHorizontalBox* RewardIcons; // 0x520(0x08)
	struct UTextBlock* RewardMultiplier; // 0x528(0x08)
	struct UHorizontalBox* RewardsHeaderContainer; // 0x530(0x08)
	struct UVerticalBox* RewardsList; // 0x538(0x08)
	struct UVerticalBox* RewardsPanel; // 0x540(0x08)
	struct UImage* SPIcon; // 0x548(0x08)
	struct UBaseTextBlock_C* StartingPointUnlockText; // 0x550(0x08)
	struct UOverlay* StatsHeaderContainer; // 0x558(0x08)
	struct UVerticalBox* StatsList; // 0x560(0x08)
	struct UVerticalBox* StrikesPanel; // 0x568(0x08)
	struct UVerticalBox* SupplyPointContainer; // 0x570(0x08)
	struct UTextBlock* SupplyPointText; // 0x578(0x08)
	struct UBaseTextBlock_C* TitleText; // 0x580(0x08)
	bool Victory; // 0x588(0x01)
	char pad_589[0x7]; // 0x589(0x07)
	struct UTweenContainer* TweenContainer; // 0x590(0x08)
	float ListAnimDelay; // 0x598(0x04)
	bool bStatsTitleAnimPlayed; // 0x59c(0x01)
	bool bRewardsTitleAnimPlayed; // 0x59d(0x01)
	bool bRunOver; // 0x59e(0x01)
	char pad_59F[0x1]; // 0x59f(0x01)
	float IntroDuration; // 0x5a0(0x04)
	bool bIsDebugMode; // 0x5a4(0x01)

	void LoadCVars(); // Function PostRoundSummary_WBP.PostRoundSummary_WBP_C.LoadCVars // (None) // @ game+0xfffffffec0000000
};

