// WidgetBlueprintGeneratedClass PostRoundChallengeObjective_WBP.PostRoundChallengeObjective_WBP_C
// Size: 0x520 (Inherited: 0x4d8)
struct UPostRoundChallengeObjective_WBP_C : UPostRoundChallengeObjectiveUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4d8(0x08)
	struct UWidgetAnimation* FadeIn; // 0x4e0(0x08)
	struct UTextBlock* DiffText; // 0x4e8(0x08)
	struct UImage* Icon; // 0x4f0(0x08)
	struct UTextBlock* NewValue; // 0x4f8(0x08)
	struct UTextBlock* ObjectiveName; // 0x500(0x08)
	struct UTextBlock* OldValue; // 0x508(0x08)
	struct UTextBlock* PointsText; // 0x510(0x08)
	struct UCanvasPanel* RootPanel; // 0x518(0x08)

	void OnCountPointsStart(); // Function PostRoundChallengeObjective_WBP.PostRoundChallengeObjective_WBP_C.OnCountPointsStart // (None) // @ game+0xfffffffec0000000
};

