// BlueprintGeneratedClass SG05_BP.SG05_BP_C
// Size: 0x500 (Inherited: 0x4c0)
struct ASG05_BP_C : ABaseGun_Static_BP_C {
	struct UADSComponent* ADS; // 0x4c0(0x08)
	struct UFireModeShotgunComponent* FireModeShotgun; // 0x4c8(0x08)
	struct UBulletPenetrationComponent* BulletPenetration; // 0x4d0(0x08)
	struct UClipAmmoComponent* ClipAmmo; // 0x4d8(0x08)
	struct URecoilComponent* Recoil; // 0x4e0(0x08)
	struct USegmentedReloadComponent* SegmentedReload; // 0x4e8(0x08)
	struct USpreadComponent* Spread; // 0x4f0(0x08)
	struct UItemAnimationDataComponent* ItemAnimationData; // 0x4f8(0x08)
};

