// UserDefinedStruct SG_Tuning_Struct.SG_Tuning_Struct
// Size: 0x2e0 (Inherited: 0x00)
struct FSG_Tuning_Struct {
	struct FFireModeBaseTuning FireModeBase_49_4ADCF5864EC4D6111E59B795D07D335F; // 0x00(0x34)
	char pad_34[0x4]; // 0x34(0x04)
	struct FFireModeShotgunTuning FireModeShotgun_43_0EEE57C4443E4D897D2FABA46F931190; // 0x38(0x28)
	struct FSpreadTuning Spread_15_F415F8754C89D8B245443DA492E3C17B; // 0x60(0x60)
	struct FClipAmmoTuning ClipAmmo_38_0ED8BB83467E9BF857264E8D92A94F92; // 0xc0(0x04)
	struct FClipReloadTuning ClipReload_3_FD477EAF4A650B258356838D708AAE34; // 0xc4(0x0c)
	struct FSegmentedReloadTuning SegmentedReload_19_66F19B21455A1F0C5038B489E6A3B9C8; // 0xd0(0x14)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct FRecoilTuning Recoil_22_DC8CB9CB4F5E35EC5EDD538DF975F051; // 0xe8(0x140)
	struct FBulletPenetrationTuning BulletPenetration_35_B0DFEF324FDC430C19457FBCDEF271BB; // 0x228(0x04)
	struct FWeaponMoveSpeedTuning WeaponMoveSpeed_25_2A4A51ED41ECFB290774028D54D45726; // 0x22c(0x6c)
	struct FItemCycleTuning ItemCycle_30_CA9B082F48FA2D182031A2AE78627377; // 0x298(0x14)
	struct FADSTuning ADS_46_3AFB480F4AB0BAA4BA6137B19440AB7F; // 0x2ac(0x08)
	struct FItemAnimationDataTuning ItemAnimationData_32_D82CE8AB42820C1F65139D9223D1730A; // 0x2b4(0x2c)
};

