// AnimBlueprintGeneratedClass Sleeper_ABP.Sleeper_ABP_C
// Size: 0x980 (Inherited: 0x2f0)
struct USleeper_ABP_C : USleeperAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2f0(0x08)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x488(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x4b0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x528(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x558(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x5d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x600(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x678(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x6a8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x720(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x750(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x7c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7f8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x870(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8a0(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x950(0x30)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Sleeper_ABP.Sleeper_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

