// AnimBlueprintGeneratedClass SleeperNest_ABP.SleeperNest_ABP_C
// Size: 0x930 (Inherited: 0x2f0)
struct USleeperNest_ABP_C : USleeperAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2f0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2f8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x468(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x490(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x508(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x538(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x5b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x5e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x658(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x688(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x700(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x730(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x7a8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7d8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x850(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x880(0xb0)

	void AnimGraph(struct FPoseLink AnimGraph); // Function SleeperNest_ABP.SleeperNest_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

