// UserDefinedStruct SMG_Tuning_Struct.SMG_Tuning_Struct
// Size: 0x2b8 (Inherited: 0x00)
struct FSMG_Tuning_Struct {
	struct FFireModeBaseTuning FireModeBase_37_C638CE8245DA9A2DF671EB8595562AB2; // 0x00(0x34)
	char pad_34[0x4]; // 0x34(0x04)
	struct FFireModeSingleTraceTuning FireModeSingleTrace_31_B52AAF5342AAAD16A5D17ABAC0AF6B20; // 0x38(0x18)
	struct FSpreadTuning Spread_9_A10B47714F0C1FDBBA45D0A99B81AA19; // 0x50(0x60)
	struct FClipAmmoTuning ClipAmmo_28_EA5256ED4BD75CBDA8D3918B2AB5A4C8; // 0xb0(0x04)
	struct FClipReloadTuning ClipReload_3_FD477EAF4A650B258356838D708AAE34; // 0xb4(0x0c)
	struct FRecoilTuning Recoil_12_013AD06C4439A387B221B9ADD4185060; // 0xc0(0x140)
	struct FBulletPenetrationTuning BulletPenetration_25_60DBD0524003CD5A218C64AF3A4A4C64; // 0x200(0x04)
	struct FWeaponMoveSpeedTuning WeaponMoveSpeed_15_1BA8397A4DC21C92B95589A6E41E1556; // 0x204(0x6c)
	struct FItemCycleTuning ItemCycle_19_11FF028E4B6AF2DFF788C685C7EDDB99; // 0x270(0x14)
	struct FADSTuning ADS_34_E19DB30E493B335A23988E92DDCE60A9; // 0x284(0x08)
	struct FItemAnimationDataTuning ItemAnimationData_22_363449C6430A9955DEB58CA7D20B2F23; // 0x28c(0x2c)
};

