// UserDefinedStruct Sni_Tuning_Struct.Sni_Tuning_Struct
// Size: 0x2b8 (Inherited: 0x00)
struct FSni_Tuning_Struct {
	struct FFireModeBaseTuning FireModeBase_37_D9E8EFDC42D066DB5224E9AA490BD74E; // 0x00(0x34)
	char pad_34[0x4]; // 0x34(0x04)
	struct FFireModeSingleTraceTuning FireModeSingleTrace_31_2930F3884F5B95E1907B53AF3BCF55EB; // 0x38(0x18)
	struct FSpreadTuning Spread_9_A10B47714F0C1FDBBA45D0A99B81AA19; // 0x50(0x60)
	struct FClipAmmoTuning ClipAmmo_28_CA6B01F945A85F1B288B0AB11853ABAE; // 0xb0(0x04)
	struct FClipReloadTuning ClipReload_3_FD477EAF4A650B258356838D708AAE34; // 0xb4(0x0c)
	struct FRecoilTuning Recoil_12_657DC6F3473DC005944700896F0EC129; // 0xc0(0x140)
	struct FBulletPenetrationTuning BulletPenetration_25_F244BF114AFDD6F1B4F3DCBA89B1D9D4; // 0x200(0x04)
	struct FWeaponMoveSpeedTuning WeaponMoveSpeed_15_2168A74A4CAA2EEF788D1CAC87C944DE; // 0x204(0x6c)
	struct FItemCycleTuning ItemCycle_20_E492BC8E443F252E7B343BA9136D9754; // 0x270(0x14)
	struct FADSTuning ADS_34_12DFCFE546DDD060922ACD9E0E87DFA6; // 0x284(0x08)
	struct FItemAnimationDataTuning ItemAnimationData_22_A5702B9F440C090AF994FCB5858B3E0D; // 0x28c(0x2c)
};

