// AnimBlueprintGeneratedClass Tallboy_ABP.Tallboy_ABP_C
// Size: 0x2ba4 (Inherited: 0x7f0)
struct UTallboy_ABP_C : UZombieAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x7f0(0x08)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x7f8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x8b8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x970(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x998(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x9c0(0xb8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xa78(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xb80(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xc88(0x108)
	struct FAnimNode_SlopeWarping AnimGraphNode_SlopeWarping; // 0xd90(0x1a0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0xf30(0xf8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1028(0x20)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_6; // 0x1048(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_5; // 0x1138(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_4; // 0x1228(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x1318(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x1408(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x14f8(0xf0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x15e8(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x16a0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x16e8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1708(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1728(0x20)
	float __CustomProperty_LocoCounterYaw_A14F95BA435F7F5B791A43B621B504DD; // 0x1748(0x04)
	float __CustomProperty_AttackAimAlpha_A14F95BA435F7F5B791A43B621B504DD; // 0x174c(0x04)
	float __CustomProperty_ClimbWallOffset_A14F95BA435F7F5B791A43B621B504DD; // 0x1750(0x04)
	float __CustomProperty_LocoSpeedsBlendTime_A14F95BA435F7F5B791A43B621B504DD; // 0x1754(0x04)
	float __CustomProperty_LocoBlendTime_A14F95BA435F7F5B791A43B621B504DD; // 0x1758(0x04)
	char pad_175C[0x4]; // 0x175c(0x04)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_A14F95BA435F7F5B791A43B621B504DD; // 0x1760(0x68)
	struct FAnimState3P __CustomProperty_AnimState3P_A14F95BA435F7F5B791A43B621B504DD; // 0x17c8(0x08)
	struct FGobiAnimationState __CustomProperty_AnimationState_A14F95BA435F7F5B791A43B621B504DD; // 0x17d0(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_A14F95BA435F7F5B791A43B621B504DD; // 0x1828(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_A14F95BA435F7F5B791A43B621B504DD; // 0x1868(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_A14F95BA435F7F5B791A43B621B504DD; // 0x1884(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_A14F95BA435F7F5B791A43B621B504DD; // 0x18a0(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_A14F95BA435F7F5B791A43B621B504DD; // 0x18bc(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_A14F95BA435F7F5B791A43B621B504DD; // 0x18d8(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_A14F95BA435F7F5B791A43B621B504DD; // 0x1940(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x19f0(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1a98(0xa0)
	float __CustomProperty_LocoCounterYaw_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1b38(0x04)
	float __CustomProperty_AttackAimAlpha_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1b3c(0x04)
	float __CustomProperty_ClimbWallOffset_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1b40(0x04)
	float __CustomProperty_LocoSpeedsBlendTime_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1b44(0x04)
	float __CustomProperty_LocoBlendTime_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1b48(0x04)
	char pad_1B4C[0x4]; // 0x1b4c(0x04)
	struct FLocomotionPrediction __CustomProperty_LocoPredict_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1b50(0x68)
	struct FAnimState3P __CustomProperty_AnimState3P_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1bb8(0x08)
	struct FGobiAnimationState __CustomProperty_AnimationState_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1bc0(0x58)
	struct FAnimLocomotionData __CustomProperty_LocomotionData_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1c18(0x40)
	struct FAnimDirectionRange __CustomProperty_BackwardDirection_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1c58(0x1c)
	struct FAnimDirectionRange __CustomProperty_LeftDirection_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1c74(0x1c)
	struct FAnimDirectionRange __CustomProperty_RightDirection_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1c90(0x1c)
	struct FAnimDirectionRange __CustomProperty_ForwardDirection_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1cac(0x1c)
	struct FLocomotionPrediction __CustomProperty_LocoPredictState_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1cc8(0x68)
	struct FLocoTurnInPlace __CustomProperty_TurnInPlaceState_4FA85D2E4342B39185F20FBF1EF0CF8A; // 0x1d30(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1de0(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1e88(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x1eb0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1ef8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1fb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1fd8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x2000(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x20b8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x20e0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x2180(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x21a8(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x21f0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x22b0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x2368(0xb8)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2420(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2450(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x2508(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2530(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x25f8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2620(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2668(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2690(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x26b8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2780(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x2868(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2908(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2930(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x29e8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2a10(0x190)
	float AdditiveBlendWeight; // 0x2ba0(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Tallboy_ABP.Tallboy_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

