// AnimBlueprintGeneratedClass VendorBase_ABP.VendorBase_ABP_C
// Size: 0xf00 (Inherited: 0x340)
struct UVendorBase_ABP_C : UVendorAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x340(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x348(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x490(0x28)
	struct FAnimNode_FocusTrackingSequencePlayer AnimGraphNode_FocusTrackingSequencePlayer_6; // 0x4b8(0x128)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x5e0(0x30)
	struct FAnimNode_FocusTrackingSequencePlayer AnimGraphNode_FocusTrackingSequencePlayer_5; // 0x610(0x128)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x738(0x30)
	struct FAnimNode_FocusTrackingSequencePlayer AnimGraphNode_FocusTrackingSequencePlayer_4; // 0x768(0x128)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x890(0x30)
	struct FAnimNode_FocusTrackingSequencePlayer AnimGraphNode_FocusTrackingSequencePlayer_3; // 0x8c0(0x128)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x9e8(0x30)
	struct FAnimNode_FocusTrackingSequencePlayer AnimGraphNode_FocusTrackingSequencePlayer_2; // 0xa18(0x128)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb40(0x30)
	struct FAnimNode_FocusTrackingSequencePlayer AnimGraphNode_FocusTrackingSequencePlayer; // 0xb70(0x128)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc98(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xcc8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xd40(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xd70(0xb0)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0xe20(0x98)
	struct FAnimNode_CurveSource AnimGraphNode_CurveSource; // 0xeb8(0x40)
	struct UPoseAsset* FacePoseAsset; // 0xef8(0x08)

	void AnimGraph(struct FPoseLink AnimGraph); // Function VendorBase_ABP.VendorBase_ABP_C.AnimGraph // (None) // @ game+0xfffffffec0000000
};

