// WidgetBlueprintGeneratedClass VendorSubcategory_WBP.VendorSubcategory_WBP_C
// Size: 0x4d8 (Inherited: 0x498)
struct UVendorSubcategory_WBP_C : UVendorSubcategoryUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x498(0x08)
	struct UPlatformCalloutImage_WBP_C* NextPageCallout; // 0x4a0(0x08)
	struct UHorizontalBox* PageCalloutsHBox; // 0x4a8(0x08)
	struct UPagePips_WBP_C* PagePips_WBP; // 0x4b0(0x08)
	struct UHorizontalBox* PagesInfoHBox; // 0x4b8(0x08)
	struct UVendorItemPaginator_WBP_C* Paginator; // 0x4c0(0x08)
	struct UPlatformCalloutImage_WBP_C* PrevPageCallout; // 0x4c8(0x08)
	struct UBaseTextBlock_C* SubcategoryText; // 0x4d0(0x08)

	void FocusFirstItem(); // Function VendorSubcategory_WBP.VendorSubcategory_WBP_C.FocusFirstItem // (None) // @ game+0xfffffffec0000000
};

