// WidgetBlueprintGeneratedClass VendorScreen_WBP.VendorScreen_WBP_C
// Size: 0x698 (Inherited: 0x640)
struct UVendorScreen_WBP_C : UVendorScreen {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x640(0x08)
	struct UBackgroundBlur_WBP_C* BackgroundBlur_WBP; // 0x648(0x08)
	struct UPlatformCallouts_WBP_C* Callouts; // 0x650(0x08)
	struct UVerticalBox* ContentContainer; // 0x658(0x08)
	struct UFooter_WBP_C* Footer_WBP; // 0x660(0x08)
	struct UHeader_WBP_C* Header_WBP; // 0x668(0x08)
	struct UHUDEquipmentPanel_WBP_C* HUDEquipmentPanel; // 0x670(0x08)
	struct UGobiScrollBox_C* ItemScrollBox; // 0x678(0x08)
	struct UPlayerMoney_WBP_C* PlayerMoney; // 0x680(0x08)
	struct UItemPickupToolTip_WBP_C* Tooltip; // 0x688(0x08)
	struct UTweenContainer* TweenOpenContainer; // 0x690(0x08)

	void SetOpenTween(); // Function VendorScreen_WBP.VendorScreen_WBP_C.SetOpenTween // (None) // @ game+0xfffffffec0000000
};

