// WidgetBlueprintGeneratedClass VoipOverlay_WBP.VoipOverlay_WBP_C
// Size: 0x498 (Inherited: 0x458)
struct UVoipOverlay_WBP_C : UVoipOverlayUserWidget {
	struct UVoipOverlayEntry_WBP_C* Entry1; // 0x458(0x08)
	struct UVoipOverlayEntry_WBP_C* Entry2; // 0x460(0x08)
	struct UVoipOverlayEntry_WBP_C* Entry3; // 0x468(0x08)
	struct UVoipOverlayEntry_WBP_C* Entry4; // 0x470(0x08)
	struct UVoipOverlayEntry_WBP_C* Entry5; // 0x478(0x08)
	struct UVoipOverlayEntry_WBP_C* Entry6; // 0x480(0x08)
	struct UVoipOverlayEntry_WBP_C* Entry7; // 0x488(0x08)
	struct UVoipOverlayEntry_WBP_C* Entry8; // 0x490(0x08)
};

