// BlueprintGeneratedClass WanderConditionSetBase.WanderConditionSetBase_C
// Size: 0x3c0 (Inherited: 0x78)
struct UWanderConditionSetBase_C : UAISpawnConditionEvaluatorSet {
	struct FAISpawnEval_PacingPhase ViolentOrPeakSustain; // 0x78(0x48)
	struct FAISpawnEval_Cooldown Cooldown; // 0xc0(0x58)
	struct FAISpawnEval_CheckCardTags Check Card Tags; // 0x118(0x90)
	struct FAISpawnEval_CheckCharacterTags Check Character Tags; // 0x1a8(0x90)
	struct FAISpawnEval_Cooldown Cooldown_3; // 0x238(0x58)
	struct FAISpawnEval_Chance Chance; // 0x290(0x58)
	struct FAISpawnEval_RotatingCooldown Cooldown_Rotating; // 0x2e8(0x48)
	struct FAISpawnEval_TeamInSafeRoom TeamInSafeRoom; // 0x330(0x48)
	struct FAISpawnEval_TeamInPreparationArea TeamInPreparationArea; // 0x378(0x48)
};

